#专属水印，内测版。
#版本1.0100
# //版权所有，不得抄袭！
# //简洁才是王道哦！
# /**  武汉加油！中国加油！全世界加油！ **/
# //大家也要努力哦！
from os import *#我是水印李承骏
from time import *#我是水印李承骏
from sys import *#我是水印李承骏
from xes.ext import*#我是水印李承骏
def b (text):
    stdout.write('\r'+' '*0+'\r')
    stdout.flush()
    for df in text:
        stdout.write(df)
        stdout.flush()
        sleep(0.1) 
    print()
def PEN (text):
    stdout.write('\r'+' '*0+'\r')
    stdout.flush()
    for df in text:
        stdout.write(df)
        stdout.flush()
        sleep(0.1) 
    print()
def xg (text):
    stdout.write('\r'+' '*0+'\r')
    stdout.flush()
    for df in text:
        stdout.write(df)
        stdout.flush()
        sleep(0.1) 
    print()
def x (text):
    stdout.write('\r'+' '*0+'\r')
    stdout.flush()
    for df in text:
        stdout.write(df)
        stdout.flush()
        sleep(0.1) 
    print()#我是水印李承骏
def a (text):
    stdout.write('\r'+' '*0+'\r')
    stdout.flush()
    for df in text:
        stdout.write(df)
        stdout.flush()
        sleep(0.1) 
    print()
def LOGO(a):
    b=len(a)
    for i in range(b):
        if a[i]=="0":
            print("\033[0m ",end="")
            sleep(0.0005)
        if a[i]=="1":
            print("\033[41m ",end="")
            sleep(0.0005)
        if a[i]=="2":
            print("\033[42m ",end="")
            sleep(0.0005)
        if a[i]=="3":
            print("\033[103m ",end="")
            sleep(0.0005)
        if a[i]=="4":
            print("\033[44m ",end="")
            sleep(0.0005)
        if a[i]=="5":
            print("\033[45m ",end="")
            sleep(0.0005)
        if a[i]=="6":
            print("\033[46m ",end="")
            sleep(0.0005)
        if a[i]=="7":
            print("\033[47m ",end="")
            sleep(0.0005)
        if a[i]=="9":
            print("\033[49m ",end="")
            sleep(0.0005)
    print("\033[0m")#我是水印李承骏
#下面的啥玩意？不晓得。
# v color(string s,bool l,bool end,double time)//这是我自研的color函数 l控制亮色和暗色 end控制是否换行
# {
#   for(int i=0;i<s.size();i++)//遍历字符串
#   {
#       if(l) cout<<"\033[10";//这是亮色
#       else cout<<"\033[4";//这是暗色
#       if(s[i]==' ') cout<<"\033[0m ";//遇到空格就什么都不输出
#       else cout<<s[i]<<"m \033[0m";//否则输出变量对应的颜色
#   }
#   if(end)cout<<endl;//这是输出换行#我是水印李承骏
#   usleep(time*1000000);
# }#我是水印李承骏
#我是水印李承骏＆缪子航
while True:#我是水印李承骏
    print("\033[4;30;104m  \033[0;30;107m 🆒  酷喵一下，你就知道 × \033[4;104m +                                                                  ➖  ⬜  ❌  \033[000m" )
    print("  \033[90m←   →\033[000m    ↩      🏚      🔒\033[92m  https://\033[37mwww.PENGUO.kumiao.qinhaoming.manwei.PENGUO.com     \033[34m ★       \033[000m· · ·") 
    print("\033[4m\033[36m   💯 百度    📚 学而思网校    🏦 PEN果公司   💽 酷喵浏览器    🌐 App Store   ⭐ 星光工作室     🎮  游戏中心   \033[000m")
    print("新闻  hao123  地图  视频  贴吧  学术  更多                                        抗击肺炎  设置  \033[104m登录\033[0m")
    print("                                           \033[91m\033[44m酷\033[49m\033[94mku\033[91mmiao\033[94m\033[41m喵\033[49m\n")
    print("                       \033[94m┌───────────────────────────────────────────────┐")
    print("                       \033[94m│\033[37m                                             📷 \033[94m│\033[104m\033[37m酷喵一下\033[000m")#//防伪//水印PEN果
    print("                       \033[94m└───────────────────────────────────────────────┘\n")
    print("                       \033[93m酷喵热搜\033[0m                                🔄  换一换")
    print("                             \033[91m① 两会 🔥\033[0m                 ④ 赌王逝世")
    print("                             ② 点赞的人               ⑤ 抗击肺炎")
    print("                             ③ 游戏中心               ⑥ 飞机")
    a = input("                        \033[7A\033[000m")
    system("clear")
    print("\033[4;30;104m  |🆒  酷喵一下，你就知道 ×\033[0;30;107m🆒  酷喵一下，调用词库 ×\033[4;30;104m  +                                          ➖   ⬜  ❌  \033[000m")
    print("  \033[37m←   \033[90m→\033[000m    ↩       🏚      🔒\033[92m  https://\033[37mwww.PENGUO.kumiao.com\033[90m/kumiaociku/diaoyong.2020\033[000m     \033[34m ★       \033[000m· · ·  ") 
    print("\033[4m\033[36m   💯 百度    📚 学而思网校    🏦 PEN果公司   💽 酷喵浏览器    🌐 App Store   ⭐ 星光工作室     🎮  游戏中心   \033[000m\n")
    if a =="飞机":#水印PEN＆星光
        print("搜索：飞机")#新边框
        print("┌──────────┐")#新边框
        print("│----------│")#新边框
        print("│   飞机   │")#新边框
        print("│----------│")#新边框
        print("└──────────┘")#新边框
        print("1、介绍")#新边框
        print("2、动画演示1.01")#新边框
        at = input("请输入（数字）：")#新边框
        if at == "1":
            b("飞机（aeroplane,airplane）是指具有一具或多具发动机的动力装置产生前进的推力或拉力，由机身的固定机翼产生升力，在大气层内飞行的重于空气的航空器。  飞机是20世纪初最重大的发明之一，公认由美国人莱特兄弟发明。他们在1903年12月17日进行的飞行作为“第一次重于空气的航空器进行的受控的持续动力飞行”被国际航空联合会（FAI）所认可，同年他们创办了“莱特飞机公司”。自从飞机发明以后，飞机日益成为现代文明不可缺少的工具。它深刻的改变和影响了人们的生活，开启了人们征服蓝天历史。 ")
            sleep(3)#我是水印李承骏
            system("clear")
        if at == "2": #新边框        
            b("开始看动画了！\n")
            sleep(1)
            system("clear")
            print("                 ")
            print("                 ")
            print("                 ")
            print("                 ")
            print("                 ")
            print("                 ")
            print("                 ")
            print("✈               ")
            sleep(1)
            system("clear")
            print("                 ")
            print("                 ")
            print("                 ")
            print("                 ")
            print("                 ")
            print("                 ")
            print("                 ")
            print("  ✈             ")
            sleep(1)
            system("clear")
            print("                 ")
            print("                 ")
            print("                 ")
            print("                 ")
            print("                 ")
            print("                 ")
            print("                 ")
            print("    ✈           ")
            sleep(1)
            system("clear")
            print("                 ")
            print("                 ")
            print("                 ")
            print("                 ")
            print("                 ")
            print("                 ")
            print("                 ")
            print("     ✈          ")
            sleep(1)
            system("clear")
            print("                 ")
            print("                 ")
            print("                 ")
            print("                 ")
            print("                 ")
            print("                 ")
            print("        🛫  ")
            print("                 ")
            sleep(1)
            system("clear")
            print("                 ")
            print("                 ")
            print("                 ")
            print("                 ")
            print("                 ")
            print("         🛫      ")
            print("                 ")
            print("                 ")
            sleep(1)
            system("clear")
            print("☁    ☁        ")
            print("       ☁      ")
            print("                 ")
            print("                 ")
            print("          🛫     ")
            print("                 ")
            print("                 ")
            print("                 ")
            sleep(1)
            system("clear")
            print("☁    ☁        ")
            print("           ☁  ")
            print("  ☁              ")
            print("             🛫  ")
            print("                 ")
            print("                 ")
            print("                 ")
            print("                 ")
            sleep(1)
            system("clear")
            print("☁    ☁        ")
            print("           ☁  ")
            print("  ☁              ")
            print("             🛫  ")
            print("                 ")
            print("                 ")
            print("                 ")
            print("                 ")
            sleep(1)
            system("clear")
            print("☁    ☁        ")
            print("           ☁  ")
            print("  ☁              ")
            print("               🛬 ")
            print("                 ")
            print("                 ")
            print("                 ")
            print("                 ")
            sleep(1)
            system("clear")
            print("☁    ☁        ")
            print("                ")
            print("                 ")
            print("                 ")
            print("                  🛬")
            print("                 ")
            print("                 ")
            print("                 ")
            sleep(1)
            system("clear")
            print("☁    ☁        ")
            print("                ")
            print("                 ")
            print("                 ")
            print("                  ")
            print("                   🛬")
            print("                 ")
            print("                 ")
            sleep(1)
            system("clear")
            print("☁    ☁        ")
            print("                ")
            print("                 ")
            print("                 ")
            print("                  ")
            print("                   ")
            print("                    ")
            print("                  ")
            sleep(1)
            system("clear")
            print("☁    ☁        ")
            print("                ")
            print("                 ")
            print("                 ")
            print("                  ")
            print("                   ")
            print("                     🛬")
            print("                  ")
            sleep(1)
            system("clear")
            print("                ")
            print("                ")
            print("                 ")
            print("                 ")
            print("  ☁              ")
            print("                   ")
            print("                     ")
            print("                      🛬")#我是水印李承骏
            sleep(1)
            system("clear")
            print("                ")
            print("                ")
            print("     🌫           ")
            print("           🌫     ")
            print("  ☁              ")
            print("         🌫          ")
            print("                     ")
            print("                      🛬")
            sleep(3)
            system("clear")
    elif a == "C++" or a == "c++":
    
        print("搜索：C++")
        print("┌──────────┐  ")
        print("│----------│  ")
        print("│   C++    │  编程语言💻")
        print("│----------│  ")
        print("└──────────┘  ")
        b("C++是一种面向对象的计算机程序设计语言，由美国AT&T贝尔实验室的本贾尼·斯特劳斯特卢普博士发明并实现（最初这种语言被称作“C with Classes”带类的C）。它是一种静态数据类型检查的、支持多重编程范式的通用程序设计语言。它支持过程化程序设计、数据抽象、面向对象程序设计、泛型程序设计等多种程序设计风格。\nC++是C语言的继承，进一步扩充和完善了C语言，成为一种面向对象的程序设计语言。C++这个词在中国大陆的程序员圈子中通常被读做“C++”，而西方的程序员通常读做“C plus plus”，“CPP”。" )
        sleep(3)
        system("clear")
    
    elif a == "baidu" or a == "百度":
    
        print("搜索：百度/baidu" )
        print("┌──────────┐") 
        print("│----------│") 
        print("│   百度   │💯 全球最大的中文搜索引擎、最大的中文网站")
        print("│----------│") 
        print("└──────────┘") 
        b("百度，全球最大的中文搜索引擎、最大的中文网站。百度二字，来自于八百年前南宋词人辛弃疾的一句词：众里寻他千百度。这句话描述了词人对理想的执着追求。1999年底，身在美国硅谷的李彦宏看到了中国互联网及中文搜索引擎服务的巨大发展潜力，抱着技术改变世界的梦想，他毅然辞掉硅谷的高薪工作，携搜索引擎专利技术，于 2000年1月1日在中关村创建了百度公司。")
        sleep(3)
        system("clear")
    elif a == "酷喵浏览器":#我是水印李承骏
        print("搜索：酷喵浏览器")
        print("┌──────────┐")
        print("│----------│")
        print("│\033[104m酷喵浏览器\033[000m│   专注极速/无推装/无限速的浏览器") #<< endl;
        print("│----------│                  尽享极致生活！")
        print("└──────────┘")
        b("酷喵浏览器{PEN果研发}")
        b("原【酷喵搜索】")
        b("酷喵浏览器适配于各种电脑以及【手机（Beta）】，暂不支持XP系统。酷喵浏览器采用【PEN果自研PKEN核心引擎以及GMS搜索引擎（PEN果自研引擎）】，实现了{极速，流畅，无恶意程序等多方面优点}。插件正在制作中···")
        sleep(3);
        system("clear")  
    elif a == "易语言" or a == "EPL" or a == "erl" or a == "Erl":
        print("搜索：易语言")
        print("┌──────────┐")
        print("│----------│")
        print("│  易语言  │     专为中国人设置的简单编程语言")
        print("│----------│")
        print("└──────────┘")    
        b("易语言（EPL）是一门以中文作为程序代码编程语言，其以“易”著称，创始人为吴涛。易语言早期版本的名字为E语言。其最早的版本的发布可追溯至2000年9月11日。创造易语言的初衷是进行用中文来编写程序的实践，方便中国人以中国人的思维编写程序，并不用再去学习西方思维。易语言的诞生极大的降低了编程的门槛和学习的难度。从2000年以来，易语言已经发展到一定的规模，功能上、用户数量上都十分可观。")
    
    
    
    

    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    #//游戏中心
    #//持续更新中
    #//----------------------------------------------------------------------------------
    elif a == "游戏中心" or a == "游戏":#我是水印李承骏
        system("clear")#;
        print("\033[4;30;104m  |🆒  酷喵一下，你就知道 ×\033[0;30;107m🎮  游戏中心，欢迎你  ×\033[4;30;104m  +                                           ➖   ⬜  ❌  \033[000m")
        print("  \033[90m←   →\033[000m    ↩      🏚      🔒\033[92m  https://\033[37mwww.youxizhongxin/1001.com     \033[34m ★       \033[000m· · ·" )#<< endl;//我是水印子航
        print("\033[4m\033[36m   💯 百度    📚 学而思网校    🏦 PEN果公司   💽 酷喵浏览器    🌐 App Store   ⭐ 星光工作室     🎮  游戏中心   \033[000m\n")
        print("搜索：游戏中心")# #<< endl;
        print("┌──────────────┐" )##<< endl;
        print("│ 纯净/无广告的│" )##<< endl;
        print("│--------------│" )##<< endl;
        print("│ 1001游戏中心 │     纯净/无广告的自带游戏中心")# #<< endl;
        print("│--------------│     {游戏中心，欢迎你！}")# #<< endl;
        print("└──────────────┘")# #<< endl; 
        b("即将为你进入{游戏模式}！（2秒）")#;
        sleep(2)
        system("clear")#;
        print("0、返回主页1.0" )##<< endl;
        print("1、狂荡4.0" )##<< endl;//此程序由【星光】出品
        print("2、推箱子1.01")# #<< endl;
        print("3、井字棋(小饼干)")# #<< endl;
        print("")## << endl;
        print("")# #<< endl;
        y1001 = input("请输入数字：")#;#我是水印李承骏
        if y1001 == "0":
            print("/返回主页")#<< endl;
            sleep(1)
            system("clear")
        elif y1001 == "1":
            b("此程序由【星光工作室】独家提供支持！")
            b("此程序在暂不支持{网页版}使用")
            print("源代码网址：↓")# << endl;
            print("https://code.xueersi.com/home/project/detail?lang=code&pid=5765134&version=python&form=python&langType=python")# << endl;
            input("按任意键继续：")
            system("clear")
        elif y1001 == "2":
            b("推箱子暂未开放")
            sleep(1)
            system("clear")
        elif y1001 == "3":
            b("小饼干老师作，酷喵浏览器收录")
            import time,random
            a="""+---+---+---+
| 1 | 2 | 3 |
+---+---+---+
| 4 | 5 | 6 |
+---+---+---+
| 7 | 8 | 9 |
+---+---+---+
            """
            aa=a
            def fun(line):
                for i in range(len(line)):
                    print("\r"+line[0:i+1],end="")
                    time.sleep(0.1)
                print()
            print("\033[1;36m欢迎访问\033[1;33m饼干牌\033[1;36m井字棋游戏!💕")
            fun("本游戏可转载收藏，借鉴修改")
            fun("游戏三分钟，编程三小时")
            fun("玩法如下:")
            time.sleep(0.5)
            print("\n\033[1;37m"+a)
            fun("\033[1;33m游戏玩法:轮流落棋")
            fun("达成三行、三列、斜对角")
            fun("任意三子一线即为胜利！！！")
            print("\033[1;36m",end="")
            time.sleep(0.5)
            
            
            def sun():
                global a,flag,all,aa,pas
                print("\033[1;31m")
                fun("胜负无常，落子无悔💕")
                print("\033[1;36m")
                fun("1:人机对弈模式💕")
                fun("2:双人对弈模式💕")
                type=input("\n\033[1;33mQ: 您选择的模式是:")
                while type!="1" and type!="2":
                    print("\033[1A\033[K\033[1;31m输入有误，请重新输入")
                    time.sleep(1)
                    print("\033[1A\033[K",end="")
                    type=input("\033[1;33mQ: 您选择的模式是:")
                print("\033[0m",end="")
                
                b=[
                [16,20,24], 
                [44,48,52],
                [72,76,80],
                [16,44,72],
                [20,48,76],
                [24,52,80],
                [16,48,80], 
                [72,48,24],]
                flag=True
                all=[]
                def bin():
                    print("\033[1;33m",end="")
                    global a,flag,all
                    if flag:
                        print("🎈  回合",end="---")
                    else:
                        print("🚀  回合",end="---")
                    location=input("请输入落子位置:")
                    print("\033[0m",end="")
                    while location not in ["1","2","3","4","5","6","7","8","9"]:
                        print("\033[1A\033[K\033[1;31m输入有误，请输入1~9")
                        time.sleep(1)
                        print("\033[1A\033[K\033[1;33m",end="")
                        if flag:
                            print("🎈  回合",end="---")
                        else:
                            print("🚀  回合",end="---")
                        location=input("请输入落子位置:")
                    if location in all:
                        print("\033[1A\033[K\033[1;31m已有落子,请选择其他位置")
                        time.sleep(1)
                        print("\033[1A\033[K",end="")
                        return 
                    all.append(location)
                    print(len(all))
                    if flag:
                        a1=a.replace(location,"🎈")
                        a=a1
                        flag=not flag
                    else:
                        a2=a.replace(location,"🚀")
                        a=a2
                        flag=not flag
                    print("\033[0m",end="")
                    print("\033[100A\033[2J"+a)
                  
                def gan():
                    global a,aa,all
                    while True:
                        bin()
                        for i in b:
                            if a[i[0]]==a[i[1]]==a[i[2]]:
                                print("\033[1;36m"+a[i[0]]+"  胜利,游戏结束")
                                goon=input("\n继续畅玩输入1,其余键退出")
                                if goon=="1":
                                    a=aa
                                    all=[]
                                    print("\033[100A\033[2J"+a)
                                    sun()
                                else:
                                    print("\033[1;36m"+"小饼干祝你天天开心")
                                return
                        if len(all)==9:
                            name=input("和棋！重玩输入1，其余键退出:")
                            if name =="1":
                                a=aa
                                all=[]
                                print("\033[100A\033[2J"+a)
                                gan()
                            else:
                                print("\033[1;36m"+"小饼干祝你天天开心")
                            return
                
                pas=["1","2","3","4","5","6","7","8","9"]
                def bin1():
                    print("\033[1;33m",end="")
                    global a,flag,all,pas
                    if flag:
                        print("🎈  回合",end="---")
                        location=input("请输入落子位置:")
                        if location in pas:
                            pas.remove(location)
                    else:
                        print("🚀  回合",end="---")
                        rand=random.choice(pas)
                        location=str(rand)
                        pas.remove(rand)
                    print("\033[0m",end="")
                    while location not in ["1","2","3","4","5","6","7","8","9"]:
                        print("\033[1A\033[K\033[1;31m输入有误，请输入1~9")
                        time.sleep(1)
                        print("\033[1A\033[K\033[1;33m",end="")
                        if flag:
                            print("🎈  回合",end="---")
                            location=input("请输入落子位置:")
                            if location in pas:
                                pas.remove(location)
                        else:
                            print("🚀  回合",end="---")
                            rand=random.choice(pas)
                            location=str(rand)
                            pas.remove(rand)
                    if location in all:
                        print("\033[1A\033[K\033[1;31m已有落子,请选择其他位置")
                        time.sleep(1)
                        print("\033[1A\033[K",end="")
                        return 
                    all.append(location)
                    if flag:
                        a1=a.replace(location,"🎈")
                        a=a1
                        flag=not flag
                    else:
                        time.sleep(0.5)
                        a2=a.replace(location,"🚀")
                        a=a2
                        flag=not flag
                    print(a)
                    
                    print("\n\033[0m\033[100A\033[2J"+a)
                  
                def gan1():
                    global a,aa,all,pas
                    while True:
                        bin1()
                        for i in b:
                            if a[i[0]]==a[i[1]]==a[i[2]]:
                                print("\033[1;36m"+a[i[0]]+"  胜利,游戏结束")
                                goon=input("\n继续畅玩输入1,其余键退出")
                                if goon=="1":
                                    a=aa
                                    pas=["1","2","3","4","5","6","7","8","9"]
                                    all=[]
                                    print("\033[100A\033[2J"+a)
                                    sun()
                                else:
                                    print("\033[1;36m"+"小饼干祝你天天开心")
                                return
                        if len(all)==9:
                            name=input("和棋！重玩输入1，其余键退出:")
                            if name =="1":
                                a=aa
                                pas=["1","2","3","4","5","6","7","8","9"]
                                all=[]
                                print("\033[100A\033[2J"+a)
                                gan1()
                            else:
                                print("\033[1;36m"+"小饼干祝你天天开心")
                            return
                if type=="2":
                    print("\033[100A\033[2J"+a)
                    gan()
                if type=="1":
                    print("\033[100A\033[2J"+a)
                    gan1()
            sun()
            from os import *#我是水印李承骏
            from time import *#我是水印李承骏
            from sys import *#我是水印李承骏
            from xes.ext import*#我是水印李承骏
            sleep(3)
            system("clear")
        else:
            b("游戏持续更新中....")#我是水印李承骏＆缪子航
            sleep(1)
            system("clear")
    #//持续更新中
    #//------------------------------------------------------------------------------
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    elif a == "猿辅导":
        print("搜索：猿辅导" )#<< endl;
        print("┌──────────┐" )#<< endl;
        print("│----------│" )#<< endl;
        print("│  猿辅导  │" )#<< endl;#我是水印李承骏＆缪子航
        print("│----------│" )#<< endl;
        print("└──────────┘" )#<< endl;
        b("截至2020年1月，猿辅导在线教育全国累计用户数突破4亿。 [1] 公司旗下拥有猿辅导、小猿搜题、猿题库、小猿口算、斑马AI课等多款在线教育产品。 [2-3] 猿辅导提供中小学全学科的课程，全国任何地区的中小学生，都可在家上名师直播课 [4]  。2019年6月11日，猿辅导入选“2019福布斯中国最具创新力企业榜”。 [5-6] 2019年12月16日，猿辅导、小猿搜题、猿题库、小猿口算、斑马英语列入第一批教育App备案名单。 [7] 猿辅导创立于2012年 [2]  ，顺利完成由IDG资本、高瓴资本、博裕资本、华平投资、腾讯等知名基金、巨头公司领投的多轮融资，估值超过78亿美元。 [8]  是K-12（覆盖学前到12年义务教育）在线教育首个独角兽公司 [9]  ，“2019胡润品牌榜-最具价值中国品牌”。")#;//水印子航/PEN果
        sleep(3)
        system("clear")
    elif a == "《哈利·波特》" or a== "《哈利波特》" :
        print("┌──────────┐" )#<< endl;
        print("│----------│" )#<< endl;
        print("│上载许可证│  无病毒及广告" )#<< endl;
        print("│----------│" )#<< endl;
        print("└──────────┘" )#<< endl;
        print("由[霍格沃茨工作室]出品的{破特瞭望站}（《哈利·波特》百科），专注制作关于《哈利·波特》的内容" )#<< endl;
        b("《哈利·波特》是英国作家J·K·罗琳的魔幻文学系列小说，共7集，其中前六部以霍格沃茨魔法学校为主要舞台，描写的是主人公哈利·波特在霍格沃茨魔法学校六年的学习生活和冒险故事。第七本描写的是哈利·波特在校外寻找魂器并消灭伏地魔的故事。\n")
        b("《哈利·波特》小说中的善与恶的矛盾对立主要分为两条线索：")
        b("第一条是以哈利与伏地魔为代表的善与恶的对立；\n")
        b("第二条是以哈利自我心中对于恶的抗争作为暗线而展开的。正是因为故事的设定有着哈利的自我抗争，也才使其英雄形象更为饱满。\n");
        b("该系列小说是用第三人称模式表述的，以哈利·波特为中心人物，除了第1部、第4部、第6部和第7部的少数内容，全书全程透过哈利自己的视角来表述，这也是读者认为阅读这系列书有亲切感的原因之一。\n")
        sleep(3)#我是水印李承骏＆缪子航
        system("clear")
    elif a=="Harry Potter"or a=="哈利波特"or a=="Harry"or a=="哈利·波特"or a=="破特"or a=="Potter"or a=="波特"or a=="harry"or a=="哈利"or a=="potter"or a=="the boy who lived"or a=="小哈"or a=="救世主"or a=="大难不死的男孩":
        print("┌──────────┐")# << endl;
        print("│----------│")# << endl;
        print("│上载许可证│ 无病毒及广告" )# << endl;
        print("│----------│")# << endl;
        print("└──────────┘")# << endl;
        print("由[霍格沃茨工作室]出品的{破特瞭望站}（《哈利·波特》百科），专注制作关于《哈利·波特》的内容")# << endl;
        b("哈利· 波特，英文Harry Potter，别称救世主，大难不死的男孩，疤头，救世之星，得分队长（在《混血王子》里德拉科的嘲讽）。哈迷们也称他为破特，小哈，毒蛇……不对，毒舌哈，黄金男孩。黑色头发，绿色眼睛。格兰芬多学院。魔杖：冬青木，11英寸，内含一根凤凰羽毛。守护神是牡鹿。哈利生于1980年7月31日，狮子座。死于……目前作者未知。对于哈利的身高，本作来辟辟谣：来来来，辟谣了。我相信很多人被电影给带了，所以，认为哈利只有1.65米。但是，在原著中描述，哈利和他爸詹姆的身高不超过1英寸，so，他的身高估计是1.82米。哈利童年时很矮小因为10年来的营养不良，但是将近成年时突飞猛进。好的辟谣完毕，我们继续。著名事例：杀死蛇怪；赢得三强争霸赛冠军；杀死伏地魔（555，V殿）。祖上还和伏地魔有血缘关系。（所以小哈有一点斯莱特林的血统？不可能吧）他与金妮 · 韦斯莱组了CP（德哈、哈赫、哈秋、斯哈、伏哈、哈罗党：啊啊啊啊；哈金党：GOOD）。但是，他的初恋是秋·张（哈秋党：还算有点安慰）。哈利成年后当了傲罗办公室主任，后来成为了法律执行司司长。\n")#;
        sleep(3)
        system("clear")
    elif a=="Ron Weasly"or a=="Ron"or a=="罗恩"or a=="罗恩韦斯莱"or a=="ron"or a=="ron weasly"or a=="Ronald Weasly"or a=="罗纳德韦斯莱"or a=="Ronald"or a=="罗纳德":
        print("┌──────────┐" )#<< endl;
        print("│----------│" )#<< endl;
        print("│上载许可证│  无病毒及广告" )#<< endl;
        print("│----------│" )#<< endl;
        print("└──────────┘" )#<< endl;#我是水印李承骏＆缪子航
        print("由[霍格沃茨工作室]出品的{破特瞭望站}（《哈利·波特》百科），专注制作关于《哈利·波特》的内容")# << endl;
        b("罗纳德·韦斯莱，英文Ronald Weasly，昵称罗恩，英文Ron，还有一段时间被称为罗-罗，英文Won Wons（这个英文作者不太确定），还有弗雷德和乔治的“小罗尼”。红色头发，蓝色眼睛。格兰芬多学院。魔杖是柳木制的，内含一根独角兽尾毛，14英寸。他的守护神是一只杰克拉塞尔梗犬。罗恩生于1980年3月1日，双鱼座。死于……目前作者未知。罗恩的身高，是比较确定的。他的第二根魔杖比伏地魔的还长（越高的人魔杖越长）。所以，罗恩估计和伏地魔一样高或比伏地魔还要高。伏地魔的身高1.88米打底。所以，比伏地魔魔杖长那么一丢丢的罗恩，身高大概是1.89米。著名事例：用格兰芬多宝剑砍坏了斯莱特林的挂坠盒（伏地魔的魂器之一）。他和哈利可能有那么点血缘关系。（纯血统家族大多都有血缘关系）与赫敏·格兰杰结为夫妻。（德赫、哈赫、哈罗、罗拉、罗帕党：不要啊！罗赫党：GOOD）。但是，他的初恋是拉文德·布朗（罗拉党：还算有点安慰）。罗恩成年后当了一段时间的傲罗，后来去了韦斯莱魔法戏坊。（大概就这个名字）\n")#;
        sleep(3)
        system("clear")
    elif a=="Draco"or a=="Draco Malfoy"or a=="德拉科"or a=="德拉科马尔福"or a=="德拉科·马尔福"or a=="DRACO"or a=="DRACO MALFOY"or a=="draco"or a=="draco malfoy"or a=="拽哥":
        print("┌──────────┐" )#<< endl;
        print("│----------│" )#<< endl;
        print("│上载许可证│  无病毒及广告" )#<< endl;
        print("│----------│")# << endl;
        print("└──────────┘")# << endl;
        print("由[霍格沃茨工作室]出品的{破特瞭望站}（《哈利·波特》百科），专注制作关于《哈利·波特》的内容" )#<< endl;
        b("德拉科·马尔福，英文Draco Malfoy。名字取自天龙座（draco）。（作者记得）书中没有他的别称，但哈迷们送了他一群：拽哥、德殿、秃头（作者正在无语……），铂金少爷……【此处省略N个】他的魔杖是山楂木，内含龙的心脏神经，10英寸。他的守护神【据说！只是据说！】是一只白鼬[笑哭]。生于1980年6月5日，双子座。金色头发，灰蓝色眼睛。斯莱特林学院。德拉科的身高大约是1.86米。（还是比哈利高，德哈党表示十分舒服[滑稽]）著名事例：6年级在厕所大哭了一场。（啊啊啊！别打我！我……我是德哈的！）【作者正在被德赫、德潘、德亚党群殴】以及在电影《死亡圣器（下）》中给哈利递魔杖（可能某些小伙伴没看到过这个场景，哎，被剪掉了，不然，德哈的人数蹭蹭上涨【喂喂喂！又来！救命啊！】）。他的CP是阿斯托利亚。（德哈、德赫、德潘党：不！要！啊啊啊啊啊！德亚党：嗯~很好~）\n")#;//嘿嘿，没想到吧，我是水印
        #//霍格沃茨工作室版权所有，陈张远致为创始人(授权使用)
        sleep(3)
        system("clear")
    elif a=="Hermione"or a=="Hermione Granger"or a=="赫敏"or a=="赫敏格兰杰"or a=="赫敏·格兰杰"or a=="Granger"or a=="赫敏格兰杰":
        print("┌──────────┐" )#<< endl;
        print("│----------│" )#<< endl;
        print("│上载许可证│  无病毒及广告" )#<< endl;
        print("│----------│" )#<< endl;#我是水印李承骏＆缪子航
        print("└──────────┘" )#<< endl;
        print("由[霍格沃茨工作室]出品的{破特瞭望站}（《哈利·波特》百科），专注制作关于《哈利·波特》的内容" )#<< endl;
        b("赫敏·格兰杰，英文Hermione Granger，别称“无法容忍的万事通”。她生于1979年9月19日，处女座。褐色头发，棕色眼睛。格兰芬多学院。死于……目前作者未知。著名事例：用蛇怪的毒牙刺坏赫奇帕奇的金杯（伏地魔的魂器之一）。她霍格沃茨大战后回到了学校上完7年级。（哈利和罗恩没有）她的配偶是罗纳德（昵称罗恩）·韦斯莱。（德赫、哈赫、哈罗、罗帕、罗拉党：别啊啊啊啊啊！罗赫党：GOOD）\n")#;//水印再次出现
        sleep(3)
        system("clear")
    elif a=="小天狼星"or a=="Sirius"or a=="小天狼星布莱克"or a=="Sirius Black"or a=="小天狼星·布莱克"or a=="sirius"or a=="sirius black"or a=="小天"or a=="狼殿":
        print("┌──────────┐" )#<< endl;
        print("│----------│" )#<< endl;
        print("│上载许可证│  无病毒及广告" )#<< endl;
        print("│----------│" )#<< endl;
        print("└──────────┘" )#<< endl;
        print("由[霍格沃茨工作室]出品的{破特瞭望站}（《哈利·波特》百科），专注制作关于《哈利·波特》的内容" )#<< endl
        b("小天狼星·布莱克，英文Sirius Black。名字取自天狼座（sirius）。别称大脚板，伤风。哈迷赠送昵称：小天、狗爹、狼殿。格兰芬多学院，打破了布莱克家族几百年来都进斯莱特林的惯例。黑色头发，黑色眼睛。小天狼星的魔杖……罗琳貌似没有给出答案。小天狼星的守护神……应该是只狗吧（猜测）。生于1953年11月3日，天蝎座；死于1996年6月21日（日期是作者自己推测的，罗琳没有给出具体日期），享年60岁。著名事例：16岁逃离了格里莫广场；在阿兹卡班蹲了12年。（额，各位狼殿的粉丝们sorry，但是作者是在想不出了[泪奔]，但是，我实在想不出来啊啊啊啊啊）和罗纳德（昵称罗恩）·韦斯莱和唐克斯绝对有血缘关系。（详见《凤凰社》）小天狼星还是一个未注册的阿尼马格斯，阿尼马格斯形态是一只狗。由于蹲阿兹卡班，错过了最佳的组cp时间。但是，这一点也不妨碍哈迷们给他们最爱的狼殿组cp。犬狼，犬鹿，犬狼鹿齐上阵。据作者所知，某个公众号里居然有一篇犬斯的同人……（小天狼星和斯内普，什么鬼……）")
        sleep(3)
        system("clear")
    elif a=="斯内普"or a=="Snape"or a=="西弗勒斯斯内普"or a=="西弗勒斯"or a=="Severus"or a=="Severus Snape"or a=="severus"or a=="snape"or a=="severus snape"or a=="西弗勒斯斯内普"or a=="西弗勒斯·斯内普"or a=="混血王子"or a=="老蝙蝠"or a=="the Half-Blood Prince"or a=="鼻涕精":
        print("┌──────────┐" )#<< endl;
        print("│----------│" )#<< endl;
        print("│上载许可证│  无病毒及广告" )#<< endl;
        print("│----------│" )#<< endl;#我是水印李承骏＆缪子航
        print("└──────────┘" )#<< endl;
        print("由[霍格沃茨工作室]出品的{破特瞭望站}（《哈利·波特》百科），专注制作关于《哈利·波特》的内容" )#<< endl
        b("西弗勒斯·斯内普，英文Severus Snape，名字取自拉丁文，拉丁文意思为“严厉的”，说明了斯内普的毒蛇……毒舌性质。外号：西弗，混血王子，鼻涕精，油腻腻的老蝙蝠，双面间谍，邪恶的食死徒，伏地魔邪恶的仆人……世界上最勇敢的人。他听到了所有的外号……除了最后一个[泪奔]。（对不起作者已泪奔，需要10秒钟去洗把脸）\n");
    #//陈张远致牌水印
        b("哈迷们也称他斯教。斯莱特林学院。教授的魔杖是桦木，十三英寸，杖芯极有可能是凤凰羽毛。教授，试想一下，如果你的魔杖和“杀妻”仇人劳德（←伏地魔）、最痛恨的那个破特小子是三胞胎杖芯……【滑稽护体】他的守护神是牝鹿，和莉莉·波特的一样。（作者：忍住！忍住！再去洗把脸就要超长了！）斯内普的生于1959年1月9日，摩羯座；死于1998年5月2日，享年39岁。哎，英年早逝。（呜哇哇哇哇哇哇哇）著名事例：① 在决斗俱乐部把洛哈特打得那叫个落花流水（很好地证明了洛哈特这个草包）； ② 被纳吉尼给X死（为了保护作者以及广大读者幼小的心灵，自动屏蔽这个过于血腥的词。）斯内普教授由于各种原因没有配偶，但这不能停止广大哈迷给他们的斯教组CP的脚步。斯莉（作者站），斯哈，斯赫（斯内普×赫敏），还有……斯伏？[问号脸]\n")
        sleep(3)
        system("clear")
    elif a=="伏地魔"or a=="Voldemort"or a=="Lord Voldemort"or a=="劳德"or a=="汤姆里德尔"or a=="汤姆马沃罗里德尔"or a=="Tom Riddle"or a=="Tom Mavolo Riddle"or a=="汤姆·马沃罗·里德尔"or a=="汤姆·里德尔"or a=="the Heir of Slytherin"or a=="斯莱特林的继承人"or a=="My Lord"or a=="没鼻子的秃头"or a=="神秘人"or a=="You-Know-Who"or a=="那个连名字都不能提的人"or a=="黑魔王":
        print("┌──────────┐" )#<< endl;
        print("│----------│" )#<< endl;
        print("│上载许可证│  无病毒及广告" )#<< endl;
        print("│----------│" )#<< endl;
        print("└──────────┘" )#<< endl;
        print("由[霍格沃茨工作室]出品的{破特瞭望站}（《哈利·波特》百科），专注制作关于《哈利·波特》的内容" )#<< endl
        b("汤姆·马沃罗·里德尔，英文Tom Mavolo Riddle，自取艺名（滑稽）伏地魔，英文Lord Voldemort。TOM MAVOLO RIDDLE的字母顺序改动一下就成了I AM LORD VOLDEMORT。Voldemort的含义是飞离死亡。在法语中，Vol的意思是“飞翔”，de的意思是“的”，mort的意思是“死亡”，组合起来，可以理解为“飞离死亡”，证明了伏地魔的永生观。魔法界都不敢直接叫伏地魔，就诞生了：神秘人（You-Know-Who）;那个连名字都不能提的人（He-Who-Must-Not-Be-Named），以及弗农姨夫口中的“伏——什么东西”（Lord Voldy Thing）。食死徒也不敢直接叫，都叫黑魔王（the Dark Lord）或麦劳德（My Lord）（音译）【滑稽护体】。哈迷们送了伏地魔一堆他一点也不想要的外号：1.老伏（这个还好）；2.没鼻子的秃头（简称英版光头强）；3.小伏（与第一个呼应）；4.伏伏（作者专属）......emm...来看几个比较好的：1.V殿；2.伏殿……还有一堆一堆。{突然发现伏地魔的名字部分占的篇幅好长诶}伏地魔生于\n")
        sleep(3)
        system("clear")
    elif a == "月高工作室":
        print("搜索：月高工作室")#<< endl;
        print("┌────────────┐" )#<< endl;
        print("│------------│" )#<< endl;#我是水印李承骏＆缪子航
        print("│工作室许可证│" )#<< endl;
        print("│------------│" )#<< endl;
        print("└────────────┘" )#<< endl;
        b("月高工作室于2019年11月23日由创始人潘夕习成立，目前具有代表作《跳舞的线》。")
        sleep(3)
        system("clear")
    elif a == "oppo" or a == "OPPO" or a == "Oppo":
        print("搜索：OPPO" )
        print("┌──────────┐")#<< endl;
        print("│----------│")#<< endl;
        print("│   OPPO   │        开启探索和引领至美科技之旅")# << endl;
        print("│----------│")#<< endl;
        print("└──────────┘")#<< endl;
        b("OPPO于2008年推出第一款“笑脸手机”，由此开启探索和引领至美科技之旅。今天，OPPO凭借以Find和R系列手机为核心的智能终端产品，以及OPPO+等互联网服务，让全球消费者尽享至美科技。") 
        sleep(3)
        system("clear")
    elif a == "安卓" or a == "Android" or a == "android" or a == "anzhuo":
        print("搜索：安卓")# << endl;
        print("┌──────────┐" )#<< endl;
        print("│----------│" )#<< endl;
        print("│   安卓   │         自由及开放源代码的操作系统" )#<< endl;
        print("│----------│")# << endl;
        print("└──────────┘" )#<< endl;#我是水印李承骏＆缪子航
        PEN("安卓是一种基于Linux内核（不包含GNU组件）的自由及开放源代码的操作系统。主要使用于移动设备，如智能手机和平板电脑，由美国Google公司和开放手机联盟领导及开发。Android操作系统最初由Andy Rubin开发，主要支持手机。")
        sleep(3);
        system("clear")
    elif a == "致所有人":
        b("我不知道是谁引起的这个抄袭之风，连有些工作室都开始抄袭了，希望大家多多举报那些抄袭的作品，抄袭出来的毕竟不是自己的，自己做出来的作品会让你感到有所成就，而其他抄袭的作品会找到所有人的唾弃，希望那些抄袭的人不要再继续抄下去了，抄袭有意思吗》？我想有些不要脸的人应该会说“有”，因为他们就知道抄！啊哈哈，抄袭只会害了自己，不会害了其他人，只会害了抄袭的自己呀！哎，还请抄袭的人不要再这样下去了！@闪翼抄袭室，请你们不要再抄袭了！请马上撤回抄袭作品！谢谢配合！")
        sleep(3)
        system("clear")
    elif a == "星光工作室" or a == "星光":
        print("搜索：星光工作室")#<< endl;
        print("┌────────────┐" )#<< endl;
        print("│------------│" )#<< endl;
        print("│工作室许可证│" )#<< endl;
        print("│------------│" )#<< endl;
        print("└────────────┘" )#<< endl;
        b("关于 Star light （S.L.）星光工作室2020年2月28日以学而思编程为启动平台创立，主要建立教学部、科技研发部，以作品优秀著称,欢迎大家加入。优秀的作品全学而思公认最不水的工作室，作品涉及爬虫、pygame、tkinter和python终端输出。不断创新创新永远是我们的口号，探索探索再探索，学习学习再学习！技术党拥有涉及许多方面的技术人才，打造良好的学习环境。Idea创意使我们不甘平庸，创意使我们继续向前！")
        sleep(3)
        system("clear")
    elif a == "v设置" or a == "V设置":
        system("clear")#我是水印李承骏＆缪子航
        print("设置⚙")#< endl;
        print("1、清理缓存以及数据" )#<< endl;
        print("2、---" )#<< endl;
        print("3、返回" )#<< endl;
        print("")# << endl;
        at = input("请输入数字：")
        if at == "1":
            sleep(1);
            xg("清理中...")
            print("清理缓存及数据（成功）！")
            sleep(1.5)
            system("clear")
        if at == "2":
            b("没看见没写字吗？")
            system("clear")
        if at == "3":
            print("好的，返回【主页】")
            sleep(2)
            system("clear")#我是水印李承骏＆缪子航
    elif a == "人类" or a == "renlei":
        print("搜索：人类" )#<< endl;
        print("┌──────────┐" )#<< endl;
        print("│----------│" )#<< endl;
        print("│   人类   │   高智商生物" )#<< endl;
        print("│----------│" )#<< endl;
        print("└──────────┘" )#<< endl;  
        PEN("智人（学名：Homo sapiens），是人属下的唯一现存物种。形态特征比直立人更为进步。分为早期智人和晚期智人。早期智人过去曾叫古人，生活在距今25万～4万年前，主要特征是脑容量大，在1300毫升以上；眉嵴发达，前额较倾斜，枕部突出，鼻部宽扁，颌部前突。一般认为是由直立人进化来的，但有争议 [1]  认为直立人在后来崛起的智人（现代人）走出非洲后灭绝或在此之前就灭绝了。晚期智人（新人）是解剖结构上的现代人。大约从距今四五万年前开始出现。两者形态上的主要差别在于前部牙齿和面部减小，眉嵴减弱，颅高增大，到现代人则更加明显。晚期智人臂不过膝，体毛退化，有语言和劳动，有社会性和阶级性。有三种类型的材料来研究人从哪里来这个问题：基因、化石、语言文化。其中语言文化一般不能超过新石器时代。很多形态特征并不与种系差异相关。")
        sleep(3)
        system("clear")  
    elif a == "霍格沃兹工作室":
        print("搜索：霍格沃兹工作室")# << endl;
        print("┌────────────┐" )#<< endl;
        print("│------------│" )#<< endl;
        print("│工作室许可证│" )#<< endl;
        print("│------------│" )#<< endl;
        print("└────────────┘" )#<< endl;
        b("霍格沃茨工作室在2020年3月9日成立，室长是陈张远致，随后，大批优秀成员进入。我们的精选作品：分院仪式，作者方政：https://code.xueersi.com/home/project/detail?lang=code&pid=4761562&version=python&form=python&langType=python密室大逃脱，作者茜烨：https://code.xueersi.com/home/project/detail?lang=code&pid=4887936&version=cpp&form=cpp&langType=cpp最强大脑特约版，作者李承骏、方政&金恺文（荐）：https://code.xueersi.com/home/project/detail?lang=code&pid=4982950&version=python&form=python&langType=python想要霍格沃茨四大学院的标志吗，作者陈张远致：https://code.xueersi.com/home/project/detail?lang=scratch&pid=5204731&version=3.0&langType=scratch更多优秀作品在我们的优秀作品大全！！（走过路过不要错过）里面")
        sleep(3)
        system("clear")
    elif a == "赵瑞阳" or a == "柳浪莺啼":
        b("提供卖代码服务！（我只帮他打一次广告）")
        sleep(3)#我是水印李承骏＆缪子航
        system("clear")
    elif a == "浏览器" or a == "liulanqi":
        print("搜索：浏览器" )#<< endl;
        print("┌──────────┐" )#<< endl;
        print("│----------│" )#<< endl;
        print("│  浏览器  │" )#<< endl;
        print("│----------│" )#<< endl;
        print("└──────────┘" )#<< endl;  
        b("浏览器是用来显示在万维网或局域网等内的文字、图像及其他信息的软件，它还可以让用户与这些文件进行交互操作。浏览器是电脑上网时经常使用到的应用软件，浏览器正是Internet时代的产物，随着电脑操作系统的普及、Internet的全球连接及人们对信息需求的爆炸式增长，为浏览器的诞生和兴起提供了强大的动力，同时它也标志着互联网时代的来临 [1]  ")#;//水印PEN果
        sleep(3)
        system("clear")
    elif a == "诺耀工作室":
        print("搜索：诺耀工作室")# << endl;
        print("┌────────────┐" )#<< endl;
        print("│------------│" )#<< endl;
        print("│工作室许可证│" )#<< endl;
        print("│------------│" )#<< endl;
        print("└────────────┘" )#<< endl;
        b("诺耀工作室创建于2020年3月13日，由创始人李佳诺所建。2020年3月17日开始有了自己的官网：http://nuoyaogzsguanfang.cn，在短期内有了许多的成就。也在2020年4月16日创建了“诺耀工作室”的微信公众号。目前在学而思，网易卡塔，小码王等社区内总共作品超过60个！！！")
        sleep(3)#我是水印李承骏＆缪子航
        system("clear")
    elif a == "梦想之星工作室":
        print("搜索：梦想之星工作室")# << endl;
        print("┌────────────┐" )#<< endl;
        print("│------------│" )#<< endl;
        print("│工作室许可证│" )#<< endl;
        print("│------------│" )#<< endl;
        print("└────────────┘" )#<< endl;
        b("相当于半个漫威，因为漫威的三大副室长全在这里，这里的人都是大佬，技术很NB")
        sleep(3)
        system("clear")
    elif a == "星斩工作室":
        print("搜索：星斩工作室")# << endl;
        print("┌────────────┐" )#<< endl;
        print("│------------│" )#<< endl;
        print("│工作室许可证│" )#<< endl;
        print("│------------│" )#<< endl;
        print("└────────────┘" )#<< endl;
        b("星斩工作室成立于2020.1.30。拥有成员20+，许多语言的程序员。官方网站：www.starcutc.com。官方邮箱：starcutcn@163.com、starcut@starcutc.com。在学而思、编程猫、卡搭社区都有人员。")
        sleep(3)
        system("clear")
    elif a == "凉音工作室":
        print("搜索：凉音工作室")# << endl;
        print("┌────────────┐" )#<< endl;#我是水印李承骏＆缪子航
        print("│------------│" )#<< endl;
        print("│工作室许可证│" )#<< endl;
        print("│------------│" )#<< endl;
        print("└────────────┘" )#<< endl;
        b("凉音工作室的人称得上是大佬了，今已重组，之前险些解散，尽管10几个成员，但实力很NB，个个都能算得上是大佬。")
        sleep(3)
        system("clear")
    elif a == "新型冠状病毒"or a == "新冠肺炎"or a == "新冠":
        b("2019新型冠状病毒，2020年1月12日被世界卫生组织命名为2019-nCoV [1]  ，2020年2月11日被国际病毒分类委员会命名为SARS-CoV-2 [2]  。冠状病毒是一个大型病毒家族，已知可引起感冒以及中东呼吸综合征（MERS）和严重急性呼吸综合征（SARS）等较严重疾病。新型冠状病毒是以前从未在人体中发现的冠状病毒新毒株。")
        sleep(3);
        system("clear")
    elif a == "更新申明" or a == "更新" or a == "gengxinshenming" or a == "gengxin" or a == "gengxinshengming":
        b("观看此作品的注意一下，我会一直更新这个程序（免费更新一年），更多特权服务，可以添加客服联系方式！")
        b("更新时间或许很慢，但是一定每次更新都不会报错或者出现bug的！")
        b("注：如果你想获得更多点赞特权，可以联系客服（前提是点几个赞）")
        b("再见！")
        sleep(3);
        system("clear")
    elif a == "scratch" or a == "Scratch" :
        b("Scratch是一款由麻省理工学院(MIT) 设计开发的少儿编程工具。其特点是:使用者可以不认识英文单词，也可以不会使用键盘。构成程序的命令和参数通过积木形状的模块来实现。用鼠标拖动模块到程序编辑栏就可以了。右边的部分是编辑好的程序代码，中间是可以用来选择的功能模块，左边上部是程序预览和运行窗口，左边下部是角色窗口。")
        sleep(3)#我是水印李承骏＆缪子航
        system("clear")
    elif a == "五一活动" or a == "五一活动专栏" or a == "五一":
    #帮忙点个赞吧！谢谢了！
        b("大家注意了！")
        sleep(1)
        b("五一假期到了！我发le一个特别专栏哦！\n网址在这：https://code.xueersi.com/home/project/detail?lang=code&pid=5450645&version=cpp&form=cpp&langType=cpp\n注意：这个不是广告，很纯净，没有网页勒索病毒！")
        sleep(1)
        b("祝大家节日快乐哦！")
        print("按任意键继续.")
        input("")
        system("clear")
    elif a == "thinkpad" or a == "Thinkpad" or a == "思考本":
        b("ThinkPad（思考本）是IBM PC事业部旗下创立的便携式计算机品牌，凭借坚固和可靠的特性在业界享有很高声誉。2005年被联想（Lenovo）收购，ThinkPad商标为联想所有。ThinkPad自问世以来一直保持着黑色的经典外观并对技术有着自己独到的见解，如：TrackPoint（指点杆，俗称小红帽）、ThinkLight键盘灯、全尺寸键盘和APS（Active Protection System，主动保护系统）。")
        sleep(3)
        system("clear")
    elif a == "Python" or a == "python":
        b("Python是一种计算机程序设计语言。是一种面向对象的动态类型语言，最初被设计用于编写自动化脚本(shell)，随着版本的不断更新和语言新功能的添加，越来越多被用于独立的、大型项目的开发。")
        sleep(3)
        system("clear")
    elif a == "css" or a == "CSS":
        b("层叠样式表(英文全称：Cascading Style Sheets)是一种用来表现HTML（标准通用标记语言的一个应用）或XML（标准通用标记语言的一个子集）等文件样式的计算机语言。CSS不仅可以静态地修饰网页，还可以配合各种脚本语言动态地对网页各元素进行格式化。 CSS 能够对网页中元素位置的排版进行像素级精确控制，支持几乎所有的字体字号样式，拥有对网页对象和模型样式编辑的能力。")
        sleep(3)
        system("clear")
    elif a == "赵瑞阳" or a == "瑞阳":
        b("暂无介绍")#我是水印李承骏＆缪子航
        sleep(3)
        system("clear")
    elif a == "HTML" or a == "html"or a == "Html":
        b("HTML（超文本标记语言）是用于在Internet上显示Web页面的主要标记语言。网页由HTML组成，用于通过Web浏览器显示文本，图像或其他资源。HTML文件的文件扩展名为.htm或.html。")
        sleep(3)
        system("cealr")
    elif a == "PHP" or a == "Php" or a == "php":
        b("PHP是PHP的递归首字母缩写：Hypertext Preprocessor，一种用于创建动态和交互式HTML网页的脚本语言。当网站访问者打开页面时，服务器处理PHP命令，然后将结果发送到访问者的浏览器。")
        sleep(3)
        system("clear")
    elif a == "RCD" or a == "rcd":
        b("RCD（room temperature catalytic decomposition，室温催化分解），在室温条件下利用空气中的热量长期稳定的将空气中甲醛污染物催化氧化成水和二氧化碳。") 
        sleep(3)
        system("clear")
    elif a == "JavaScript" or a == "js" or a=="javascript" or a=="JS" or a=="Script" or a=="script":
        b("JavaScript（简称“JS”） 是一种具有函数优先的轻量级，解释型或即时编译型的编程语言。虽然它是作为开发Web页面的脚本语言而出名的，但是它也被用到了很多非浏览器环境中，JavaScript 基于原型编程、多范式的动态脚本语言，并且支持面向对象、命令式和声明式（如函数式编程）风格。 [1] JavaScript在1995年由Netscape公司的Brendan Eich，在网景导航者浏览器上首次设计实现而成。因为Netscape与Sun合作，Netscape管理层希望它外观看起来像Java，因此取名为JavaScript。但实际上它的语法风格与Self及Scheme较为接近。 [2] JavaScript的标准是ECMAScript 。截至 2012 年，所有浏览器都完整的支持ECMAScript 5.1，旧版本的浏览器至少支持ECMAScript 3 标准。2015年6月17日，ECMA国际组织发布了ECMAScript 的第六版，该版本正式名称为 ECMAScript 2015，但通常被称为ECMAScript 6 或者ES6。")
        sleep(3)#我是水印李承骏＆缪子航
        system("clear")
    elif a == "华为" or a == "HUAWEI" or a == "huawei":
        print("华为技术有限公司" )
        b("华为消费者业务产品全面覆盖手机、移动宽带终端、终端云等，凭借自身的全球化网络优势、全球化运营能力，致力于将最新的科技带给消费者，让世界各地享受到技术进步的喜悦，以行践言，实现梦想。")
        sleep(3)
        system("clear")
    elif a == "apple" or a == "Apple":
        PEN("中文意思：苹果")
        PEN("苹果公司（Apple Inc. ）是美国一家高科技公司。由史蒂夫·乔布斯、斯蒂夫·沃兹尼亚克和罗·韦恩(Ron Wayne)等人于1976年4月1日创立，并命名为美国苹果电脑公司（Apple Computer Inc. ），2007年1月9日更名为苹果公司，总部位于加利福尼亚州的库比蒂诺。苹果公司1980年12月12日公开招股上市，2012年创下6235亿美元的市值记录，截至2014年6月，苹果公司已经连续三年成为全球市值最大公司。苹果公司在2016年世界500强排行榜中排名第9名。   2013年9月30日，在宏盟集团的“全球最佳品牌”报告中，苹果公司超过可口可乐成为世界最有价值品牌。2014年，苹果品牌超越谷歌（Google），成为世界最具价值品牌。2016年9月8日凌晨1点，2016苹果秋季新品发布会在美国旧金山的比尔·格雷厄姆市政礼堂举行 [2]  。10月，苹果成为2016年全球100大最有价值品牌第一名。2017年1月6日早晨8点整，“红色星期五”促销活动在苹果官网正式上线，瞬间大量用户涌入官网进行抢购，仅两分钟所有参与活动的耳机便被抢光；2月，Brand Finance发布2017年度全球500强品牌榜单，苹果排名第二； [3]  6月7日，2017年《财富》美国500强排行榜发布，苹果排名第3位； [4]  7月20日，2017年世界500强排名第9位。  2018年12月18日，世界品牌实验室编制的《2018世界品牌500强》揭晓，苹果排名第3位。 2018年8月2日晚间，苹果盘中市值首次超过1万亿美元，股价刷新历史最高位至203.57美元。   入选2019《财富》世界500强、 2019福布斯全球数字经济100强榜第1位 ")
        sleep(4)
        system("clear")
    elif a == "源代码" or a == "源代码查询":
        print("休想获得源代码！给你们了你们就抄袭！哼~")
        sleep(1)
        system("clear")
    elif a == "@点赞的人" or a == "点赞的人" or a == "dianzanderen":
        b("谢谢你们点赞，还有，如果你想你的名字在里面，可以联系我，帮助你在这个搜索里获得名字！如果你多点了很多赞，可以联系我获得更多特权")
        sleep(3)#我是水印李承骏＆缪子航
        system("clear")
    elif a == "秦浩铭" or a == "漫威室长" or a == "原漫威室长":
        b("漫威原室长，本作品的词库提供方之一，创造了很多奇迹。")
        sleep(3)
        system("clear")
    elif a == "哈哈哈" or a == "哈哈" or a == "哈" or a == "哈哈哈哈" or a == "哈哈哈哈哈":
        b("emmmmmmmmmmmmmmmmmmmmmmmmmmmm你继续笑吧！哈哈哈哈哈哈哈哈哈哈哈")#; //我是水印缪子航
        sleep(1)
        system("clear")
    elif  a == "微软" or a == "微软公司" or a == "Microsoft":
        b("微软  （英文名称：Microsoft；中文名称：微软公司或美国微软公司）始建于1975年，是一家美国跨国科技公司，也是世界PC（Personal Computer，个人计算机）软件开发的先导，由比尔·盖茨与保罗·艾伦创办于1975年，公司总部设立在华盛顿州的雷德蒙德（Redmond，邻近西雅图）。以研发、制造、授权和提供广泛的电脑软件服务业务为主。")
        b("最为著名和畅销的产品为Microsoft Windows操作系统和Microsoft Office系列软件，目前是全球最大的电脑软件提供商。")
        b("2018年4月22日，2017年全球最赚钱企业排行榜第15。   2018年5月29日，《2018年BrandZ全球最具价值品牌100强》第4位。 2018年7月19日，《财富》世界500强排行榜位列71位。   2018年12月18日，《2018世界品牌500强》第4位。")
        b("2019年6月，微软悄然删除其MS Celeb人脸识别数据库，微软称该数据库是全球最大的公开人脸识别数据库。   2019年7月，《财富》世界500强排行榜发布，微软位列60位。 2019福布斯全球数字经济100强榜排名第2位。  2019年10月，Interbrand发布的全球品牌百强排名第四位。  2020年1月22日，名列2020年《财富》全球最受赞赏公司榜单第3位。")
        sleep(3);
        system("clear")
    elif a == "迷你世界" or a == "迷你"  or a == "mini":#我是水印李承骏＆缪子航
        b("""高度自由休闲沙盒游戏
        迷你世界是一款高度自由的休闲类3D沙盒游戏，由深圳市迷你玩科技有限公司运营。
        游戏有着方便快捷的多人联机模式（电脑版最多40人（0.21或以上），手机版最多6人），只要有网络就能和各个地方的小伙伴们一起玩，没有等级和规则限制，没有规定的玩法，只有随心所欲的破坏和天马行空的创造。""") 
        sleep(3)
        system("clear") 
    elif a == "翻译" or a == "翻译小程序"or a == "翻译机" or a == "翻译程序" :
        print("星光工作室©2020") #
        b("这个是我们利用scratch做的翻译器的网址，希望对你有用。网址：https://code.xueersi.com/home/project/detail?lang=scratch&pid=5546315&version=3.0&langType=scratch单击右键复制。5秒时间，非PEN果官方程序☑PEN果复查，无病毒捆绑推装程序，安全！");
        sleep(5)
        system("clear")
    elif a == "微博" or a == "微型博客" or a == "Wei Bo" or a == "Weibo" or a == "weibo" :
        b("微博（Weibo）是指一种基于用户关系信息分享、传播以及获取的通过关注机制分享简短实时信息的广播式的社交媒体、网络平台，允许用户通过Web、Wap、Mail、App、IM、SMS以及用户可以通过PC、手机等多种移动终端接入，以文字、图片、视频等多媒体形式，实现信息的即时分享、传播互动。2009年8月新浪推出“新浪微博”内测版，成为门户网站中第一家提供微博服务的网站。此外微博还包括腾讯微博，网易微博，搜狐微博等。但如若没有特别说明，微博就是指新浪微博。2014年3月27日晚间，在中国微博领域一枝独秀的新浪微博宣布改名为“微博”，并推出了新的LOGO标识，新浪色彩逐步淡化。2018年8月8日，微博获金运奖年度最佳效果运营奖。")
        sleep(3)
        system("clear")
    elif a == "PEN果" or a == "PEN果公司" or a == "PEN果工作室" or  a== "MOGO" or a == "Mogo" or a == "mogo" or a == "pen果" or a == "Pen果" or a == "PENGUO" or a == "penguo" or a == "Penguo" or a == "PENguo":
        b("PEN果公司，全英文名MOGO，全中文名笔果，旗下有酷喵公司，微软工作室，专攻编程专业，研究技术，成立于2019.6.6。室长【缪子航】")#; //我是水印室长【PEN果】  
        sleep(3)
        system("clear")
    elif a == "苹果":#我是水印李承骏＆缪子航
        b("苹果是蔷薇科苹果亚科苹果属植物，其树为落叶乔木。苹果营养价值很高，富含矿物质和维生素，含钙量丰富，有助于代谢掉体内多余盐分，苹果酸可代谢热量，防止下半身肥胖。苹果是一种低热量的食物，每100克产生大约60千卡左右的热量。苹果中营养成分可溶性大，容易被人体吸收，故有“活水”之称。它有利于溶解硫元素，使皮肤润滑柔嫩。")
        sleep(3)
        system("clear")
    elif a == "星河工作室":
        b("暂无介绍") 
        sleep(3)
        system("clear")
    elif a == "Tank Stars" or  a == "tank stars" or a == "Tank stars" or a == "TANK STARS":
        b("《Tank Stars》 是一款动作射击冒险游戏，在这个游戏中，玩家需要寻找对手，然后进行互相射击。游戏采用2D卡通风格画面呈现，游戏支持多人模式，玩家可以与好友一起挑战高分，也有单机挑战，在排行榜寻找对战好友。") 
        sleep(3)
        system("clear")
    elif a == "呵呵" or a == "呵呵呵" or a == "呵" :
        b("呵呵是一个汉语词汇，一指笑声的拟声词，二指形容说话声音含混不清。在网络中常表示在否定对方的同时表达嘲讽和不屑，而容易让人误解为嘲讽为【呵呵】本意或主意。")        
        sleep(3)
        system("clear")
    elif a == "Mojang" or a == "mojang"  or a == "MOJANG"  or a == "MOJANG AB" or a == "Mojang AB" or a == "MOJANG ab" or a == "mojang ab" or a == "Mojäng Aktiebolag":
        b("Mojang AB（瑞典文：mojäng /mʊˈjɛŋ/）全名Mojäng Aktiebolag（直译为小工具有限公司）是一个位于瑞典的电子游戏开发商，于2009年由马库斯·佩尔松以“Mojang Specifications”之名创立。因开发了沙盒游戏《我的世界》（Minecraft）而成名。此公司已经开发《Scrolls》和《Cobalt》，同时也继续更新《我的世界》。Mojang总部位于瑞典的首都斯德哥尔摩。")
        b("该公司已于2014年9月15日被微软以25亿美元收购。")
        sleep(3)#我是水印李承骏＆缪子航
        system("clear")
    elif a == "酷喵" or a == "酷喵公司" or a == "酷喵工作室" or a == "kumiao":
        b("酷喵公司（kumiao）：PEN果公司旗下工作室，成立于2019.1.1，于2019.6.6加入PEN果公司旗下，室长【缪子航】")   
        sleep(3)
        system("clear")
    elif a == "cpb"or a == "Cpb"or a == "CPB"or a == "CPB防栗局"or a == "cpb防栗局"or a == "Cpb防栗局"or a == "SEVA工作室"or a == "SEVA"or a == "seva"or a == "seva工作室":
        b("原名CPB(防栗局)后改名为SEVA，出过许多出名人物和作品。")
        sleep(3)
        system("clear")
    elif a == "漫威工作室" or a == "manwei" or a == "漫威":
        b("漫威工作室创建于2019年10月23日，室长秦浩铭，最多50人左右。")
        sleep(3)
        system("clear")
    elif a == "内测":
        b("内测版链接：https://code.xueersi.com/home/project/detail?lang=code&pid=5808077&version=python&form=python&langType=python")
        sleep(3)
        system("clear")
    elif a == "qq" or a == "QQ":
        b("QQ是腾讯QQ的简称，是一款基于Internet即时通信（IM）软件。目前QQ已经覆盖Microsoft Windows、macOS、Android、iOS、Windows Phone、Linux等多种主流平台。其标志是一只戴着红色围巾的小企鹅。腾讯QQ支持在线聊天、视频通话、点对点断点续传文件、共享文件、网络硬盘、自定义面板、QQ邮箱等多种功能，并可与多种通讯终端相连。")
        b("2017年1月5日，腾讯QQ和美的集团在深圳正式签署战略合作协议，双方将共同构建基于IP授权与物联云技术的深度合作，实现家电产品的连接、对话和远程控制。双方合作的第一步，是共同推出基于QQfamily IP授权和腾讯物联云技术的多款智能家电产品。")
        b("2018年12月12日，QQ发布公告，称由于业务调整，webQQ即将在2019年1月1日停止服务，并提示用户下载QQ客户端   。2019年3月13日起，QQ号码可注销   。")
        b("2019年03月27日，腾讯QQ宣布推出“鹅的20岁”生日庆典特别栏目，第一期分享了那个企鹅图标的“黑历史”。   2019年4月13日，腾讯QQ正式推送了iOS版的v8.0版本更新，将全新的操作界面带给了正式版用户。 ")
        sleep(3)#我是水印李承骏＆缪子航
        system("clear")
    elif a == "微信" or a == "weixin" or a == "WeChat" or a == "wechat" or a == "Wechat":
        b("微信 （腾讯公司的通讯服务应用程序）"); 
        b("微信（WeChat）  是腾讯公司于2011年1月21日推出的一个为智能终端提供即时通讯服务的免费应用程序   ，由张小龙所带领的腾讯广州研发中心产品团队打造  。微信支持跨通信运营商、跨操作系统平台通过网络快速发送免费（需消耗少量网络流量）语音短信、视频、图片和文字，同时，也可以使用通过共享流媒体内容的资料和基于位置的社交插件“摇一摇”、“漂流瓶”、“朋友圈”、”公众平台“、”语音记事本“等服务插件。")
        b("截止到2016年第二季度，微信已经覆盖中国 94% 以上的智能手机，月活跃用户达到 8.06亿，   用户覆盖 200 多个国家、超过 20 种语言。   此外，各品牌的微信公众账号总数已经超过 800 万个，移动应用对接数量超过 85000 个，广告收入增至36.79亿人民币 [3]  ，微信支付用户则达到了4亿左右。 [4] ")
        b("微信提供公众平台、朋友圈、消息推送等功能，用户可以通过“摇一摇”、“搜索号码”、“附近的人”、扫二维码方式添加好友和关注公众平台，同时微信将内容分享给好友以及将用户看到的精彩内容分享到微信朋友圈。")
        b("2018年4月1日起，微信静态条码支付，每天限额500元。   11月30日起，微信暂时下线漂流瓶服务")
        sleep(4)
        system("clear")
    elif a == "设置" or a == "set up" or a == "Set up": 
        b("设置是一个汉语词汇，读音为shè zhì，动词，指设立，布置；放置；装置。出自于黄溍 《圣寿院记》：“器物之须，设置如式。")
        sleep(3)
        system("clear")
    elif a == "\\命令指示符" or a == "\\命令":
        b("emm")
        sleep(3)
        system("clear")
    elif a == "学而思网校":
        b(" 学而思网校是好未来旗下的中小学在线教育平台，依托学而思强大的教学资源与师资力量，以实现优秀教育资源的共享为己任，建立起的中小学在线教育平台。\n2016年，学而思网校提出“在线学习更有效”的品牌主张，并进行了全面的课程升级，推出“小班直播+个性化辅导”的先进模式。\n学而思网校注册学生人数已超过600万，遍及全国200多个城市。学而思网校以“在线学习更有效”的理念，开创了“直播+辅导”的模式。学而思网校用科技赋能教育，通过人机对话、语音测评等人工智能科技手段，构建更加完善和个性化的教学产品和服务。" )    
        sleep(3)
        system("clear")
    elif a =="mc"or a=="Mc"or a=="MC"or a=="minecraft"or a=="Minecraft"or a=="我的世界"or a=="麦块"or a == "我的":
        b("《Minecraft》（官方中文译名《我的世界》，台湾译为《当个创世神》。华人圈亦有人按照谐音称之麦块等），是一款创造生存类游戏，玩家可以在一个三维世界里用各种方块建造建筑物。最初由瑞典人马库斯·阿列克谢·泊松（Markus 'Notch' Persson，很多Minecraft玩家称之为Notch）单独开发，现已成立Mojang公司来开发此游戏。该游戏基于Java平台，开发灵感来自《矮人要塞》（Dwarf Fortress）、《模拟乐园》（Thrillville）、《地城守护者》（Dungeon Keeper）和《Infiniminer》。;现在Minecraft较为流行的四个版本是JAVA版(PC版)，PC中国版，基岩版（PE版），PE中国版（iOS），中国版手游安卓版。有的用Minecraft衍生出很多动画。")
        sleep (3)#我是水印李承骏＆缪子航
        system("clear")
        b("2014年9月15日，Mojang AB以及Minecraft被微软(Microsoft)以25亿美元的价格收购。2017年3月，中国大陆代理商网易正式确定Minecraft中文名为《我的世界》，《我的世界》中国版于2017年4月10开始小规模技术性删档测试，于2017年7月14日开始限号不删档测试，于2017年8月8日开始不限号测试，中国版手游iOS于2017年9月15日公测，手游安卓于2017年10月12日开玩。2018年7月6日，《我的世界》海洋版本正式上线手游。7月10日推出海洋更新版本。2018年11月，《我的世界》1.14测试版更新（至11月20日）。2019年4月，《我的世界》正式更新1.14版本，此版本更新了一个全新的材质包等等。")  
        sleep (3)
        system("clear")
    elif a == "中国" or a == "中华人民共和国":
        b( "中国，是以华夏文明为源泉、 中华文化为基础，并以汉族为主体民族的多民族国家，通用汉语、汉字，汉族与少数民族被统称为“ 中华民族”，又自称为炎黄子孙、龙的传人。中国是世界四大文明古国之一，有着悠久的历史，距今约5000年前，以中原地区为中心开始出现聚落组织进而形成 国家，后历经多次民族交融和朝代更迭，直至形成多民族国家的 大一统局面。20世纪初辛亥革命后， 君主政体退出历史舞台，共和政体建立。1949年中华人民共和国成立后，在中国大陆建立了人民代表大会制度的政体。中国文化渊远流长，是东亚文化圈的文化宗主国，在世界文化体系内占有重要地位，由于各地的地理位置、自然条件的差异，人文、经济方面也各有特点。传统文化艺术形式有 诗词、戏曲、书法、国画等，而春节、元宵、清明、端午、中秋、重阳等则是中国重要的传统节日。" )    
        sleep(3)
        system("clear")
    elif a == "马子锦"or a == "马秃头" or  a =="马没秃":
        b( "马子锦，星河室长，又称马秃头。于2019年8月28号建立了星河工作室，他改编了slow函数，这个函数的作用是逐字输出。他十分伟大，伟大到什么程度呢？你看的C++里的逐字输出，就是他做的。" )    
        sleep(3)
        system("clear")
    elif a == "缪子航": 
        b("缪子航，PEN果室长，本作品C++版作者。")    
        sleep(3)
        system("clear")
    elif a == "lcj"or a == "李承骏":
        xg("李承骏，星光工作室的优秀员工，干劲十足、创意源源不断，最强大脑是他的成名作，本作品Python版的翻译者。")
        sleep(1)
        system("clear")#我是水印李承骏＆缪子航
    elif a=="三文鱼":
        b("三文鱼（Oncorhynchus），又名大马哈鱼、鲑鱼、撒蒙鱼，属硬骨鱼纲、鲑形目、鲑属，主要分布在大西洋与太平洋、北冰洋交界的水域，属于冷水性的高度洄游鱼类，被国际美食界誉为“冰海之皇”。研究表明，金枪鱼和三文鱼均肉质鲜美，营养丰富，并且富含EPA和DHA等生物活性物质。 三文鱼具有商业价值的品种有30多个，目前最常见的是2种鳟鱼（三文鳟、金鳟）和4种鲑鱼（太平洋鲑、大西洋鲑、北极白点鲑、银鲑）。  ")   
        sleep(3)
        system("clear")
    elif a=="方便面":
        b("方便面，又称快餐面、泡面、杯面、快熟面、速食面、即食面，南方一般称为碗面，香港则称之为公仔面，是一种可在短时间之内用热水泡熟食用的面制食品。广义上是指一种可在短时间之内用热水泡熟食用的面制食品，有相关的菜肴如归泡面、泡面沙拉等；狭义的方便面上通常指由面饼、调料包及油包组成的销售成品，市面上以袋装和杯或碗装居多。安藤百福在1958年发明方便面，随着生活节奏加快及旅行需要，方便面为现代生活不可或缺的简易食品之一。方便面是通过对切丝出来的面条进行蒸煮、油炸，让面条形状固定（一般为方形或圆形），食用前以开水冲泡，溶解调味料，并将面条加热冲泡开，在短时间（一般在3分钟内）内便可食用的即食方便食品。如今市场上各种品牌的方便面充斥着各大商场的货架，从大型零售超市到街头的小门头商铺都能够看到它的身影。")
        sleep(3)
        system("clear")
    elif a=="手机":
        b("手机、全称为移动电话或无线电话，通常称为手机，原本只是一种通讯工具，早期又有大哥大的俗称  ，是可以在较广范围内使用的便携式电话终端，最早是由美国贝尔实验室在1940年制造的战地移动电话机发展而来。1958年，苏联工程师列昂尼德.库普里扬诺维奇发明了ЛК-1型移动电话，1973年，美国摩托罗拉工程师马丁·库帕发明了世界上第一部商业化手机。迄今为止已发展至5G时代了。")
        sleep(1)
        system("clear")
    elif a == "电视剧":
        b("电视剧（ TVplay; teleplay; TV drama; TV serial;）一种专为在电视上播映的演剧形式。它兼容电影、戏剧、 文学、音乐、舞蹈、绘画、造型等现代艺术诸元素，是一种适应电视广播特点、融合舞台和电影艺术的表现方法而形成的现代艺术样式。一般分单本剧和系列剧（电视影集）。电视剧是随着电视广播事业的诞生而发展起来的，在这幕后有一定的推动作用致使一些电视剧网站孕育而生，比较典型的分类电视剧在线观看网站很受大众的喜爱。生活中，电视剧的定义已经狭义化，仅指电视剧集系列，而非其他形式。“电视剧”的概念是中国特有的，在美国称“电视戏剧”，在苏联称“电视故事片”，在日本称“电视小说”。电视剧（又称为剧集、电视戏剧节目、电视戏剧或电视系列剧）是一种适应电视广播特点、融合舞台和电影艺术的表现方法而形成的艺术样式。一般分单元剧和连续剧，利用电视技术制作并通过电视网放映。电视发明后不断普及，最后改变大家对艺术欣赏的方式。电视剧的播放平台一般叫剧场。")
        sleep(3)
        system("clear")
    elif a == "电影":
        b("电影，是由活动照相术和幻灯放映术结合发展起来的一种连续的影像画面，是一门视觉和听觉的现代艺术，也是一门可以容纳戏剧、摄影、绘画、音乐、舞蹈、文字、雕塑、建筑等多种艺术的现代科技与艺术的综合体。但它又具有独自的特征，电影在艺术表现力上不但具有其它各种艺术的特征，又因可以运用蒙太奇（法语：Montage）这种艺术性突跃的电影组接技巧，具有超越其它一切艺术的表现手段，而且影片可以大量复制放映，随着现代社会的发展，电影已深入到人类社会生活的方方面面，是人们日常生活不可或缺的一部分。国务院法制办于2018年2月2日—22日就《电影行政处罚裁量办法（征求意见稿）》向社会公开征求意见。");
        sleep(3);#我是水印李承骏＆缪子航
        system("clear")
    elif a == "巧克力":
        b("巧克力（chocolate也译朱古力），原产中南美洲，其鼻祖是“xocolatl”，意为“苦水”。其主要原料可可豆产于赤道南北纬18度以内的狭长地带。作饮料时，常称为“热巧克力”或可可亚。")
        sleep(3)
        system("clear")
    elif a == "尚书":
        b("《尚书》，最早书名为《书》，约成书于前五世纪，传统《尚书》（又称《今文尚书》）由伏生传下来。传说为上古文化《三坟五典》遗留著作。西汉学者伏生口述的二十八篇《尚书》为今文《尚书》，鲁恭王在拆除孔子故宅一段墙壁时，发现的另一部《尚书》，为古文《尚书》。西晋永嘉年间战乱，今、古文《尚书》全都散失了。东晋初，豫章内史梅赜给朝廷献上了一部《尚书》，包括《今文尚书》33篇，以及伪《古文尚书》25篇 。《尚书》列为重要核心儒家经典之一， “尚”即“上”，《尚书》就是上古的书，它是中国上古历史文献和部分追述古代事迹著作的汇编，是我国最早的一部历史文献汇编。2018年11月，清华大学战国竹简研究成果发布，证实其中古文《尚书》系后人伪作。其「部份篇目」内容的来源可靠性从南宋开始遭受怀疑。清初，这些篇目在主流学术界被定作「伪书」，甚至排除出《尚书》之外。近十多年来，随着出土文献研究的发展，大大拓展了对古代尚书文献的认识。")
        sleep(3)
        system("clear")
    elif a == "十二生肖":
        b("十二生肖，又叫属相，是中国与十二地支相配以人出生年份的十二种动物，包括鼠、牛、虎、兔、龙、蛇、马、羊、猴、鸡、狗、猪。 十二生肖的起源与动物崇拜有关。据湖北云梦睡虎地和甘肃天水放马滩出土的秦简可知，先秦时期即有比较完整的生肖系统存在。最早记载与现代相同的十二生肖的传世文献是东汉王充的《论衡》。 十二生肖是十二地支的形象化代表，即子（鼠）、丑（牛）、寅（虎）、卯（兔）、辰（龙）、巳（蛇）、午（马）、未（羊）、申（猴）、酉（鸡）、戌（狗）、亥（猪），随着历史的发展逐渐融合到相生相克的民间信仰观念，表现在婚姻、人生、年运等，每一种生肖都有丰富的传说，并以此形成一种观念阐释系统，成为民间文化中的形象哲学，如婚配上的属相、庙会祈祷、本命年等。现代，更多人把生肖作为春节的吉祥物，成为娱乐文化活动的象征。生肖作为悠久的民俗文化符号，历代留下了大量描绘生肖形象和象征意义的诗歌、春联、绘画、书画和民间工艺作品。除中国外，世界多国在春节期间发行生肖邮票，以此来表达对中国新年的祝福。 ")
        sleep(3)   
        system("clear")
    elif a == "节日":
        b("节日，是指生活中值得纪念的重要日子。是世界人民为适应生产和生活的需要而共同创造的一种民俗文化，是世界民俗文化的重要组成部分。各民族和地区都有自己的节日。一些节日源于传统习俗，如中国的春节、中秋节、清明节、重阳节等。有的节日源于宗教，比如##教国家的圣诞节。有的节日源于对某人或某件事件的纪念，比如中国的端午节、国庆节、青年节等等。另有国际组织提倡的运动指定的日子，如劳动节、妇女节、母亲节。随着时间推移，节日的内涵和庆祝方式也在发生着变化。而现时节日经常与假日相混淆，事实上大多数节日都没有法定假期，如中国部分传统节日仍没有假期，如重阳节。")
        sleep(3)
        system("clear")
    elif a == "吸烟":#我是水印李承骏＆缪子航
        b("吸烟有危害，不仅仅危害人体健康，还会对社会产生不良的影响。任何有组织生物体只要还有生命迹象就必须要呼吸，呼出体内的二氧化碳，吸入空气中的氧气，进行新陈代谢，以维持正常的生命活动。不吸烟的人，每天都能吸入大量的新鲜空气；而经常吸烟的人，却享受不到大自然的恩惠，吸入的不是新鲜空气，而是被烟雾污染的有毒气体。烟叶里含有毒质烟碱，也叫尼古丁。1克重的烟碱能毒死300只兔或500只老鼠。如果给人注射50毫克烟碱，就会致死。吸烟对呼吸道危害最大，很容易引起喉头炎、气管炎，肺气肿等咳嗽病。吸烟的时候烟从口入，经过喉咙、气管、支气管、进入血液里。吸烟会让男性丢失Y染色体，增加患癌风险。  2017年10月27日，世界卫生组织国际癌症研究机构公布的致癌物清单初步整理参考，吸烟在一类致癌物清单中。 2018年5月1日起，在动车组列车上吸烟的旅客将被纳入“失信人”名单，在180天内限制乘车。")
        sleep(3)
        system("clear")
    elif a == "水":
        b("水，化学式为H₂O，是由氢、氧两种元素组成的无机物，无毒，可饮用。在常温常压下为无色无味的透明液体，被称为人类生命的源泉。水是地球上最常见的物质之一，是包括无机化合、人类在内所有生命生存的重要资源，也是生物体最重要的组成部分。 纯水可以导电，但十分微弱，属于极弱的电解质。日常生活中的水由于溶解了其他电解质而有较多的正负离子，导电性增强。 ")
        sleep(3)
        system("clear")
    elif a == "奥里给" or a == "奥利给" or a == "奥力给":
        b("奥利给出自快手上的主播在直播或者录视频时的说的话术，该词就是我们常说的“给力”的意思，也称给力噢，作为感叹词，可能包含了赞美、加油打气等多种感情色彩。属于网络流行词。")
        sleep(3)
        system("clear")
    elif a == "1":
        b("阿拉伯数字 1")
        sleep(3)
        system("clear")
    elif a == "2":
        b("阿拉伯数字 2")
        sleep(3)
        system("clear")
    elif a == "3":
        b("阿拉伯数字 3")#我是水印李承骏＆缪子航
        sleep(3)
        system("clear")
    elif a == "4":
        b("阿拉伯数字 4")
        sleep(3)
        system("clear")
    elif a == "5":
        b("阿拉伯数字 5")
        sleep(3)
        system("clear")
    elif a == "6":
        b("阿拉伯数字 6")
        sleep(3)
        system("clear")
    elif a == "7":
        b("阿拉伯数字 7")
        sleep(3)
        system("clear")
    elif a == "8":
        b("阿拉伯数字 8")
        sleep(3)
        system("clear")
    elif a == "9":
        b("阿拉伯数字 9")
        sleep(3)#我是水印李承骏＆缪子航
        system("clear")
    elif a == "阿拉伯数字":
        b("阿拉伯数字由0，1，2，3，4，5，6，7，8，9共10个计数符号组成，阿拉伯数字最初由古印度人发明，后由阿拉伯人传向欧洲，之后再经欧洲人将其现代化，人们以为是阿拉伯发明，所以人们称其为“阿拉伯数字”。")
        sleep(3)
        system("clear")
    elif a == "皇帝":
        b("上古三皇五帝，如羲皇伏羲、娲皇女娲、黄帝轩辕、炎帝神农等都不是真正帝王，仅为部落首领或部落联盟首领，其“皇”或“帝”号，为后人所追加。夏朝君主称“后”，商朝君主称“帝”，周天子称“王”。战国诸侯大多僭越称王，尊周天子为“天王”。秦王嬴政统一中国，认为自己“德兼三皇、功盖五帝”，创“皇帝”一词作为华夏最高统治者的正式称号。所以，秦始皇嬴政是中国首位皇帝，自称“始皇帝”。从此“皇帝”取代了“帝”与“王”，成为中国两千年多来封建社会最高统治者的称呼。")
        sleep(3)
        system("clear")
    elif a == "编程社区":
        b("""学而思编程社区、慧编程社区、小码王编程社区、编程猫编程社区、卡塔编程社区、GitHub等一些社区，去浏览器里搜就能搜到""")
        sleep(1)
        system("clear")
    elif a == "《风》":
        b("《风》是唐代诗人李峤创作的一首诗。此诗通过抓住“叶”“花”“浪”“竹”四样自然界物象在风力作用下的易变，间接地表现了“风”之种种形力、魅力与威力：它能使晚秋的树叶脱落，能催开早春二月的鲜花，经过江河时能掀起千尺巨浪，刮进竹林时可把万棵翠竹吹得歪歪斜斜。全诗四句两两成偶，以“三”“二”“千”“万”数字对举排列来表现风的强大，也表达了诗人对大自然的敬畏之情。")
        sleep(3)
        system("clear")
    elif a == "游戏":
        b("游戏是所有哺乳类动物，特别是灵长类动物学习生存的第一步。它是一种基于物质需求满足之上的，在一些特定时间、空间范围内遵循某种特定规则的，追求精神世界需求满足的社会行为方式，但同时这种行为方式也是哺乳类动物或者灵长类动物所需的一种降压减排的方式，不管是在出生幼年期，或者发育期，成熟期都会需要的一种行为方式。 合理适度的游戏允许人类在模拟环境下挑战和克服障碍，可以帮助人类开发智力、锻炼思维和反应能力、训练技能、培养规则意识等，大型网络游戏还可以培养战略战术意识和团队精神。但凡事过犹不及，过度游戏也会对人的身心健康产生危害，沉迷于虚拟世界里，随心所欲的宣泄情感，因此长期沉迷网络游戏的孩子会对周围的人和事冷漠麻木，有的还会荒废学业，甚至发生犯罪现象，给正常生长带来各种各样的危害。2018年6月18日，世界卫生组织发布新版《国际疾病分类》，“游戏障碍”，被列为疾病。但是游戏障碍与人们口中说的游戏成瘾是两个不同的概念，容易混淆。 游戏有智力游戏和活动###之分，又翻译为Play、Pastime、Playgame、Sport、Spore、Squail、Games、Hopscotch、Jeu、Toy。现在的游戏多指各种平台上的电子游戏。")
        sleep(3)#我是水印李承骏＆缪子航
        system("clear")
    elif a == "大脑":
        b("大脑为神经系统最高级部分，由左、右两个大脑半球组成，两半球间有横行的神经纤维相联系。每个半球包括：大脑皮层（大脑皮质）：是表面的一层灰质（神经细胞的细胞体集中部分）。人的大脑表面有很多往下凹的沟（裂），沟（裂）之间有隆起的回，因而大大增加了大脑皮层的面积。人的大脑皮层最为发达，是思维的器官，主导机体内一切活动过程，并调节机体与周围环境的平衡，所以大脑皮层是高级神经活动的物质基础。")
        sleep(3)
        system("clear")
    elif a == "表情":
        b("表情是一个汉语词语，拼音是biǎo qíng，意思是表达感情、情意。表现在面部或姿态上的思想感情。现代年轻人聊天多用图片类表情来代替语言进行交流，并衍生出海峡两岸表情大战等年轻文化交流事件。表情是情绪的主观体验的外部表现模式。人的表情主要有三种方式：面部表情、语言声调表情和身体姿态表情")
        sleep(3);
        system("clear")
    elif a == "666":
        b("666是一个网络用语，用来形容某人或某物很厉害很牛、令人折服（大多是指游戏玩的好）。而在西方，666指魔鬼，撒旦和灵魂，是不吉利的象征。随着时代的发展，各类游戏的节奏也越来越快，666这样的语言用的越来越多。在江苏破获的网络涉毒案中，犯罪嫌疑人用666暗指吸毒，意思是让你溜。当人们表现出超常的能力时也会用来感叹。");
        sleep(3)
        system("clear")
    elif a == "555定时器":
        b("55定时器是一种集成电路芯片，常被用于定时器、脉冲产生器和振荡电路。555可被作为电路中的延时器件、触发器或起振元件。555定时器于1971年由西格尼蒂克公司推出，由于其易用性、低廉的价格和良好的可靠性，直至今日仍被广泛应用于电子电路的设计中。许多厂家都生产555芯片，包括采用双极型晶体管的传统型号和采用CMOS设计的版本。555被认为是当前年产量最高的芯片之一，仅2003年，就有约10亿枚的产量。")
        sleep(3)
        system("clear")
    elif a == "哥斯拉":#我是水印李承骏＆缪子航
        b("《哥斯拉》（Godzilla）是一部由传奇影业与华纳兄弟影业公司合拍，英国导演加里斯·爱德华斯执导的美国科幻怪兽电影，是“哥斯拉系列”的重启、美国拍摄的第二部有关“哥斯拉”的影片，上一部同名影片于1998年上映。该片由亚伦·泰勒-约翰逊、渡边谦、伊丽莎白·奥尔森、朱丽叶·比诺什、莎莉·霍金斯、大卫·斯特雷泽恩、布莱恩·科兰斯顿等主演。该片重塑日本哥斯拉“可怕的自然之力”形象，于2014年5月16日")
        sleep(3)
        system("clear")
    elif a == "哪吒":
        b("哪吒（ nézhā），中国古代神话传说人物，道教##神。   哪吒信仰兴盛于道教与民间信仰；在道教的头衔为中坛元帅、通天太师、威灵显赫大将军、三坛海会大神等；尊称太子爷、三太子、善胜童子。 主要记载源于元代宗教神话典籍《三教搜神大全》，活跃于明代神魔系列小说名著《西游记》、《南游记》、《封神演义》等多部古典文学作品。 托塔李天王家的三太子，最早传说来自古波斯和古印度教的神话，随着本土化的传教，唐末起就从古盛传至今，由佛教##军神“那咤”演变而成 [6]  ，记载已在东晋有之，主要定型于闹海传说与屠龙之说的内容，以及降魔伏妖再成仙成圣等古籍文献，出生奇异，一身神器，能变化三头六臂又或三头八臂，百邪不侵专克摄魂夺魄的莲花化身。在中国各地成为世代传奇且家喻户晓的著名艺术形象；后期影响民间奉祀为保护神，并渐被道教所吸纳，将其遵崇供为中央祭坛的大罗天神，地位高贵鼎盛；神仙谱中被归类为“忠武战神”之位，属于武神一系。在民俗被尊为护世护民的“五营神将”之首；乃统领天兵天将的元帅之神，又称“太子元帅”，还被敬作“天帅领袖”和“火轮天王”，常以娃娃或者少年儿童的模样登场，终成神话史上独特无双、神通广大的天庭童神。在儒释道三体合流相融的文化传承中，得享华人的普遍崇拜与信仰。更因为其鲜明精彩的古老形象与经典传说故事名气响亮，从而吸引现代众多动漫和影视剧都将哪吒设定为主角，加以儿童化的少年英雄方式传扬，深受诸多孩子们的欢迎和喜爱。")
        sleep(3)
        system("clear")
    elif a == "你好":
        b("拼音[nǐ hǎo] 打招呼的敬语，作为一般对话的开场白、常用语。这也是个最基本的中文词语。主要用于打招呼请教别人问题前的时候，或者单纯表示礼貌的时候等。")
        sleep(3)
        system("clear")
    elif a == "KFC"or a =="肯德基":
        b("肯德基（KentuckyFried Chicken，肯塔基州炸鸡，简称KFC），是美国跨国连锁餐厅之一，也是世界第二大速食及最大炸鸡连锁企业，1952年由创始人哈兰·山德士（Colonel Harland Sanders）创建， 主要出售炸鸡、汉堡、薯条、盖饭、蛋挞、汽水等高热量快餐食品。肯德基隶属于百胜中国控股有限公司（简称“百胜中国”） [2]  ， 股票代码为YUMC  ，是Yum！Brands在中国大陆的特许经营商   ，拥有肯德基品牌在中国大陆的独家经营权。 肯德基与百事可乐结成了战略联盟，固定销售百事公司提供的碳酸饮料。2017年6月，《2017年BrandZ最具价值全球品牌100强》公布，肯德基排名第81位。 自2018年2月17日开始，英国的大部分肯德基网点仍然暂停营业。当地900家门店中，截至2月20日，仍有562家处于关闭状态，在2月18日晚歇业的门店数量达到顶峰的646家。 在2018世界品牌500强排行榜中，肯德基排名第129位。")
        sleep(3)
        system("clear")
    elif a == "82年的拉菲":
        b("82年的拉菲，网络流行语，源自影视剧中开拉菲的桥段，由于82年的拉菲酒品质好、价格昂贵，所以“82年的拉菲”是高规格的代名词。常常在网络聊天时作为表情包使用。")
        sleep(3)
        system("clear")#我是水印李承骏＆缪子航
    elif a == "面":
        b("（1）面，读作：miàn。面字从“一 + 自”，从囗（wéi）。“一 + 自”表示“鼻子及其附近”。“囗”指“外围”。“一 + 自”与“囗”联合起来表示“人脸”。本义是人脸。转义是妇人以谷粉擦脸。（2）麺、麪，读作：miàn。形声。从麦，丏或面声。本义：麦子磨的面粉。")
        sleep(3)
        system("clear")
    elif a == "饭":
        b("fàn形声。字从食，从反，反亦声。“反”意为“镜像对称的事物或动作”。“食”与“反”联合起来表示“二人对食”。本义：夫妻对食。TA说")
        sleep(3)
        system("clear")
    elif a == "酒":
        b("酒，中国汉语词汇，音jiu。英文：wine,Alcohol酒的化学成分是乙醇，一般含有微量的杂醇和酯类物质，食用白酒的浓度一般在60度（即60%）以下（少数有60度以上），白酒经分馏提纯至75%以上为医用酒精，提纯到99.5%以上为无水乙醇。酒是以粮食为原料经发酵酿造而成的。据新华社消息，饮酒量不论多少都无益。")
        sleep(3)
        system("clear")
    elif a == "牛肉":
        b("牛肉（拼音：niú ròu），指从牛身上获得的肉，为常见的肉品之一。来源可以是奶牛、公牛、小母牛。牛的肌肉部分可以切成牛排、牛肉块或牛仔骨，也可以与其他的肉混合做成香肠或血肠。其他部位可食用的还有牛尾、牛肝、牛舌、牛百叶、牛胰腺、牛胸腺、牛心、牛脑、牛肾、牛鞭。牛肠也可以吃，不过常用来做香肠衣。牛骨可用做饲料。阉牛和小母牛肉质相似，但阉牛的脂肪更少。年纪大的母牛和公牛肉质粗硬，常用来做牛肉末。肉牛一般需要经过育肥，饲以谷物、膳食纤维、蛋白质、维生素和矿物质。牛肉是世界第三消耗肉品，约占肉制品市场的25%。落后于猪肉（38%）和家禽（30%）。美国、巴西和中国是世界消费牛肉前三的国家。按2009年人年消费来看，阿根廷以64.6千克排名第一，美国为42.1千克，欧洲为11.9千克。最大的牛肉出口国包括印度、巴西、澳大利亚和美国。牛肉制品对于巴拉圭、阿根廷、爱尔兰、墨西哥、新西兰、尼加拉瓜、乌拉圭的经济有重要影响。")
        sleep(3)
        system("clear")
    elif a == "空手道":
        b("空手道是日本传统格斗术结合琉球武术唐手而形成的，起源于日本武道和琉球的唐手。唐手是中国武术传入琉球，结合当地武术琉球手发展而成的，而日本本土人又将九州、本州的摔、投等格斗技与唐手相结合，最终形成空手道。二战之后通过美军宣传而在全世界广泛传播。空手道当中包含踢、打、摔、拿、投、锁、绞、逆技、点穴等多种技术，一些流派中还练习武器术。一九九四年日本广岛第十二届亚运会空手道首次成为正式比赛项目，空手道比赛场地一般为8×8米；至于比赛项目有套路赛（型）和格斗赛（组手）两种，而在组手比赛中一方有效进攻导致对手瞬时丧失战斗能力或重心明显移动为得分标准。")
        sleep(3)
        system("clear")
    elif a == "《刀》":
        b("《刀》是由徐克执导，赵文卓、熊欣欣、桑妮主演的动作片。影片讲述了刀客黎定安尽管失去右手又只有一本残缺的绝世刀谱在身，仍义无反顾地自创独臂刀法决战仇家，为父报仇的故事。该片于1995年12月21日在香港上映。")
        sleep(3)#我是水印李承骏＆缪子航
        system("clear")
    elif a == "细菌":
        b("细菌（学名：Bacteria）是指生物的主要类群之一，属于细菌域。也是所有生物中数量最多的一类，据估计，其总数约有5×10^30个。细菌的形状相当多样，主要有球状、杆状，以及螺旋状。细菌也对人类活动有很大的影响。一方面，细菌是许多疾病的病原体，包括肺结核、淋病、炭疽病、梅毒、鼠疫、砂眼等疾病都是由细菌所引发。然而，人类也时常利用细菌，例如乳酪及酸奶和酒酿的制作、部分抗生素的制造、废水的处理等，都与细菌有关。在生物科技领域中，细菌也有着广泛的运用。")
        sleep(3)
        system("clear")
    elif a == "自然"or a == "大自然":
        b("自然，哲学名词，广义而言指的即是自然界，规模，   大至宇宙，小至基本粒子， 包括物理学宇宙、物质世界及物质宇宙。亦指道家术语。   东汉至六朝的佛教深受道教自然影响。至南北朝时期左右本土化佛教逐渐完成，由佛教所挑起的关于自然、因缘的争论。《楞严经》：“非因缘生，非自然性”，《道德真经广圣义》：“以无为体，以无为用，自然为体，因缘为用。此皆无也。” 与道家/教重视自然原则不同， 早期佛教认为世界万法都是因缘而成，均无其独立自性，因而是不真实的。这种通过分析主义的思维途径来论证事物虚幻不实的作法为其后大乘佛教所继承。大乘佛教进一步提出缘起论以对世界做性空的价值判断。这种通过层层分析达至的空相对中国传统重视阴阳和合的思想传统， 实在缺乏强制性。道理很简单， 因为中国人根本就不认为阴阳和合的事物不真实， 反而认为事物只有通过阴阳和合才能达至更高的善与美。这应当与中国古代重视综合性、 整体性思维方式密切相关。跟刘宋高僧慧琳一样在 《白黑论》 中对佛教的缘起性空理论予以驳斥：今析毫空树， 无伤垂荫之茂;离材虚空， 不损轮奂之美。明无常增其渴荫之情， 陈苦伪笃其竞辰之虑。 (《宋书》 卷九七 《天竺迦毗黎传》 )贝锦以繁采发挥， 和羹以盐梅致旨， 齐侯追爽鸠之乐， 燕王无延年之术。恐和合之辨， 危脆之教， 正足恋其嗜欲之私， 无以倾其爱竞之惑也。 (《宋书》 卷九七 《天竺迦毗黎传》 )这显然是用中土的和合论来对抗佛教的缘起论。")
        sleep(3)
        system("clear")
    elif a == "起床":
        b("起床，本意离床下地、起身，喻指病愈。语出《儒林外史》第四八回：“饿到六天上，不能起牀（床）。”")
        sleep(3)
        system("clear")
    elif a == "起床战争":
        b("起床战争是《Minecraft》服务器中流行的PVP游戏，目的是搭方块到各种岛屿收集各种资源，保护自家的床并且挖掉其他队的床并杀死所有敌人来赢得游戏胜利。起床战争内容主题为‘床’（有些服务器是蛋糕），即重生点。玩家至少需要1人。一般的起床战争玩家分为4队或8队，每队4～16人。")
        sleep(3)
        system("clear")
    elif a == "PVP":
        b("Present value of product）： 即产品的现期价值，它是指经过一些时间变化后，所生产出来的产品在现在时间比以前时间所体现出来的价值。")
        sleep(3)#我是水印李承骏＆缪子航
        system("clear")
    elif a == "小欢喜":
        b("《小欢喜》是由汪俊执导，黄磊、海清、陶虹、王砚辉、咏梅领衔主演，周奇、李庚希、郭子凡、刘家祎主演，沙溢、任重特别出演的都市情感剧  。该剧改编自鲁引弓的同名小说   ，以方圆、童文洁夫妇的视角，讲述了方家、季家、乔家等几个高三考生家庭在高三这一年的故事  。该剧于2019年7月31日在东方卫视、浙江卫视首播，并在爱奇艺、腾讯视频同步播出")
        sleep(3)
        system("clear")
    elif a == "标准":
        b("标准是规范性文件之一。其定义是为了在一定的范围内获得最佳秩序，经协商一致制定并由公认机构批准，共同使用的和重复使用的一种规范性文件。")
        sleep(3)
        system("clear")
    elif a == "作业帮":
        b("作业帮致力于为全国中小学生提供全学科的学习辅导服务，作业帮用户量突破8亿 [1]  ，月活用户约1.7亿 [2]  ，是中小学在线教育领军品牌。 [3-6] 作业帮自主研发多余项学习工具，包括拍照搜题、作业帮直播课、古文助手、作文搜索等。在作业帮，学生可以通过拍照、语音等方式得到难题的解析步骤、考点答案；可以通过作业帮直播课与教师互动学习；可以迅速发现自己的知识薄弱点，精准练习补充；可以观看课程直播，手机互动学习；也可以连线老师在线一对一答疑解惑；学习之余还能与全国同龄学生一起交流，讨论学习生活中的趣事。2019年6月11日，作业帮入选“2019福布斯中国最具创新力企业榜”。 [7-8] 2019年12月24日，通过教育部备案，备案号为教APP备1100058号。 [9]")#
        sleep(3)
        system("clear")
    elif a == "谷歌":
        PEN("谷歌公司（Google Inc.）成立于1998年9月4日，由拉里·佩奇和谢尔盖·布林共同创建，被公认为全球最大的搜索引擎公司。 [1] 谷歌是一家位于美国的跨国科技企业，业务包括互联网搜索、云计算、广告技术等，同时开发并提供大量基于互联网的产品与服务，其主要利润来自于AdWords等广告服务。 [2] 1999年下半年，谷歌网站“Google”正式启用。 [3]  2010年3月23日，宣布关闭在中国大陆市场搜索服务。2015年8月10日，宣布对企业架构进行调整，并创办了一家名为Alphabet的“伞形公司”（Umbrella Company），成为Alphabet旗下子公司。2015年，在2015年度“世界品牌500强”排行中重返榜首，苹果和亚马逊分别位居第二和第三名。2016年6月8日，《2016年BrandZ全球最具价值品牌百强榜》公布，以2291.98亿美元的品牌价值重新超越苹果成为百强第一。 [4]  2017年2月，Brand Finance发布2017年度全球500强品牌榜单，排名第一。 [5]  2017年6月，《2017年BrandZ最具价值全球品牌100强》公布，谷歌公司名列第一位。 [6] 2017年12月13日，谷歌正式宣布谷歌AI中国中心（Google AI China Center）在北京成立。 [7] 2018年1月，腾讯和谷歌宣布双方签署一份覆盖多项产品和技术的专利交叉授权许可协议。 [8]  2018年5月29日，《2018年BrandZ全球最具价值品牌100强》发布，谷歌公司名列第一位。12月18日，世界品牌实验室编制的《2018世界品牌500强》揭晓，Google排名第2位。 [9]  2019年度全球最具价值100大品牌榜第二位。 [10]")
        sleep(3)
        system("clear")
    elif a == "小米" or a == "小米公司":
        b("北京小米科技有限责任公司成立于2010年3月3日 [1]  ，是一家专注于智能硬件和电子产品研发的全球化移动互联网企业 [2]  ，同时也是一家专注于高端智能手机、互联网电视及智能家居生态链建设的创新型科技企业。 [3] 小米公司创造了用互联网模式开发手机操作系统、发烧友参与开发改进的模式。小米还是继苹果、三星、华为之后第四家拥有手机芯片自研能力的科技公司。2018年7月9日在香港交易所主板挂牌上市，成为港交所上市制度改革后首家采用不同投票权架构的上市企业。 [4] “为发烧而生”是小米的产品概念。“让每个人都能享受科技的乐趣”是小米公司的愿景。小米公司应用了互联网开发模式开发产品的模式，用极客精神做产品，用互联网模式干掉中间环节，致力让全球每个人，都能享用来自中国的优质科技产品。 [3] 小米已经建成了全球最大消费类IoT物联网平台，连接超过1亿台智能设备 [5]  ，MIUI月活跃用户达到2.42亿 [6]  。小米系投资的公司接近400家，覆盖智能硬件、生活消费用品、教育、游戏、社交网络、文化娱乐、医疗健康、汽车交通、金融等领域。2019年6月，入选2019福布斯中国最具创新力企业榜。 [7-8]  2019年7月，2019世界500强排行榜发布，小米排名468位 [9]  。2019年10月，2019福布斯全球数字经济100强榜发布，小米位列第56位。 [10]  2019年12月18日，人民日报“中国品牌发展指数”100榜单排名30位。 [11] 2019年，小米手机出货量1.25亿台，全球排名第四， [12]  电视在中国售出1021万台，排名第一。 [13]  入围2020全球百强创新名单，AI等专利位于全球前列。 [14] ")
        sleep(3)#我是水印李承骏＆缪子航
        system("clear")
    elif a == "苹果电脑" or a == "macbook" or a == "Macbook":
        b("苹果电脑是苹果公司开发上市的一种产品，苹果公司原称苹果电脑公司（Apple Computer, Inc.）总部位于美国加利福尼亚的库比提诺，核心业务是电子科技产品，全球电脑市场占有率为3.8%。苹果的Apple II于1970年代助长了个人电脑革命，其后的Macintosh接力于1980年代持续发展。最知名的产品是其出品的Apple II、Macintosh电脑、iPod数位音乐播放器、iTunes音乐商店和iPhone智能手机，它在高科技企业中以创新而闻名。苹果公司于2007年1月9日旧金山的Macworld Expo上宣布改名。")
        sleep(3)
        system("clear")
    elif a == "2020":
        b("尔凌软件科技有限公司（2020软件）成立于2007年，是一家辅助家居行业的软件供应商。主要经营计算机软件的开发、设计、制作，销售自产产品。总部位于加拿大，在上海和广州分别设立了办公室，2020的主要产品有针对家居行业设计、生产、管理的软件。2020Design 家具设计软件、2020 imos 易模式家具工艺软件、2020Insight 家具管理软件、2020IdealSpaces家居体验设计平台。")
        sleep(3)
        system("clear")
    elif a == "2012":
        b("《2012》是一部关于全球毁灭的灾难电影，由罗兰·艾默里奇执导，约翰·库萨克、桑迪·牛顿、阿曼达·皮特和切瓦特·埃加福特等联袂出演，影片于2009年11月13日在美国上映。影片故事发生在2012年12月，一家人正在度假。没想到根据玛雅预言，2012年的12月21日，正是世界末日，玛雅人的日历也到那天为止，再没有下一页。电影讲述了主人公以及世界各国人民挣扎求生的经历，灾难面前，尽现人间百态")
        sleep(3)
        system("clear")
    elif a == "清"or a == "清朝":
        b("清朝（1636年—1912年），是中国历史上最后一个封建王朝，共传十二帝  ，从努尔哈赤建立后金政权起，总计296年。   从皇太极改国号为清开始，国祚276年。   从清兵入关，建立全国性政权算起为268年。 1616年，建州女真首领努尔哈赤建立后金。1636年，皇太极改国号为大清。1644年，驻守山海关的明将吴三桂降清，多尔衮率领清兵入关，至1659年平定大顺、大西、南明等政权。后又平定三藩之乱、统一台湾，逐步掌控全国。  康雍乾三朝走向鼎盛，在此期间，中国的传统社会取得了前所未有的发展成就。清初人口增殖，土地增垦，物产盈丰，边境无事，小农经济的生产方式和社会生活相对繁荣稳定，综合国力远胜于汉唐。 [8]  鸦片战争后多遭列强入侵，中国人民进行了洋务运动和戊戌变法等近代化的探索和改革。1912年2月12日，北洋大臣袁世凯诱使清帝溥仪逊位，颁布了退位诏书，清朝从此结束。 [9-10] 清朝时期，统一多民族国家得到巩固和发展，清朝统治者统一蒙古诸部，将新疆和西藏纳入版图，积极维护国家领土主权的完整。乾隆年间，中国作为统一的多民族世界大国的格局最终确定。极盛时期的清朝，西抵葱岭和巴尔喀什湖，西北包括唐努乌梁海，北至漠北和西伯利亚，东到太平洋（包括库页岛），南达南沙群岛。包括50多个民族，国家空前统一。 期间中国古代的专制主义也推向了最高峰。清朝前期农业和商业发达，江南出现了密集的商业城市，并在全国出现了大商帮。在此基础上，人口突破四亿大关，占世界总人口十亿的近一半。")
        sleep(3)
        system("clear")#我是水印李承骏＆缪子航
    elif a == "吃":
        b("吃（拼音：chī），是指用手或工具（筷子，叉子，勺子等）把食物送进口腔，经过牙齿咀嚼后下咽经食道管进入胃里，再由消化系统完成整个消化过程。方言读音：四川方言读音为qī（启）。广东方言读音为hek方言用词：湖南省方言用“呷”（读qia，掐音）表示“吃”：呷饭。")
        sleep(3)
        system("clear")
    elif a == "麦片":
        b("麦片(oatmeal)：是一种以小麦为原料加工而成的食品。是用普通的麦子和一些东西加工而成的。它曾经是第一种被工业化生产的早餐谷物食品。麦片的“片”字是指，它是一种来自被煮过，辗碎，和加以烘干的谷物，通常被放在牛奶和果汁里，或做成麦片粥加以食用。 麦片还分为普通麦片和燕麦片，燕麦片是由燕麦做成的，由于麦片食品的制作过程简单，而且省时，有的种类的麦片，只要经过水泡，就可以食用，所以受到了很多人的欢迎。")
        sleep(3)
        system("clear")
    elif a == "王思聪":
        b("王思聪，1988年1月3日出生于辽宁省大连市，毕业于伦敦大学学院哲学系，  万达集团董事长王健林的独子，北京普思投资有限公司董事长、IG电子竞技俱乐部创始人、万达集团董事。2010年底，王思聪持有万达院线约1000万股。  2011年4月，因在微博上炮轰俏江南董事长张兰造谣，引起热议。2014年9月12日，王思聪以侵犯名誉权为由，起诉网易和搜狐，否认斥资千万拉票   。2015年8月末，王思聪出镜的BBC纪录片《中国的秘密》播出  ；9月5日，王思聪参加腾讯《英雄联盟》四周年庆典，并表示担任熊猫TV的CEO；10月24日，中国移动电竞联盟成立，王思聪任主席。 2016年，新版“京城四少”名单火热出炉，王思聪位居榜首。  2018年8月18日，王思聪开始自己的职业LOL生涯。同年9月19日，王思聪正式宣布退役。  2019年1月25日，王思聪豪掷630万招募编剧人才和优秀剧本");
        sleep(3)
        system("clear")
    elif a == "李现":
        b("李现，曾用名李晛，1991年10月19日出生于湖北省咸宁市，成长于湖北省荆州市，中国内地影视男演员，毕业于北京电影学院表演系2010级。2011年，出演个人首部电影《万箭穿心》，从而正式进入演艺圈。2012年，主演青春爱情电影《初恋未满》。2013年，出演绿色环保爱情喜剧电影《玩命试爱》。2014年，出演国内首部原创都市奇幻单元《奇妙世纪》中第二集“最长的25米”。")
        sleep(3)#我是水印李承骏＆缪子航
        system("clear")
    elif a == "陈伟霆":
        b("陈伟霆（William Chan），1985年11月21日出生于中国香港，华语影视男演员、歌手、主持人。2003年，因参加全球华人新秀香港区选拔赛而进入演艺圈。2006年成为Sun Boy’z组合一员。2008年开始独立发展，随后推出个人首张专辑《Will Power》，并获香港十大劲歌金曲颁奖礼最受欢迎男新人金奖及香港十大中文金曲最有前途新人金奖。2013年，陈伟霆将工作重心转移至中国内地，")
        sleep(3)
        system("clear")
    elif a == "黄家驹":
        b("黄家驹（1962年6月10日-1993年6月30日），出生于中国香港，中国香港男歌手、原创音乐人、吉他手、摇滚乐队Beyond的主唱、节奏吉他手及创队成员。1983年以歌曲《大厦》出道，并组建Beyond乐队，担任主唱。1988年凭借专辑《秘密警察》在香港歌坛获得关注，其中由黄家驹创作的歌曲《大地》获得十大劲歌金曲奖。1989年凭借歌曲《真的爱你》获得十大劲歌金曲奖以及十大中文金曲奖。")
        sleep(3)
        system("clear")
    elif a == "周星驰":
        b("周星驰，1962年6月22日生于香港，祖籍浙江宁波，中国香港演员、导演、编剧、制作人、商人，毕业于无线电视艺员训练班。1980年成为丽的电视台的特约演员，从而进入演艺圈。1981年出演个人首部电视剧《IQ成熟时》。1988年将演艺事业的重心转向大银幕，并于同年出演电影处女作《捕风汉子》。1990年凭借喜剧片《一本漫画闯天涯》确立其无厘头的表演风格 [1]  ；同年，因其主演的喜剧动作片《赌圣》打破香港地区票房纪录而获得关注  。1991年主演喜剧片《逃学威龙》，并再次打破香港地区票房纪录   。1995年凭借喜剧爱情片《大话西游》奠定其在华语影坛的地位。1999年自导自演的喜剧片《喜剧之王》获得香港电影年度票房冠军 2002年凭借喜剧片《少林足球》获得第21届香港电影金像奖最佳男主角奖以及最佳导演奖   。2003年成为美国《时代周刊》封面人物   。2005年凭借喜剧动作片《功夫》获得第42届台湾电影金马奖最佳导演奖 [7]  。2008年自导自演的科幻喜剧片《长江7号》获得香港电影年度票房冠军 [8]  。2013年执导古装喜剧片《西游·降魔篇》，该片以2.18亿美元的票房成绩打破华语电影在全球的票房纪录   。2016年担任科幻喜剧片《美人鱼》的导演、编剧、制作人，该片以超过33亿元的票房创下中国内地电影票房纪录 演艺事业外，周星驰还涉足商界。1989年成立星炜有限公司  。1996年成立星辉公司   。2010年出任比高集团有限公司执行董事")
        sleep(3)
        system("clear")
    elif a == "赵丽颖":
        b("赵丽颖，1987年10月16日出生于河北省廊坊市，中国内地影视女演员、歌手。2006年，因获得雅虎搜星比赛冯小刚组冠军而进入演艺圈；同年，在冯小刚执导的广告片《跪族篇》中担任女主角。2011年，因在古装剧《新还珠格格》中饰演晴儿一角而被观众认识。2013年，凭借古装剧《陆贞传奇》获得更多关注。2014年10月，在第10届金鹰电视艺术节举办的投票活动中被选为“金鹰女神”；");
        sleep(3)
        system("clear")#我是水印李承骏＆缪子航
    elif a == "蔡徐坤":
        b("蔡徐坤（KUN），1998年8月2日出生于浙江省，中国内地男歌手、演员、音乐制作人。2012年4月，蔡徐坤因参加综艺节目《向上吧！少年》进入全国200强   ；同年8月，参演个人首部偶像剧《童话二分之一》   。2014年3月，参演个人首部电影《完美假妻168》。2018年1月，参加偶像男团竞演养成类真人秀《偶像练习生》，并于同年4月6日获得最高票数，以NINE PERCENT九人男团C位出道并担任队长 [3]  ；同年8月，发行个人首张EP《1》 [4]  ；随后获得出道后首个个人音乐类奖项亚洲新歌榜2018年度盛典“最受欢迎潜力男歌手”   ；同年12月，获第十二届音乐盛典咪咕汇年度“最佳彩铃销量歌手”、年度十大金曲《Wait Wait Wait》、搜狐时尚盛典“年度人气男明星”以及今日头条年度盛典“年度偶像人物”。2019年2月，首登北京台春晚便包揽词曲，为其创作歌曲《那年春天》  。2月18日，发布单曲《没有意外》   。3月22日，发布海外公演主题曲《Bigger》  。4月19日，发布单曲《Hard To Get》")
        sleep(3)
        system("clear")
    elif a == "迪丽热巴":
        b("迪丽热巴（Dilraba），1992年6月3日出生于新疆乌鲁木齐市，中国内地影视女演员、歌手，毕业于上海戏剧学院。2013年，迪丽热巴因主演个人首部电视剧《阿娜尔罕》而出道。2014年，她主演了奇幻剧《逆光之恋》。2015年，迪丽热巴凭借爱情剧《克拉恋人》赢得高人气，并获得国剧盛典最受欢迎新人女演员奖。2016年，其主演的现代剧《麻辣变形计》播出；")
        sleep(3)
        system("clear")
    elif a == "李荣浩":
        b("李荣浩，1985年7月11日出生于安徽省蚌埠市，中国流行乐男歌手、音乐制作人、吉他手、演员。2013年9月正式出道，至2019年，共发行5张专辑，其作品在大中华区有很高的流行度；入围9次金曲奖，并获得内地首位金曲最佳新人奖；与众多歌手合作，为他人操刀作品逾200首；举办3轮大型巡回演唱会，是首位同时登上台北小巨蛋和香港红磡的内地歌手。2019年8月，获2019福布斯中国100名人榜荣誉。")
        sleep(3)
        system("clear")
    elif a == "Angelababy":
        b("angelababy（杨颖），1989年2月28日出生于上海市，华语影视女演员、时尚模特。2003年，Angelababy以模特身份出道，此后，她因担任时尚模特而在香港崭露头角。2007年，她开始将工作重心转向大银幕。2011年，她在爱情片《夏日乐悠悠》中首次担任女主角。2012年，凭借言情片《第一次》获得第13届华语电影传媒大奖最受瞩目女演员奖。")
        sleep(3)
        system("clear") #我是水印李承骏＆缪子航
    elif a == "海清":
        b("海清，本名黄怡，1977年1月12日生于中国江苏省南京市，演员，毕业于北京电影学院表演系。2003年，通过出演电视剧《玉观音》中的钟宁一角而出道。2009年11月，出演滕华涛执导的都市情感剧《蜗居》，该剧让海清的演艺事业取得了一定的成功。2010年，凭借主演爱情电视剧《媳妇的美好时代》获得第28届中国电视剧“飞天奖”优秀女演员奖，和第25届中国电视金鹰奖观众喜爱的电视剧女演员奖。")
        sleep(3)
        system("clear")
    elif a == "黄磊":
        b("黄磊，1971年12月6日出生于江西省南昌市，中国大陆男演员、导演、编剧、监制、制片人、歌手、教师、作家。1990年黄磊考入北京电影学院表演系，同年出演陈凯歌执导电影《边走边唱》。1996年凭借电影《夜半歌声》获得第3届中国长春电影节最佳男配角奖。1997年北京电影学院硕士毕业后留校任教，同年发行第一张音乐专辑《边走边唱》。1999年出演电视剧《人间四月天》，饰演徐志摩。")
        sleep(3)
        system("clear")
    elif a == "张信哲":
        b("张信哲，1967年3月26日生于中国台湾云林县，中国台湾流行乐男歌手、演员、舞台剧团团长。1987年张信哲签约滚石唱片的子公司巨石音乐，1989年发行第一张专辑《说谎》。1995年成立音乐工作室潮水音乐，并加盟EMI旗下附属厂牌种子音乐，1996年凭着专辑《宽容》获得第7届台湾金曲奖最佳国语男歌手奖。1997年推出专辑《过火》、《思念》、《挚爱》、《直觉》。")
        sleep(3)
        system("clear")
    elif a == "牯牛降风景区":
        b("牯牛降风景区位于石台县与祁门县交界处，是安徽南部三大高山（黄山、清凉峰、牯牛降）之一，距石台县城22公里，主峰海拔1727.6米，总面积为6700公顷。牯牛降共分五大景区:主峰景区、灵山景区、双龙谷景区、龙门景区、观音堂景区。其中前四个皆位于石台县境内，观音堂景区位于祁门县境内。牯牛降以雄、奇、险著称，是黄山山脉向西延伸的主体，古称“西黄山”，山岳风光秀美绮丽。境内有36大峰，72小峰，36大岔，72小岔。因其山形酷似一头牯牛从天而降，故名牯牛降。2014年，牯牛降旅游景点荣获“安徽名牌”产品称号。")
        sleep(3)
        system("clear")
    elif a == "安庆天柱山风景名胜区":
        b("天柱山风景名胜区，位于安徽省安庆市潜山市西部，景区因主峰如“擎天一柱”而得名，被誉为“江淮第一山”，主要有天柱峰、飞来峰、天池峰，千米以上高峰有45座，主峰海拔为1488.4米，景区规划保护区面积为333平方公里，风景区面积为82.46平方公里。天柱山风景名胜区内分布有名崖、奇石、异洞、涧瀑、云海等自然景观，位列安徽省三大名山之一（黄山、九华山、天柱山）。景区宗教文化积淀深厚，是中华佛教禅宗发源地之一。禅宗第三代祖师僧璨在此驻锡弘法、传承衣钵。三祖寺多次受到历代帝王加封，享有“禅林谁第一，此地冠南州”的盛誉。保留有“解缚石”、三祖舍利塔、三祖洞等珍贵文物。1982年，被国务院批准为首批国家重点风景名胜区。1992年，被批准为国家森林公园。2000年，被评为国家AAAAA级旅游景区、 2011年，被批准为世界地质公园。")
        sleep(3)#我是水印李承骏＆缪子航
        system("clear")
    elif a == "沙巴州":
        b("沙巴州（Negeri Sabah）简称沙州，旧称北婆罗洲，有“风下之地”之美誉，是马来西亚十三个州之一，首府亚庇（旧称哥打京那峇鲁）。位于加里曼丹岛东北部，面积74500平方公里，人口共385.38万（2017年）  ，属于热带雨林气候。沙巴州下设5省，即西海岸省、内陆省、古达省、山打根省、及斗湖省。  2016年沙巴州生产总值达到738亿令吉，人均收入21081令吉，低于马来西亚人均收入38887令吉。  沙巴于1881年至1963年间被英国人统治，直到1963年8月31日起自治（国防、外交、财政、内政等事务仍由英国殖民政府掌管）。1963年9月16日，沙巴加入马来西亚。1984年，沙巴州政府将纳闽分割出来设立成联邦直辖区，是马来西亚唯一的岸外金融中心。")
        sleep(3)
        system("clear")
    elif a == "亚庇国际机场":
        b("亚庇国际机场（IATA：BKI，ICAO：WBKK）是马来西亚沙巴最繁忙的国际机场，也是继吉隆坡国际机场全国第二繁忙的机场。位于亚庇市中心附近，是亚洲航空、马来西亚航空的重点城市。机场分为两个航厦，分为第一航厦（Terminal 1）和第二航厦（Terminal 2）。 2006年服务200万名乘客。")
        sleep(3)
        system("clear")
    elif a == "贝勒大学":
        b("（Baylor University）创立于1845年, 是德克萨斯州历史上最悠久的大学，也是美国密西西比河以西的第一批教育机构之一。 该大学位于达拉斯 - 沃斯堡大都会区和奥斯汀之间，沿着布拉佐斯河畔而建，占地1000英亩(约4平方公里)。它是一所世界享有盛誉的私立研究型大学，也是世界上最大的浸信会大学校园。")
        sleep(3)
        system("clear") 
    elif a == "君主立宪制":
        b("君主立宪制（英语：Constitutional monarchy），亦即“有限君主制”，是相对于君主专制的一种国家体制。君主立宪是在保留君主制的前提下，通过立宪，树立人民主权、限制君主权力、实现事务上的共和主义理想但不采用共和政体。可分为二元制君主立宪制、议会制君主立宪制。英国的“光荣革命”为君主立宪制国家开启了先例。一般君主是终身制的，君主的地位从定义上就已经高于国家的其他公民（这是君主与一些其他元首如独裁者的一个区别），往往君主属于一个特别的阶层（贵族），此外世袭制也往往是君主的一个特点。君主虽然是国家元首（head of state），但君主的产生方式与权力范围，会依各个国家的制度而不同；纵使是同一个国家，往往在不同时期，君主的产生方式与权力范围也各不相同。君主立宪制与一个国家的国情和文化传统有着密切关系，它具有一定的进步性，同时也有一定的妥协性，局限性。英国在革命后通过《权利法案》首先确定。")
        sleep(3)
        system("clear")
    elif a == "佛罗里达大学":
        b("佛罗里达大学（University of Florida，简称UF，也称作UFL）是位于美国佛罗里达州盖恩斯维尔（Gainesville）的一所著名的公立研究型大学。佛罗里达大学是北美顶尖大学联盟美国大学协会（AAU）成员之一，建校可追溯至1853年。佛罗里达大学被誉为公立常春藤，在《美国新闻与世界报道（US NEWS）》2019全美综合排名中排第35位，位列全美公立大学第8位；2017年niche   全美公立大学排名第12位，在《美国新闻与世界报道（US NEWS）》2016世界大学排名中排世界第47位。在2018-2019 CWUR世界大学排名中排世界第62位   。在美国本土国家大学排名体系中位列全球第50名。世界大学学术表现排行（URAP）位列世界45名。大学作为全美最大的研究型大学之一，每年为佛罗里达州经济贡献近60亿美元，并创造近七万五千个工作职位。佛罗里达大学共获得研究资金五亿八千三百万美元，其金额超过佛州所有其他大学的总和。学校有超过40位美国国家科学院，工程院，医学院院士。著名的校友包括成功破译遗传密码的Marshall Nirenberg，最早成功提出超导体的微观理论的John Robert Schrieffer，安塔娜索夫-数字计算机之父、卡德-佳得乐饮料的发明者、女星费唐纳威、男星埃布森、佛罗里达州州长。同时贡献了多位NBA球星，如贾森威廉姆斯，阿尔霍福德，钱德勒帕森斯等。校友中至少有10位参议员，40位众议员，17位州长，2位诺贝尔奖得主，3位NASA宇航员和几十位专业运动员，及多位普利策奖和菲尔兹奖获得者。")
        sleep(3)#我是水印李承骏＆缪子航
        system("clear")
    elif a == "蜗鸢":
        b("蜗鸢（学名：Rostrhamus sociabilis）为鹰科齿鹰亚科的鸟类，是一种中型猛禽，体长约45厘米，翼展120厘米，体重360-520克，寿命17年。上体羽毛深蓝色，头和下体羽毛灰白色或杂色，腿爪黄色有黑爪尖，眼睛棕红色。成年雄性的整个头部，背部，翅膀，胸部，腹部，侧腹和大腿形成一个整体的深石板灰色，展开的羽毛和尾巴羽毛几乎是黑色。上体覆盖有少许棕灰色的色彩。尾巴底面和尾部根基是白色。虹膜深红色，广泛栖息于美洲的中部和南部，栖息于沼泽，湖泊和有水域的地区。主要食谱是蜗牛属的福寿螺，偶尔也吞食海龟，在干旱时期也捕食小型哺乳动物。")
        sleep(3)
        system("clear")
    elif a == "弧边招潮蟹":
        b("弧边招潮（学名：Uca arcuata）为沙蟹科招潮属的动物。分布于朝鲜西岸、日本、澳大利亚、新喀里多尼亚、新加坡、加里曼丹岛、菲律宾、台湾岛以及中国大陆的广东、福建、浙江、山东等地，生活环境为海水，多见穴居于港湾中的沼泽泥滩上。最大的特征是雄蟹具有一对大小悬殊的螯，摆在前胸的大螯像是武士的盾牌。它会做出舞动大螯的动作，这个被称为“招潮”的动作，目的是威吓敌人或是求偶。此外，该蟹还有一对火柴棒般突出的眼睛，非常特别。它们取食藻类，能吞食泥沙以摄取其中的有机物，将不可食的部分吐出。它们取食藻类。")
        sleep(3)
        system("clear")
    elif a == "大嘴乌鸦":
        b("大嘴乌鸦（学名：Corvus macrorhynchos）又叫巨嘴鸦，俗称老鸦、老鸹。是雀形目鸟类中体型最大的几个物种之一，成年的大嘴乌鸦体长可达50厘米左右。大嘴乌鸦雌雄同形同色，通身漆黑，除头顶、后颈和颈侧之外的其它部分羽毛，带有一些显蓝色、紫色和绿色的金属光泽。嘴粗大，嘴峰弯曲，峰嵴明显，嘴基有长羽，伸至鼻孔处。额较陡突。尾长、呈楔状。后颈羽毛柔软松散如发状，羽干不明显。大嘴乌鸦是杂食性鸟类，对生活环境不挑剔，无论山区平原均可见到，喜结群活动于城市、郊区等适宜的环境。主要分布于亚洲东部地区，中国全境可见。栖息于低山、平原和山地阔叶林、针阔叶混交林、针叶林、次生杂木林、人工林等各种森林类型中。喜欢在林间路旁、河谷、海岸、农田、沼泽和草地上活动，有时甚至出现于山顶灌丛和高山苔原地带。主要以蝗虫、金龟甲、金针虫、蝼蛄、蛴螬等昆虫、昆虫幼虫和蛹为食。分布于亚洲东部和南部，北至俄罗斯库页岛、鄂霍次克海岸、萨哈林岛、黑龙江流域，东至朝鲜、日本、琉球群岛，南至印度、缅甸、斯里兰卡、尼泊尔、巴基斯坦、阿富汗、泰国、中南半岛、马来西亚、菲律宾和印度尼西亚等地。");
        sleep(3)
        system("clear")
    elif a == "比利时国家男子足球队":
        b("比利时国家男子足球队是西欧国家比利时的国家级别足球队，由比利时足球协会管理，参加国际足联A级比赛。比利时队号称“欧洲红魔”，在国际足坛A级大赛历史中有不俗战绩。比利时是首届世界杯参赛队之一。1986年墨西哥世界杯他们在八强战击败西班牙后在半决赛以0:2被阿根廷打败，继而在季军战负于法国获得殿军  。而且欧洲杯表现也不俗，曾获得他们主办的1972年欧洲杯的第三名，并在1980年欧洲杯成为亚军。比利时还曾夺得1920年奥运会和1900年奥运会足球项目的金牌和铜牌。 2015年11月5日，国际足联公布的国家队排名中，比利时首次位居榜首创造历史   。2018年俄罗斯世界杯，比利时最终夺得季军，创造了队史世界杯最好战绩")
        sleep(3)
        system("clear")
    elif a == "多雷尔·赖特":#我是水印李承骏＆缪子航
        b("多雷尔·赖特（Dorell Wright），1985年12月2日出生于美国加利福尼亚州洛杉矶（Los Angeles, CA），美国职业篮球运动员，司职小前锋，效力于俄罗斯VTB联赛库班火车头队。多雷尔·赖特于2004年通过选秀进入NBA，先后效力于热火、勇士、76人和开拓者等球队，2005-06赛季随热火队夺得NBA总冠军。")
        sleep(3)
        system("clear")
    elif a == "维克多·安":
        b("维克多·安（Victor An），原名安贤洙（Ahn Hyun-Soo），1985年11月23日出生于韩国，俄罗斯男子短道速滑运动员。2002年1月，年仅17岁的安贤洙夺得了世界青年短道锦标赛的冠军。2月，代表韩国短道速滑队参加美国盐湖城冬奥会   。2006年，安贤洙在都灵冬奥会上史无前例的获得了3枚金牌及一枚铜牌  。2007年，代表韩国队出战的安贤洙在短道速滑世锦赛上分别获得男子1000米和5000米接力两枚金牌及男子3000银牌   。2008年初，安贤洙在一次训练中受伤。2009年，伤愈复出后的安贤洙因奥运选拔积分不足而无缘参加温哥华冬奥会   。2011年12月28日，安贤洙获得时任俄罗斯总统梅德韦杰夫亲自签署了总统令，取得俄罗斯国籍，并正式更名为维克多·安（Victor An）  。此后在2012年初，初次代表俄罗斯队在短道速滑世界杯莫斯科站中亮相   。2014年2月，以加入俄罗斯籍的维克多·安代表东道主出战索契冬奥会短道速滑比赛，再次实现勇夺3金的壮举。在自己刷新个人纪录的同时也改写了俄罗斯国家队的历史   。12月19日，维克多·安获得英国路透社评选的年度最佳复苏奖  。2015年，维克多·安在欧洲短道速滑锦标赛男子500米与男子5000米接力项目上获得两枚金牌   。2018年1月，短道速滑名将维克多·安（原名安贤洙）因兴奋剂问题将被禁止参加即将开幕的平昌冬奥会。   同年9月6日，维克多·安正式宣布退役。");
        sleep(3)
        system("clear")
    elif a == "李幼斌":
        b("李幼斌，1958年2月15日出生于中国吉林省长春市，国家一级演员， 现为全国劳动模范。1985年李幼斌首次主演电影《死证》。1995年参演电视剧《布尔什维克兄弟》；2000年主演电影《横空出世》，获得第5届中国长春电影节最佳男主角奖；在2005年电视剧《亮剑》中饰演李云龙，获得第23届中国电视金鹰奖观众喜爱的男演员奖 ；2008年主演电视剧《闯关东》；   2012年主演《老严有女不愁嫁》；  2014年主演功夫喜剧《爱的保镖》；2015年主演的电视剧《别让我看见》，《孙老倔的幸福》首播。  2016年主演电视剧《决战江桥》，饰演爱国将领马占山。   2017年主演反腐剧《脊梁》。   2017年9月，当选为中国视协第六届副主席。")
        sleep(3)
        system("clear")
    elif a == "郑钧":
        b("郑钧，1967年11月6日出生于陕西西安，中国摇滚乐歌手。现居北京，边开酒吧边排练乐队。1994年在红星生产社发行第一张专辑《赤裸裸》。后又发行《第三只眼》、《怒放》、《郑钧=zj》、《我们的生活充满阳光》、《长安 长安》等多张专辑。2004年获得第4届百事音乐风云榜年度最佳摇滚男歌手奖。2013年4月，担任湖南卫视主推的励志音乐类真人秀节目《中国最强音》的音乐导师（与罗大佑、陈奕迅、章子怡）")
        sleep(3)
        system("clear")
    elif a == "郭振清":
        b("郭振清（1927年8月15日—2005年8月24日），出生于天津市，中国内地演员、导演，毕业于华北职工干部学校。20世纪50年代初，参演个人首部话剧《提高一步》 。1952年，主演个人首部电影《六号门》。1955年，主演战争电影《平原游击队》  。1958年，主演剧情电影《花好月圆》  。1964年，在战争电影《独立大队》中饰演马龙  。1973年，主演农村电影《艳阳天》  。1975年，在剧情电影《决裂》中饰演垦殖场场长龙国正   。1981年，与印质明联合执导剧情电影《大虎》  。1989年，主演剧情电影《荒娃》。1995年，郭振清获得第5届中国电影表演艺术学会奖“特别奖”   。2005年8月24日，郭振清因肺部感染在天津去世，享年78岁")
        sleep(3)
        system("clear")#我是水印李承骏＆缪子航
    elif a == "足球":
        b("足球，英文：football，美国称为soccer，被誉为“世界第一运动”，全球体育界最具影响力的单项体育运动。标准的11人制足球比赛由两队各派10名球员与1名守门员，总共22人，在长方形的草地球场上对抗、防守、进攻。比赛时尽量将足球射入对方的球门内，每射入一球就可以得到一分，当比赛完毕后，得分多的一队则胜出。如果在比赛规定时间内得分相同，则须看比赛章则而定，可以抽签、加时再赛或互射点球（十二码）  等形式比赛分高下。足球比赛中除了守门员可以在己方禁区内利用手部接触足球外，球场上每名球员只可以利用手以外的身体其他部分控制足球（开界外球例外）。")
        sleep(3)
        system("clear")
    elif a == "死亡之组":
        b("本次U17世界杯将有24支队伍参加，他们是：澳大利亚、 日本、韩国、塔吉克斯坦（亚洲）安哥拉、喀麦隆、尼日利亚、塞内加尔（非洲）加拿大、海地、墨西哥、美国（中北美及加勒比海地区）巴西、 阿根廷、智利、厄瓜多尔、巴拉圭（南美洲）新西兰、所罗门群岛（大洋洲）法国、匈牙利、意大利、荷兰、西班牙（欧洲）分组定档原则及种子队的确定：24支队伍将被分成6个小组，每个小组有4支队伍组成。同时，24支队伍被划分为4档，每档有6支球队。球队档位的确定，是根据24支队伍在过去五届U17世界杯上的成绩进行综合打分，时间越近的杯赛，成绩分数权重越大。此外，2019年U17世界杯预选赛各大洲的冠军会得到额外的加分。最终，得分最高的6支球队成为种子队，他们分别是：巴西队、墨西哥队、尼日利亚队、法国队、日本队、西班牙队。阿根廷队、美国队、新西兰队、巴拉圭队、厄瓜多尔队、韩国队成为了第二档球队。意大利队、喀麦隆队、澳大利亚队、智利队、加拿大队、荷兰队被划到了第三档球队。安哥拉队、海地、匈牙利队、塞内加尔队、所罗门群岛队、塔吉克斯坦队则成为了第四档球队。来自同一大洲或地区的球队将不会分在同一组。抽签仪式由国际足联主席因凡蒂诺的主持。按照惯例，国际足联请来了两位赛事的传奇球星作为抽签嘉宾，协助完成抽签工作。这两位足坛传奇是巴西足坛名宿索尼安德森和尼日利亚著名球星巴巴亚罗。索尼安德森曾经效力于巴塞罗那、里昂、摩纳哥等球队，他在1987年代表巴西队夺得了U17世界杯冠军。索尼安德森巴巴亚罗曾经效力于切尔西、纽卡斯尔联队等球队，他在1993年代表尼日利亚队夺得了U17世界杯冠军。巴巴亚罗最终，抽签结果如下：A组：巴西、加拿大、新西兰、安哥拉B组：尼日利亚、厄瓜多尔、澳大利亚、匈牙利C组：法国、韩国、智利、海地D组：日本、美国、荷兰、塞内加尔E组：西班牙、阿根廷、喀麦隆、塔吉克斯坦F组：墨西哥、巴拉圭、意大利、所罗门群岛 U17世界杯分组抽签结果显然，U17世界杯与成人世界杯有着很多的不同。下面，笔者将根据抽签分组结果，对各支球队进行一下简单的介绍巴西作为本次赛事的东道主，巴西U17队进入A组成为种子队顺理成章。而且按照国际足联本次U17世界杯的定档原则，巴西队获得的积分也能排进前6名。但巴西队原本并没有获得参赛资格，因为在今年年初举行的南美U17锦标赛上，巴西队在小组赛就被淘汰了。只是秘鲁因为赛事组织和基础设施建设没有达到国际足联的要求，被剥夺了举办资格，巴西成为了新的东道主，巴西队才得以以东道主的身份晋级U17世界杯决赛圈的比赛。巴西U17队B组的尼日利亚队是U17世界杯历史上最成功的球队，他们曾经5次夺得这项赛事的冠军，是夺冠次数最多的球队。同在B组的匈牙利队，时隔34年之后再一次获得U17世界杯参赛资格，他们在欧战U17锦标赛的附加赛中，点球击败比利时队，以欧洲第五的身份晋级。C组的法国队近年在U17世界杯上的表现并不突出，但他们经常能够代表欧洲参加U17世界杯，因此积分累积较多，也成为了种子队。韩国队则是以亚洲亚军的身份晋级。法国U17队日本队成为了D组的种子队，他们在去年的U16亚洲杯（也是U17世界杯预选赛）上夺得了冠军。过去五届U17世界杯，日本队全部参加且4次杀入了淘汰赛，成为种子队并不意外。日本U17队同在D组的荷兰队是U17欧锦赛的冠军，他们决赛中击败了意大利队夺冠。美国队则是中北美及加勒比海地区U17锦标赛的亚军，塞内加尔队作为非洲的代表，实力也不容小觑。应该说，D组是实力最接近的一组，堪称“死亡之组”欧洲U17锦标赛冠军：荷兰队E组的西班牙队是上届U17世界杯的亚军，他们在决赛中被英格兰队以5:2击败。但有意思的是，英格兰队并未获得本次U17世界杯的参赛资格。西班牙U17队同组的阿根廷队是以南美U17锦标赛冠军的身份晋级此次赛事。而塔吉克斯坦队则第二次代表亚洲参赛阿根廷U17队F组的墨西哥队成为种子队可谓实至名归，他们在过去五届赛事中三次杀进四强，夺得一次冠军、一次亚军，在中北美及加勒比海地区U17锦标赛中，他们在决赛中击败美国队成为冠军晋级。墨西哥U17队同组的意大利队以欧洲亚军身份晋级，而所罗门群岛队则是第一次参加U17世界杯，他们以大洋洲亚军的身份晋级此次赛事。所罗门群岛U17队注意关注和留意这些青春的脸庞吧，说不定，下一个统治足坛的巨星，就在他们中产生。2019年U17世界杯将于10月26日开幕，揭幕战将由东道主巴西队迎战加拿大队。")
        sleep(3)
        system("clear")
    elif a == "2010年广州亚运会":
        b("2010年广州亚运会，即第16届亚洲运动会。   由广州主办，汕尾市、佛山市、东莞市协办并于2010年11月12日-2010年11月27日在中国广州举行，广州是中国第二个取得亚运会主办权的城市。之前北京曾于1990年举办第11届亚运会。广州亚运会设42项比赛项目，是亚运会历史上比赛项目最多的一届。广州还在亚运会后举办了第一届亚洲残疾人运动会。")
        sleep(3)
        system("clear")
    elif a == "牛油果":
        b("（学名：Butyrospermum parkii Kotschy），落叶乔木，高10-15米，胸径达1-1.5米；树冠开展，分枝多而密，茎枝粗壮，多节瘤，常有弯曲现象；树皮厚，不规则开裂，具乳汁。叶长圆形，先端圆或钝，基部圆或钝，幼时上面被锈色柔毛，后两面均无毛，中脉在上面呈凹槽，下面浑圆且十分凸起，侧脉30对以上，相互平行，两面稍凸起，网脉细；叶柄圆形。花梗被锈色柔毛；花萼裂片披针形，外面被毛；花有香甜味，花冠裂片卵形，全缘。浆果球形，直径3-4厘米，可食，味如柿子；种子卵圆形，黄褐色，具光泽，疤痕侧生，长圆形。花期6月，果期10月。 广布非洲热带。中国云南元江引种站有大面积栽培。种仁富含脂肪、为重要食用油及重要的工矿用油，又可制人造黄油及肥皂。")
        sleep(3)
        system("clear")
    elif a == "水果":
        b("水果，是指多汁且主要味觉为甜味和酸味，可食用的植物果实。水果不但含有丰富的维生素营养，而且能够促进消化。");
        sleep(3)#我是水印李承骏＆缪子航
        system("clear")
    elif a == "水浒传":
        b("《水浒传》，中国四大名著之一，是一部以北宋末年宋江起义为主要故事背景、类型上属于英雄传奇的章回体长篇小说。作者或编者一般被认为是施耐庵，现存刊本署名大多有施耐庵、罗贯中两人中的一人，或两人皆有。全书通过描写梁山好汉反抗欺压、水泊梁山壮大和受宋朝招安，以及受招安后为宋朝征战，最终消亡的宏大故事，艺术地反映了中国历史上宋江起义从发生、发展直至失败的全过程，深刻揭示了起义的社会根源，满腔热情地歌颂了起义英雄的反抗斗争和他们的社会理想，也具体揭示了起义失败的内在历史原因。 《水浒传》问世后，在社会上产生了巨大的影响，成了后世中国小说创作的典范。《水浒传》是中国历史上最早用白话文写成的章回小说之一，流传极广，脍炙人口；同时也是汉语文学中具备史诗特征的作品之一，对中国乃至东亚的叙事文学都有极其深远的影响。")
        sleep(3)
        system("clear")
    elif a == "的卢马":
        b("的卢马，又作的颅。是额上有白色斑点的马，古人认为这种马妨主。 语出伯乐《相马经》：“的卢，马白额入口至齿者，名曰榆雁，一名的卢。奴乘客死，主乘弃市，凶马也。” 《马政论》曰：“颡上有白毛谓之的卢。”又曰：“上有旋毛及白毛者，马白额入口至齿者，谓之的吻，凶。”俗云的卢非也，历史上的的卢马是在三国时期刘备的坐骑。")
        sleep(3)
        system("clear")
    elif a == "爱新觉罗·溥仪":
        b("爱新觉罗·溥仪（1906年2月7日—1967年10月17日），清朝末代皇帝，也是中国历史上最后一个皇帝。字曜之 [1]  ，号浩然。也称清废帝或宣统帝。是道光帝旻宁的曾孙、醇贤亲王奕譞之孙、摄政王载沣长子，母亲苏完瓜尔佳·幼兰。1909年到1912年、1917年7月1日到1917年7月12日两次在位。 [2-3] 1911年辛亥革命爆发，1912年2月12日被迫退位，清朝统治结束。九·一八事变之后在日本人控制下做了满洲国的傀儡皇帝，年号康德（1934年—1945年），所以又称“康德皇帝”。1945年8月15日，日本投降。8月17日，溥仪在沈阳准备逃亡时被苏联红军俘虏，被带到苏联。1950年8月初被押解回国，在抚顺战犯管理所学习、改造。1959年12月4日接到中华人民共和国主席毛泽东的特赦令并成为全国政协委员。溥仪一生四次结婚，娶过五个女人，最后一次婚姻是在1962年与李淑贤结婚。溥仪著有自传《我的前半生》，于1964年4月由群众出版社出版。其独特的富有戏剧性的经历，多次被改编成影视作品，其中电影《末代皇帝》，曾荣获1987年奥斯卡金像奖等众多奖项。1967年10月17日，溥仪因尿毒症在北京逝世，享年61岁。先葬于八宝山，后迁于清西陵内崇陵（光绪陵）附近的华龙皇家陵园。")
        sleep(3)
        system("clear")
    elif a == "得房率":
        b("得房率是指可供住户支配的建筑面积与每户建筑面积之比。一般多层的建筑物得房率为88%，高层的建筑物得房率为72%，而办公楼为55%。")        
        sleep(3)
        system("clear")
    elif a == "对":
        b("对，dui，从丵（zhuo）从口从寸。一只手拿着点燃的蜡烛，有“向着”的意思。对，对或从士。汉文帝以为责对而为言，多非诚对，故去其口以从士也。(1) 会意。从口,从“丵”（zhuó，即，古“丛”字，象草木丛生。）从寸。寸，法度也。汉文帝以为责对而伪，言多非诚，故去其口，以从土。本义：应答。")
        sleep(3)
        system("clear")
    elif  a == "内部资金转移定价":#我是水印李承骏＆缪子航
        b("内部资金转移定价（Funds Transfer Pricing）内部资金转移定价（FTP）是指，商业银行内部资金中心与业务经营单位按照一定规则全额有偿转移资金，达到核算业务资金成本或收益等目的的一种内部经营管理模式。业务经营单位每笔负债业务所筹集的资金，均以该业务的FTP价格全额转移给资金中心；每笔资产业务所需要的资金，均以该业务的FTP价格全额向资金管理部门购买。对于资产业务，FTP价格代表其资金成本，需要支付FTP利息；对于负债业务，FTP代表其资金收益，可以从中获取FTP利息收入。")
        sleep(3)
        system("clear")
    elif a == "看片神器":
        b("《看片神器》是由深圳市宜搜科技发展有限公司开发的一款娱乐类手机软件，有iOS和安卓的两个版本，在各大应用市场均已上线。")
        sleep(3)
        system("clear")
    elif a == "此次":
        b("此次：这一回，这一次。例：兄台此次前来有何指教？古义：这一星次。古人把黄道附近一周天分为十二等分，由西向东分别命名为星纪、玄枵等十二次");
        sleep(3)
        system("clear")
    elif a == "小丑":
        b("小丑是喜剧演员之一，常见于舞台、马戏团、综艺节目、嘉年华、儿童节目及生日会等。他们表演时，多穿着特大鞋子及奇装异服，其脸部也经涂装，尤以鼻子部分较为突出。这些古怪、搞笑的装束给观众带来欢笑。通常小丑都会以自身出糗来娱乐观众。")
        sleep(3)
        system("clear")
    elif a == "发光二极管":
        b("发光二极管简称为LED。由含镓（Ga）、砷（As）、磷（P）、氮（N）等的化合物制成。当电子与空穴复合时能辐射出可见光，因而可以用来制成发光二极管。在电路及仪器中作为指示灯，或者组成文字或数字显示。砷化镓二极管发红光，磷化镓二极管发绿光，碳化硅二极管发黄光，氮化镓二极管发蓝光。因化学性质又分有机发光二极管OLED和无机发光二极管LED")
        sleep(3)
        system("clear")
    elif a == "所罗门王":
        b("所罗门王，是大卫的儿子，犹太人智慧之王。（约前1037年—前997年在位），以色列联合国君主，在耶路撒冷做王四十年余年，相传著有《箴言》、《所罗门智慧书》、《雅歌》、《传道书》等作品，同时对动物植物也有广泛研究。")
        sleep(3)
        system("clear")
    elif a == "南北朝":
        b("420年—589年  ）是南朝和北朝的统称。南北朝时期是中国历史上的一段大分裂时期，也是中国历史上的一段民族大融合时期，上承东晋十六国下接隋朝，由公元420年刘裕代东晋建立刘宋始，至公元589年隋灭陈而终。 南朝（420年—589年）有刘宋、南齐、南梁、南陈四朝。北朝（386年—581年）则包含北魏、东魏、西魏、北齐和北周五朝。南北两方虽各有朝代更迭，但长期维持对峙形势，故称为南北朝。 南北朝前期仍是士族政治，社会阶层分为士族、齐民编户、依附户及奴婢，对外交流也很兴旺，东到日本和朝鲜半岛，西到西域、中亚、西亚，南到东南亚与南亚。 此时也出现民族大融合的趋势，比如北魏孝文帝改革，进一步加速少数民族封建化（汉化）的步伐。");
        sleep(3)
        system("clear")
    elif a == "肉桂":
        b("肉桂（拉丁学名：Cinnamomum cassia Presl）是樟科，樟属中等大乔木，树皮灰褐色。叶互生或近对生，长椭圆形至近披针形，革质，边缘软骨质，内卷，绿色，有光泽，无毛，叶柄粗壮。圆锥花序腋生或近顶生。花白色，花被裂片，花丝被柔毛，扁平，花药卵圆状长圆形，子房卵球形。果椭圆形，成熟时黑紫色，无毛，果托浅杯状。花期6-8月，果期10-12月。原产中国，印度、老挝、越南至印度尼西亚等地也有。喜温暖气候，喜湿润，忌积水，但雨水过多会引起根腐叶烂。幼苗喜阴，成龄树在较多阳光下才能正常生长。该种要求土层深厚、质地疏松、排水良好、通透性强的微酸性或酸性沙壤土或壤土。繁殖方式有萌蘖繁殖、扦插繁殖和种子繁殖。肉桂的树皮常被用作香料，烹饪材料及药材。其木材可供制造家具，该种也能作为园林绿化树种。")
        sleep(3)
        system("clear")
    elif a == "猴头菇":
        b("猴头菇，又叫猴头菌，只因外形酷似猴头而得名。猴蘑，猴头，猴菇，是中国传统的名贵菜肴，肉嫩、味香、鲜美可口。是四大名菜（猴头、熊掌、燕窝、鱼翅）之一。有“山珍猴头、海味鱼翅”之称。这种齿菌科的菌类，菌伞表面长有毛茸状肉刺，长约1~3厘米，它的子实体圆而厚，新鲜时白色，干后由浅黄至浅褐色，基部狭窄或略有短柄，上部膨大，直径3.5~10厘米，远远望去似金丝猴头，故称“猴头菇”，又像刺猬，故又有“刺猬菌”之称。猴头菌是鲜美无比的山珍，菌肉鲜嫩，香醇可口，有“素中荤”之称。作为食用菌王国的珍品 , 猴头菇属于药食两用真菌 , 尤其是其医药方面的药用价值，受到广大消费者的青睐，具有健脾养胃、安神、抗癌的功效 , 对体虚乏力、消化不良、失眠、胃与十二指肠溃疡、慢性胃炎、消化道肿瘤等症有特效。")
        sleep(3)
        system("clear")
    elif a == "杭州博物馆":
        b("杭州博物馆地处杭州吴山景区，占地面积2.4万平方米，建筑面积1.3万平方米，于2001年对外正式开放，是一座反映杭州历史变迁的人文类综合性博物馆。杭州博物馆由南馆和北馆组成。南馆为杭州通史陈列和机动展厅。北馆以“珍藏杭州”为主题，展出了杭州历年出土文物、杭州不可移动文物、馆藏书画和馆藏文房雅玩等珍品。杭州博物馆是杭州文化遗产保护与展示的重要窗口、也是市民及中外游客了解城市历史文化、领略杭州人文精髓的重要场所。");
        sleep(3)
        system("clear")
    elif a == "烟台市博物馆":
        b("烟台市博物馆成立于1958年，正县级全额拨款公益文化事业单位，中国博物馆学会理事单位，山东省具备团体考古发掘资质的三家博物馆之一，烟台市唯一的一座综合性博物馆。 现有馆址两处，原址位于全国重点文物保护单位福建会馆（烟台市民俗博物馆），新址位于南大街61号。新馆建筑面积17000平方米，整体建筑分为五层。包括文物库房、多功能报告厅、大厅、展厅、茶座、4D影院、办公区、阅览区等部分。");
        sleep(3)
        system("clear")
    elif a == "雅安市博物馆":
        b("杭州博物馆地处杭州吴山景区，占地面积2.4万平方米，建筑面积1.3万平方米，于2001年对外正式开放，是一座反映杭州历史变迁的人文类综合性博物馆。杭州博物馆由南馆和北馆组成。南馆为杭州通史陈列和机动展厅。北馆以“珍藏杭州”为主题，展出了杭州历年出土文物、杭州不可移动文物、馆藏书画和馆藏文房雅玩等珍品。杭州博物馆是杭州文化遗产保护与展示的重要窗口、也是市民及中外游客了解城市历史文化、领略杭州人文精髓的重要场所。");
        sleep(3)
        system("clear")
    elif a == "川陕革命根据地红军烈士纪念馆":
        b("馆内陈列主题为“川陕忠魂”。主要以文物、图片、场景介绍和展示红军将士在无数次枪林弹雨中浴血奋战的事迹和总医院医护人员救死扶伤的事迹，以及为开创、发展川陕革命根据地所作出的不朽贡献。整个展陈体现了“川陕苏区首府，红色悲壮通江”的历史地位。纪念馆由“辉煌征程”、“战地雪花”、“铁血丹心”、“丰碑永存”、“将星璀璨”等五个单元组成，陈展面积5600平方米。");
        sleep(3)
        system("clear")
    elif a == "禹州钧官窑址博物馆":
        b("河南禹州钧窑址博物馆、禹州市钧瓷研究所位于禹州市钧官窑路北段，国家级重点文物保护单位宋钧官窑遗址保护区内，占地面积47000平方米，为国家全民事业单位，管所合一，拥有众多的高级工程师、教授、高级工艺美术师和名家巧匠，是一家人才荟萃、实力雄厚、全国唯一的钧瓷专门研究机构");
        sleep(3)
        system("clear")
    elif a == "东瓯国历史陈列馆":#我是水印李承骏＆缪子航
        b("东瓯国历史陈列馆位于鹿城区华盖里94号，系纪念温州人文始祖东瓯王驺摇，在市级文物保护单位东瓯王庙门台基础上布展而成的专题博物馆。主殿东瓯王庙除展现东瓯王像外，还陈列了四幅壁画，采用汉代画风，主要展现劳作生产、佐汉灭秦、民俗生活、迁徙江淮四个主题场景。东瓯国历史陈列馆展览定位于展示东瓯国文化，以东瓯国历史为主线，对东瓯王及东瓯国历史文化进行了全方位展示。2013年6月8日对外免费开放。");
        sleep(3)
        system("clear")
    elif a == "中国丝绸博物馆":
   
        b("中国丝绸博物馆是国家一级博物馆，第一座全国性丝绸专业博物馆，也是世界上最大的丝绸博物馆。1992年对外开放。2004年对公众免费开放，同年，基本陈列被国家文物局评为第六届全国博物馆十大陈列展览精品奖。2012年建馆二十周年，馆内陈列进行大型改造，现设基本陈列“中国丝绸的故事”“天蚕灵机——中国蚕桑丝织技艺非物质文化遗产展示”“纺织品文物修复展示馆”和“新猷资料馆”。临展厅举办各类临时专题展览。");
        sleep(3)
        system("clear")
    elif a == "井冈山革命博物馆":
        b("井冈山革命博物馆，是中国遗址性革命史类博物馆。为纪念中国共产党创建的第一个农村革命根据地井冈山而建立。位于江西省井冈山上的茨坪，1959年建成开放，该馆馆藏文物近3000件，其中原件860件，复制品2000多件。珍贵文物有当年毛泽东撰写《中国红色政权为什么能够存在？》和《井冈山的斗争》时用过的油灯、砚台和朱德在井冈山挑粮用过的扁担等，基本陈列反映了井冈山革命斗争的历史。");
        sleep(3)
        system("clear")
    elif a == "福建省昙石山遗址博物馆":
        b("1998年，福建省昙石山遗址博物馆正式成立，这是福建省第一座依托于史前遗址的博物馆。2005年，福建省政府启动“昙石山遗址保护和博物馆建设”的省重点建设项目，2008年6月14日，遗址博物馆新馆落成并对外试运行。");
        sleep(3)
        system("clear")
    elif a == "成都武侯祠博物馆":
        b("成都武侯祠肇始于公元223年修建刘备惠陵时，名“汉昭烈庙”。后来祭祀诸葛亮的武侯祠并入汉昭烈庙。是中国唯一的一座君臣合祀祠庙和最负盛名的三国蜀汉遗迹博物馆。");
        sleep(3)
        system("clear")
    elif a == "川陕革命根据地红军烈士纪念馆":
        b("馆内陈列主题为“川陕忠魂”。主要以文物、图片、场景介绍和展示红军将士在无数次枪林弹雨中浴血奋战的事迹和总医院医护人员救死扶伤的事迹，以及为开创、发展川陕革命根据地所作出的不朽贡献。整个展陈体现了“川陕苏区首府，红色悲壮通江”的历史地位。纪念馆由“辉煌征程”、“战地雪花”、“铁血丹心”、“丰碑永存”、“将星璀璨”等五个单元组成，陈展面积5600平方米。");
        sleep(3)
        system("clear")
    elif a == "公司名称":
        b("公司名称是公司的称呼。作为独立法人的.公司，必须要有自己的名称。必须在公司章程中予以记载，是公司登记的绝对必要事项。必须用文字表示，以便人们称呼。一般应包括：（1）公司种类。应标明属何种公司，例如无限公司、有限公司等等。不能只标明公司。（2）具体名称。除法律限定的外，一般由当事人自由选定。（3）营业部类。法律不作硬性规定，可有可无。（4）公司所在地名称。公司名称代表公司的商业信誉和技术水平，一经核准登记，公司即取得对该名称的专有使用权。公司名称可以转让。");
        sleep(3)#我是水印李承骏＆缪子航
        system("clear")
    elif a == "花语":
        b("语（英语称language of flowers）是指人们用花来表达人的语言，表达人的某种感情与愿望，在一定的历史条件下逐渐约定形成的，为一定范围人群所公认的信息交流形式。赏花要懂花语，花语构成花卉文化的核心，在花卉交流中，花语虽无声，但此时无声胜有声，其中的含义和情感表达甚于言语。不能因为想表达自己的一番心意而在未了解花语时就乱送别人鲜花，结果只会引来别人的误会。");
        sleep(3)
        system("clear")
    elif a == "白纸坊太狮":
        b("白纸坊太狮是北京市宣武区的狮舞。在民间一直有祛病、消灾，祈求平安、祥瑞的讲究。属于中国文化遗产之一。宣武区白纸坊地区的“白纸坊太狮老会”，成会于清乾隆五年(1740年)，其后几经兴衰，于清同治九年(1870年)重整太狮老会，名称为“广安门里白纸坊永寿长春太狮胜会”。");
        sleep(3)
        system("clear")
    elif a == "非遗":
        b("千年文明古国，孕育出灿烂夺目的华夏文化。工艺、技能无数，巧匠、艺人辈出。我国已入选世界非遗名录30项，世界急需保护非遗名录7项，数量世界第一。然而，我国大部分非遗面临着传承人不足、传统技艺流失、市场严重萎缩等问题。聚焦非遗，触摸千年文明；助力分享，汇聚点滴之力。");
        sleep(3)
        system("clear")
    elif a == "花椒":
        b("花椒（学名：Zanthoxylum bungeanum Maxim.）是芸香科、花椒属落叶小乔木，高可达7米；茎干上的刺，枝有短刺，当年生枝被短柔毛。叶轴常有甚狭窄的叶翼；小叶对生，卵形，椭圆形，稀披针形，叶缘有细裂齿，齿缝有油点。叶背被柔毛，叶背干有红褐色斑纹。花序顶生或生于侧枝之顶，花被片黄绿色，形状及大小大致相同；花柱斜向背弯。果紫红色，散生微凸起的油点，花期4-5月，果期8-9月或10月。分布北起东北南部，南至五岭北坡，东南至江苏、浙江沿海地带，西南至西藏东南部；台湾、海南及广东不产。见于平原至海拔较高的山地，在青海，海拔2500米的坡地也有栽种。耐旱，喜阳光，各地多栽种。花椒的木材为典型的淡黄色，露于空气中颜色稍变深黄，心边材区别不明显，木质部结构密致，均匀，纵切面有绢质光泽，大材有美术工艺价值。孤植又可作防护刺篱。其果皮可作为调味料，并可提取芳香油，又可入药，种子可食用，也可加工制作肥皂。花椒用作中药，有温中行气、逐寒、止痛、杀虫等功效。治胃腹冷痛、呕吐、泄泻、血吸虫、蛔虫等症。又作表皮麻醉剂。  2017年12月1日，《公共服务领域英文译写规范》正式实施，规定花椒标准英文名为Sichuan Pepper。  2018年12月，陕西凤县花椒获评农产品气候品质类国家气候标志。 ");
        sleep(3)
        system("clear")
    elif a == "周立波":
        b("周立波，1967年4月22日生于上海市黄浦区，祖籍浙江省宁波市镇海区，海派清口创始人、主持人、演员。 2006年，和关栋天一起创办海派清口。2008年底，以上海方言为基础创作了海派清口作品《笑侃三十年》和《笑侃大上海》。  2009年，与凤凰卫视联袂，创办电视脱口秀节目《壹周立波秀》。2010年7月，开始海派清口江浙巡演，票房过亿；   同月受东方卫视之邀，参与创办《中国达人秀》。2012年，入职浙江卫视担任创意总监并担任《中国梦想秀》节目“梦想大使”。 [5]  2013年，与李咏一起担任央视《舞出我人生》的主持人   。2017年1月19日，周立波在长岛被捕，被警察搜出枪支和可卡因   ；1月20日，周立波在缴纳保释金后，在其夫人和律师陪同下离开  ；6月，他涉嫌诽谤律师   。2018年6月4日，纽约州拿骚县地区法院第11次开庭，庭审宣判无罪。 2009年，被评为CNN年度亚洲最具影响力人物。   2010年5月，获颁第6届中华慈善奖“最具爱心捐赠个人”奖。");
        sleep(3)
        system("clear")
    elif a == "上海环球金融中心":#我是水印李承骏＆缪子航
        b("上海环球金融中心（Shanghai World Financial Center），位于上海市浦东新区世纪大道100号，为地处陆家嘴金融贸易区的一栋摩天大楼，东临浦东新区腹地，西眺浦西及黄浦江，南向张杨路商业贸易区，北临陆家嘴中心绿地。上海环球金融中心占地面积14400平方米，总建筑面积381600平方米，拥有地上101层、地下3层 ，楼高492米，外观为正方形柱体。裙房为地上4层，高度约为15.8米。上海环球金融中心B2、B1、2和3层为商场、餐厅；7-77层为办公区域（其中29层为环球金融文化传播中心）；79-93层为酒店；94、97和100层为观光厅。 2008年，上海环球金融中心被世界高层建筑与都市人居学会评为“年度最佳高层建筑”，  2018年，上海环球金融中心获得世界高层建筑与都市人居学会颁发的“第16届全球高层建筑奖之‘十年特别奖’”。");
        sleep(3)
        system("clear")
    elif a == "华东理工大学":
        b("华东理工大学（East China University of Science and Technology）简称”华理“（ECUST），位于上海市，是中华人民共和国教育部直属的一所具有理工特色，覆盖理、工、农、医、经、管、文、法、艺术、哲学、教育11个学科门类的研究型全国重点大学；国家首批世界一流学科建设高校，国家“211工程”、“985工程优势学科创新平台”重点建设高校，全国16所工科重点大学科技工作研讨会、高水平行业特色大学优质资源共享联盟成员，入选国家建设高水平大学公派研究生项目、111计划、卓越工程师教育培养计划、2011计划、新工科研究与实践项目、国家大学生创新性实验计划、国家级大学生创新创业训练计划、全国深化创新创业教育改革示范高校、中国政府奖学金来华留学生接收院校等；1956年全国首批招收研究生的学校之一，全国首批博士、硕士、学士学位授予单位，国家首批实施自主招生改革的22所高校之一，首批六所设有国家技术转移中心的创新型、综合类研究型大学之一。2018年，在QS世界大学排名和泰晤士高等教育世界大学排名中，均位列中国内地高校第26位；在ESI中国大学综合排名中，位列第28位。华东理工大学原名华东化工学院，办学历史可追溯到100多年前的南洋公学和震旦学院，1952年由交通大学、震旦大学、大同大学、东吴大学、江南大学等校化工系合并组建而成，1993年更名为华东理工大学。截至2018年12月，学校设有徐汇校区、奉贤校区和金山科技园区三部分，占地面积2535亩，建筑面积92万平方米。");
        sleep(3)
        system("clear")
    elif a == "薛之谦":
        b("薛之谦（Joker Xue），1983年7月17日出生于上海，华语流行乐男歌手、影视演员、音乐制作人，毕业于格里昂酒店管理学院。2005年，因参加选秀节目《我型我秀》而正式出道  。2006年，发行首张同名专辑《薛之谦》，随后凭借歌曲《认真的雪》获得广泛关注  。2007年，凭借专辑《你过得好吗》获得MusicRadio中国TOP排行榜内地年度最受欢迎男歌手奖。2008年，发行专辑《深深爱过你》，同年在上海举行个人首场演唱会“谦年传说”  。2013年，专辑《几个薛之谦》获得MusicRadio中国TOP排行榜内地推荐唱片  。2014年，凭借专辑《意外》获得第21届东方风云榜颁奖最佳唱作人  ；同年他还获得音悦V榜年度盛典年度创作歌手奖   。2015年6月，薛之谦首度担当制作人并发行原创EP《绅士》   ；同年，他还主演都市励志剧《妈妈像花儿一样》  。2016年，凭借EP《绅士》、《一半》获得第16届全球华语歌曲排行榜最受欢迎男歌手、五大最受欢迎男歌手奖、上海地区杰出歌手奖及最受欢迎创作歌手奖，而歌曲《初学者》则获得年度二十大金曲奖  。2017年4月，开启“我好像在哪见过你”全国巡回演唱会   ；同年，薛之谦获得第7届全球流行音乐年度盛典年度最佳男歌手及MusicRadio榜中国TOP排行榜内地最佳男歌手 。2018年7月，薛之谦“摩天大楼”世界巡回演唱会于北京站启程，整个巡演横跨4大洲,8个国家,21个城市,累计上演场次23场");
        sleep(3)
        system("clear")
    elif a == "上海方言":
        b("上海话，是吴语的一种方言，属于汉藏语系-汉语语族-吴语-太湖片-苏沪嘉小片。 上海话又称上海闲话、上海吴语、吴语上海话、沪语，是上海本土文化的重要根基。上海话是吴语的重要代表，与吴语太湖片其他方言基本能互通，是现代吴语地区比较有影响力的一支语言。狭义上海话指上海市区方言，也就是现在被广泛使用和认同的上海主流通用方言。上海话是以本地吴语为基础，自然融合上海开埠后的吴语区各地移民方言而成的一支新型城市吴语。 广义上海话还包括各上海本地（郊区）方言，主要包括浦东话、松江话、嘉定话、崇明话、金山话、青浦话、奉贤话等。上海地区原由江东11个吴语县组成，方言反应江东文化信息。上海话是在上海地区悠久历史中形成的方言，汇聚了吴越江南语言文化的精华，有深厚文化积淀。上海话承载上海这座城市的时代回音、文化血脉、历史记忆。  上海要努力建设成一个有个性特色的东方文化明珠，理应继承上海语言文化的灵魂。");
        sleep(3)
        system("clear")
    elif a == "磁悬浮列车":
        b("磁悬浮列车是一种现代高科技轨道交通工具，它通过电磁力实现列车与轨道之间的无接触的悬浮和导向，再利用直线电机产生的电磁力牵引列车运行。1922年，德国工程师赫尔曼·肯佩尔（Hermann Kemper）提出了电磁悬浮原理，继而申请了专利。20 世纪70年代以后，随着工业化国家经济实力不断增强，为提高交通运输能力以适应其经济发展和民生的需要，德国、日本、美国等国家相继开展了磁悬浮运输系统的研发。  中国：1）我国第一辆磁悬浮列车（买自德国）2003年1月开始在上海磁浮线运行。2015年10月中国首条国产磁悬浮线路长沙磁浮线成功试跑。 2）2016年5月6日，中国首条具有完全自主知识产权的中低速磁悬浮商业运营示范线——长沙磁浮快线开通试运营。该线路也是世界上最长的中低速磁浮运营线。  2018年6月，我国首列商用磁浮2.0版列车在中车株洲电力机车有限公司下线。");
        sleep(3)
        system("clear")
    elif a == "本帮菜":
        b("是上海菜的别称，是江南吴越特色饮食文化的一个重要流派。所谓本帮，即本地。以浓油赤酱、咸淡适中、保持原味、醇厚鲜美为其特色。常用的烹调方法以红烧、煨、糖为主。后为适应上海人喜食清淡爽口的口味，菜肴渐由原来的重油赤酱趋向淡雅爽口。本帮菜烹调方法上善于用糟，别具江南风味。");
        sleep(3)#我是水印李承骏＆缪子航
        system("clear")
    elif a == "范志毅":
        b("范志毅，1969年11月6日出生于上海市杨浦区，前中国足球教练、运动员，前中国国家男子足球队队长，已退役。1995、96年连续2次当选中国足球先生，2001年荣膺亚洲足球先生。共代表中国国家队出场90次，进14球。范志毅原本是上海申花足球队队员，在1998年效力英格兰甲级联赛水晶宫队，并成为当年的年度最佳队员，并担当过该队队长。曾效力香港甲组联赛队伍香港流浪兼任球员及教练，曾担任中国乙级联赛队伍苏州趣普仕的技术总监。2006年，范志毅宣布退役。  2015年7月任上海申花青训总监+U18主帅2018年8月17日，因击打辱骂裁判，被足协禁赛1年。");
        sleep(3)
        system("clear")
    elif a == "上海中心大厦":
        b("上海中心大厦（Shanghai Tower），是中华人民共和国上海市的一座超高层地标式摩天大楼，其设计高度超过附近的上海环球金融中心。上海中心大厦项目面积433954平方米，建筑主体为119层，总高为632米，结构高度为580米，机动车停车位布置在地下，可停放2000辆。 2008年11月29日上海中心大厦进行主楼桩基开工。2016年3月12日，上海中心大厦建筑总体正式全部完工   。2016年4月27日，“上海中心”举行建设者荣誉墙揭幕仪式并宣布分步试运营。2017年4月26日，位于大楼第118层的“上海之巅”观光厅起正式向公众开放 。美国SOM建筑设计事务所、美国KPF建筑师事务所及上海现代建筑设计集团等多家国内外设计单位提交了设计方案，美国Gensler建筑设计事务所的“龙型”方案及英国福斯特建筑事务所“尖顶型”方案入围。经过评选，“龙型”方案中标，大厦细部深化设计以“龙型”方案作为蓝本，由同济大学建筑设计研究院完成施工图出图。");
        sleep(3)
        system("clear")
    elif a == "上海地铁":
        b("上海地铁（Shanghai Metro）是指服务于中国上海市和上海大都市圈的城市轨道交通系统，是世界范围内线路总长度最长的城市轨道交通系统， 是国际地铁联盟（CoMET）的成员之一，  其第一条线路上海地铁1号线于1993年5月28日正式运营，使上海成为中国（不含港澳台地区）第三个开通运营地铁的城市。 截至2018年12月，上海地铁运营线路共16条，共设车站415座（含磁浮线2座），运营里程共705千米（含磁浮线29千米）。 截至2018年12月，上海地铁在建线路共有4条，分别为10号线二期工程、14号线、15号线和18号线，在建里程共163.6千米。 截至2019年6月，上海地铁最高日客运量为2019年3月8日的1329.4万人次。  2018年，上海地铁日均客运量1015.28万人次，总客运量达到37.05亿人次。 2018年12月30日，上海地铁5号线南延伸段（东川路站至奉贤新城站）、13号线二、三期工程（世博大道站至张江路站）载客试运营。");
        sleep(3)
        system("clear")
    elif a == "上海南站":
        b("上海南站（Shanghainan Railway Station），位于中国上海市徐汇区，由中国铁路上海局集团有限公司管辖，是上海铁路客运的南大门，是上海铁路枢纽的重要组成部分。上海南站始建于1998年3月 ，于2002年4月进行重建。 2006年7月1日，重建后的上海南站正式投入运营。  截至2006年7月，上海南站建筑面积5万多平方米，站台线路为6台13线，途径线路有沪杭铁路、京沪铁路和金山铁路。");
        sleep(3)
        system("clear")
    elif a == "上海站":
        b("上海站（Shanghai Railway Station），又名上海新客站，位于中国上海市静安区，毗邻上海长途客运总站，是中国铁路上海局集团有限公司管辖的一座特等站，是上海铁路枢纽的重要组成部分。1908年，伴随着沪宁铁路全线通车，原上海站正式投用；1916年12月更名为上海北站；1947年4月升格为上海总站。1984年9月，新上海站在原上海东站的基础上开建。  1987年12月，新上海站正式启用。   2004年8月，原上海站改建为上海铁路博物馆并开放。2010年，为迎接世博会，上海站进行了整修。 截至2010年5月，上海站站房总面积为9.7万平方米，南广场面积为67000平方米，北广场面积为30000平方米，车场规模达7台15线。");
        sleep(3)
        system("clear")
    elif a == "上海":#我是水印李承骏＆缪子航
        b("上海市，简称“沪”，是中华人民共和国省级行政区。上海是中国共产党诞生地、国家历史文化名城，中国经济、金融、贸易、航运、科技创新中心。   上海位于中国华东地区，界于东经120°52′-122°12′，北纬30°40′-31°53′之间，地处长江入海口，东隔东中国海与日本九州岛相望，南濒杭州湾，北、西与江苏、浙江两省相接，上海市总面积6340.5平方千米。 上海地处太平洋西岸，亚洲大陆东岸，长江三角洲前缘，中国南北弧形海岸线中部，位于长江三角洲冲积平原，平均海拔高度4米。西部有天马山、薛山、凤凰山等残丘，天马山为陆境海拔最高点。上海地跨长江口、淀山湖、黄浦江、吴淞江四大水系，境内江、河、湖、塘相间。上海属亚热带季风性气候，温和湿润，四季分明，日照充分，雨量充沛。上海被GaWC发布的世界城市体系权威排名评为“世界一线城市”。   上海在科尔尼中国官方联合国际顶尖学者和智库发布的2019年《全球城市综合排名》中排名世界第19位，中国第3位。在2019年全球城市营商环境指数暨百强城市排行榜中，上海排名世界第48位，中国第4位。截至2018年末，上海市常住人口总数为2423.78万人。实现地区生产总值（GDP）32679.87亿元，比上年增长6.6%。社会消费品零售总额12668.69亿元，批发业销售额10.79万亿元，人均可支配收入64183元，住户存款总额28569.24亿元，高新技术企业总数9206家。");
        sleep(3)
        system("clear")
    elif a == "上海虹桥站 ":
        b("上海虹桥站（Shanghai Hongqiao Railway Station），位于中国上海市闵行区，为特等站，隶属于中国铁路上海局集团有限公司，于2008年7月20日开工建设，2010年7月1日投入使用。上海虹桥站北端引接京沪高速铁路、沪汉蓉高速铁路，南端与沪昆高速铁路、沪杭甬客运专线接轨，是上海虹桥综合交通枢纽的组成部分，是华东地区最重要的、规模最大的铁路客运枢纽。 截至2010年6月，上海虹桥站总投资超过150亿元人民币，总占地面积超过130万平方米，相当于3个天安门广场。上海虹桥站总建筑面积约44万平方米、站房面积约24万平方米、无站台柱雨棚面积6.9万平方米，候车大厅面积约11340平方米，最高可同时容纳1万人候车。上海虹桥站设高速、综合2个车场，设16站台（2个侧式站台+14个岛式站台）、30股道、30站台面。");
        sleep(3)
        system("clear")
    elif a == "外滩 ":
        b("外滩（英文：The Bund；上海话拼音：nga thae），位于上海市黄浦区的黄浦江畔，即外黄浦滩，为中国历史文化街区。1844年（清道光廿四年）起，外滩这一带被划为英国租界，成为上海十里洋场的真实写照，也是旧上海租界区以及整个上海近代城市开始的起点。外滩全长1.5公里，南起延安东路，北至苏州河上的外白渡桥，东面即黄浦江，西面是旧上海金融、外贸机构的集中地。上海辟为商埠以后，外国的银行、商行、总会、报社开始在此云集，外滩成为全国乃至远东的金融中心。民国三十二年（1943年）8月，外滩随交还上海公共租界于汪伪国民政府，结束长达百年的租界时期，于民国三十四年（1945年）拥有正式路名中山东一路。外滩矗立着52幢风格迥异的古典复兴大楼，素有外滩万国建筑博览群之称，是中国近现代重要史迹及代表性建筑，上海的地标之一。1996年11月，国务院将其列入第四批全国重点文物保护单位。与外滩隔江相对的浦东陆家嘴，有上海标志性建筑东方明珠、金茂大厦、上海中心大厦、上海环球金融中心等，成为中国改革开放的象征和上海现代化建设的缩影。2018年3月，上海外滩在全面推进“第一立面”（即临江建筑群）功能置换的基础上，同步启动了“第二立面”（即非临江的外滩建筑群）功能置换工作。");
        sleep(3)
        system("clear")
    elif a == "上海迪士尼乐园":
        b("上海迪士尼乐园，是中国内地首座迪士尼主题乐园，位于上海市浦东新区川沙新镇，于2016年6月16日正式开园。它是中国第二个、中国内地第一个、亚洲第三个、世界第六个迪士尼主题公园。上海迪士尼乐园拥有七大主题园区：米奇大街、奇想花园、探险岛、宝藏湾、明日世界、梦幻世界、玩具总动员   ；两座主题酒店：上海迪士尼乐园酒店、玩具总动员酒店；一座地铁站：迪士尼站；并有多个全球首发游乐项目。2016年3月8日，上海迪士尼度假区在其官方网站公布首批园内实景图。园内的创极速光轮   将成为全球迪士尼主题乐园中首创的景点。2019年3月5日，上海迪士尼乐园因园方工作人员阻拦上海华东政法大学大三学生小王携带零食进园游玩而被告上法庭。8月11日下午，上海迪士尼度假区答复称关于外带食品与饮料的规定与亚洲的其他主题乐园一致");
        sleep(3)
        system("clear")
    elif a == "上海浦东国际机场":
        b("上海浦东国际机场（Shanghai Pudong International Airport，IATA：PVG，ICAO：ZSPD），位于中国上海市浦东新区，距上海市中心约30公里，为4F级民用机场，是中国三大门户复合枢纽之一  、长三角地区国际航空货运枢纽群成员、华东机场群成员 、华东区域第一大枢纽机场、门户机 。上海浦东国际机场于1999年建成，1999年9月16日一期工程建成通航，2005年3月17日第二跑道正式启用，2008年3月26日第二航站楼及第三跑道正式通航启用，2015年3月28日第四跑道正式启用。根据2017年11月官网信息显示，浦东机场有两座航站楼和三个货运区，总面积82.4万平方米，有218个机位，其中135个客机位。拥有跑道四条，分别为3800米2条、3400米1条、4000米1条。  截至2016年底，浦东机场已吸引了37家航空公司在此运营全货机业务，全货机通航31个国家、112个通航点，每周全货机起降近1000架次。 2017年，浦东机场年旅客吞吐量7000.43万人次，年货邮吞吐量383.56万吨，年起降航班496879架次。截至2017年底，已有110家航空公司开通了飞往上海两大机场的定期航班，浦东机场联通全球47个国家和地区的297个通航点。");
        sleep(3)
        system("clear")#我是水印李承骏＆缪子航
    elif a == "上海新天地":
        b("新天地是一个具有上海历史文化风貌，中西融合的都市旅游景点，上海新天地以上海近代建筑的标志石库门建筑旧区为基础。首次改变了石库门原有的居住功能，创新地赋予其商业经营功能，把这片反映了上海历史和文化的老房子改造成餐饮、购物、演艺等功能的时尚、休闲文化娱乐中心。漫步新天地，仿佛时光倒流，有如置身于二十世纪二、三十年代的上海，但一步跨进每个建筑内部，则非常现代和时尚，亲身体会新天地独特的理念，这有机的组合与错落有致地巧妙安排形成了一首上海昨天、明天、今天的交响乐，让海内外游客品味独特的文化。");
        sleep(3)
        system("clear")
    elif a == "刘翔":
        b("刘翔，1983年7月13日出生于上海市普陀区，中国男子田径队110米栏运动员。中国体育田径史上、也是亚洲田径史上第一个集奥运会、室内室外世锦赛、国际田联大奖赛总决赛冠军和世界纪录保持者多项荣誉于一身的运动员。2004年雅典奥运会男子110米栏，以12秒91的成绩追平了由英国选手科林·杰克逊创造的世界纪录夺冠。 2006年瑞士洛桑田径超级大奖赛男子110米栏，以12秒88的成绩打破了保持13年的世界纪录夺冠。 2007年世界田径锦标赛男子110米栏冠军 [1]  。2012年国际田联钻石联赛尤金站男子110米栏，以12秒87的成绩夺冠。 [1]  2012年6月，世界110米栏排名第一，刘翔时隔五年后重登榜首。 2015年4月7日，刘翔正式宣布退役。2015年2月3日，刘翔担任北京国际田联世界田径锦标赛的推广大使 。2016年4月，参加《极速前进第三季》  。2016年，参加《熟悉的味道第一季》  。2017年5月，参加《来吧冠军第二季》，再次公开跨");
        sleep(3)
        system("clear")
    elif a == "上海自然博物馆":
        b("上海自然博物馆是中国最大的自然博物馆之一。上海自然博物馆（上海科技馆分馆）坐落于上海市静安雕塑公园内。其历史最早可追溯到1868年由法国天主教神父韩伯禄创立的徐家汇博物院（中国最早的博物馆，1933年更名为震旦博物院），以及1874年由英国人办的亚洲文会上海博物院（隶属于大英博物馆皇家学会，解放后改名为上海博物院）。1956年，在震旦博物院和上海博物院的基础上，上海自然博物馆正式成立。上海自然博物馆新馆于2015年二季度对外开放 ，以“自然·人·和谐”为主题，通过“演化的乐章”、“生命的画卷”、“文明的史诗”三大主线，呈现了起源之谜、生命长河、演化之道、大地探珍、缤纷生命、生态万象、生存智慧、人地之缘、上海故事、未来之路等10个常设展区及临展厅、4D影院、探索中心等配套功能区域。  构筑观察发现、动手实验、对话探讨的乐园。截至2018年，建筑面积45,257 平方米，展览教育服务面积32,200 平方米，年接待观众200万人次。  上海自然博物馆拥有29万余件藏品，包括来自华东地区乃至全国及世界各地的自然界和人类历史遗物，分别隶属于植物、动物、古生物、地质及人文五大类，其中植物标本15万余件，哺乳动物标本4千余件，鱼类、鸟类、两栖爬行类各1万余件，昆虫标本近3.3万件，其他无脊椎标本5万余件，地质标本5千余件，古生物8千余件，人文民俗类3500余件。");
        sleep(3)
        system("clear")
    elif a == "金山区":
        b("金山区隶属于上海市，是上海西南部远郊，位于中国长江以南、黄浦江上游南岸，东与奉贤区接壤、北与松江区、青浦区为邻，西与浙江平湖、嘉善交界。全境地势低平，地面高程自北西至东南略有升高。河流属黄浦江水系，源出浙江天目山区。2015年全区总面积613平方公里，辖有9个镇、1个街道、2个工业区，常住人口79.8万人。金山古称海盐，别称柘湖、康城、前京、苎城、鹦鹉洲、云间等，曾是中国著名的产盐之乡。上海市中部有一条偏西北——东南走向的远古时代的自然堤，谓之冈身，即从金山开始、行经奉贤、闵行、嘉定等一线。在金山漕泾有唯一遗址，为区级文物。另境内有马家浜文化和良诸文化多处。2016年，金山区完成地区生产总值922.9亿元。2017年，金山区重新确认国家卫生城市（区）。 2018年10月22日，入选2018年全国农村一二三产业融合发展先导区创建名单。2019年1月9日，凭借金山农民画入选2018—2020年度“中国民间文化艺术之乡”名单。");
        sleep(3)
        system("clear")
    elif a == "九峰三泖":
        b("九峰三泖位于上海市松江区境内，山明水秀，文物众多，是上海著名的旅游胜地。九峰指的是佘山、天马山、横山、小昆山、凤凰山、厍公山、辰山、薛山和机山等 9 座山峰，九峰均在海拔100米以下，呈西南--东北走向，逶迤13.2公里，山地面积共约2.35平方公里。三泖是指松江、青浦、金山至浙江平湖间相连的大湖荡。");
        sleep(3)
        system("clear")
    elif a == "召稼楼":
        b("召稼楼位于闵行区浦江镇，是上海最早垦荒种地的地区，召稼楼文化是上海农耕文化的起源。上海召稼楼古镇景区为国家AAAA级旅游景区，拥有五百年的人文历史，源于元初，横跨元明清三个朝代，保留众多明清古建筑如“礼耕堂”、“梅园”等。“召楼三宝”有召楼大曲、召楼羊肉、召楼拆蹄。明朝工部右侍郞谈伦，曾在此建楼鸣钟以召农耕，因此名曰“召稼楼”，为上海垦荒第一楼。古镇市河姚家浜由西稍向东北走向，老街集中市河两侧，隔河相望。素墙灰瓦，深弄曲巷，“高屋窄巷对街楼，小桥流水处人家”。");
        sleep(3)
        system("clear")
    elif a == "发":
        b("姒发（？-前1652）姒姓，名发，又名敬、惠。夏朝第十六任君主，史称惠发、发惠、敬发、后发(夏后发)、夏王发。发的功绩之一是破格提拔当时养马的长者关龙逄为相（关龙逄的祖先是为夏朝饲养牲畜的牧正，为古豢龙氏的后代，也称豢龙），使夏朝国势更加强盛。但是夏朝在他的儿子桀的统治下由盛转衰，走向灭亡。");
        sleep(3)
        system("clear")
    elif a == "扣三丝 ":
        b("扣三丝属于上海本帮菜代表性菜肴之一，起源于淮扬菜。它选料认真，刀工十分精细，整齐美观。具有咸鲜口味、 整齐美观、汤汁澄清，堪称海派美食珍品，是营养不良和调理贫血者美食之选。");
        sleep(3)
        system("clear")
    elif a == "青鱼秃肺":
        b("青鱼秃肺是一道上海市的地方传统名菜。主要材料为青鱼肝、冬笋、蚕豆等，色泽金黄，油肥不腻，嫩如猪脑，整块不碎，肥鲜异常。具有明目调理的功效。取活青鱼，宰杀后剥取附在鱼肠上的鱼肝作原料，每条青鱼才这么一点点，得凑足十五条青鱼才做得成这道菜。");
        sleep(3)
        system("clear")
    elif a == "托马斯·阿尔瓦·爱迪生" or a=="爱迪生":
        b("托马斯·阿尔瓦·爱迪生（Thomas Alva Edison，1847年2月11日—1931年10月18日），出生于美国俄亥俄州米兰镇，逝世于美国新泽西州西奥兰治。发明家、企业家。 爱迪生是人类历史上第一个利用大量生产原则和电气工程研究的实验室来进行从事发明专利而对世界产生深远影响的人。他发明的留声机、电影摄影机、电灯对世界有极大影响。他一生的发明共有两千多项，拥有专利一千多项。  爱迪生被美国的权威期刊《大西洋月刊》评为影响美国的100位人物第9名。");
        sleep(3)
        system("clear")
    elif a == "c语言":
        b("是一门面向过程、抽象化的通用程序设计语言，广泛应用于底层开发。C语言能以简易的方式编译、处理低级存储器。C语言是仅产生少量的机器语言以及不需要任何运行环境支持便能运行的高效率程序设计语言。尽管C语言提供了许多低级处理的功能，但仍然保持着跨平台的特性，以一个标准规格写出的C语言程序可在包括一些类似嵌入式处理器以及超级计算机等作业平台的许多计算机平台上进行编译。");
        sleep(3)
        system("clear")
    elif a == "Python":
        b("Python是一种计算机程序设计语言。是一种面向对象的动态类型语言，最初被设计用于编写自动化脚本(shell)，随着版本的不断更新和语言新功能的添加，越来越多被用于独立的、大型项目的开发。");
        sleep(3)
        system("clear")
    elif a == "计算机程序设计语言":
        b("《计算机程序设计语言》是2002年9月清华大学出版社出版的图书，作者是Donald E. Knuth 。");
        sleep(3)
        system("clear")
    elif a == "反对":
        b("反对就是前两个语句从矛盾对立的两个方面对照，表示相对相反的意思，在内容上相反相成，对立统一，是对偶修辞方法中的一种。反对是由反与对组成矛盾的统一体。对面是能够看到的。反面是不能看到的。反对就是在问题上存在争执，互不相让。对立是对面而立，是指不避认，并不存在争执，而可相让。");
        sleep(3)
        system("clear")
    elif a == "良渚文化":
        b("良渚文化代表遗址为良渚遗址，距今5300-4300年。良渚文化分布的中心地区在钱塘江流域和太湖流域，而遗址分布最密集的地区则在钱塘江流域的东北部、东部。该文化遗址最大特色是所出土的玉器。挖掘自墓葬中的玉器包含有璧、琮、冠形器、玉镯、柱形玉器等诸多器型。此外，良渚陶器也相当细致。良渚文化遗址中心位于杭州市区西北部瓶窑镇，核心部位于古城“反山、莫角山、汇观山，11条水坝”均在瓶窑境内。1936年发现的良渚遗址，实际上是余杭县的良渚、瓶窑、安溪三镇之间许多遗址的总称，是长江下游良渚文化的代表性遗址，1959年依照考古惯例按发现地点良渚命名为良渚文化。遗址总面积约34平方公里。良渚古城遗址是人类早期城市文明的范例，实证中华五千年文明史，申遗成功标志着中华五千年文明史得到国际社会认可。  2019年7月6日，中国良渚古城遗址获准列入世界遗产名录");
        sleep(3)
        system("clear")
    elif a == "豚鼠":
        b("豚鼠（学名：Cavia porcellus）又名天竺鼠。豚鼠是无尾啮齿动物，身体紧凑，短粗，头大颈短，它们具有小的花瓣状耳朵，位于头顶的两侧，具有小三角形嘴。四肢短小，作为选择育种的结果，存在20种不同表型的毛发颜色，并且存在13种不同的表型毛发质地和长度。 温带陆生夜行性动物，取食叶子，根和块茎，水果，花卉。具有社会性，可群居。圈养寿命平均为8年。繁殖活跃的豚鼠通常寿命较短，约为3~5年。在野外已经灭绝，作为宠物分布在世界各地。未列入《濒危物种红色名录》。");
        sleep(3)
        system("clear")
    elif a == "无线鼠标":
        b("无线鼠标是指无线缆直接连接到主机的鼠标，采用无线技术与计算机通信，从而省却电线的束缚。通常采用无线通信方式，包括蓝牙、Wi-Fi (IEEE 802.11)、Infrared (IrDA)、ZigBee (IEEE 802.15.4)等多个无线技术标准。");
        sleep(3)
        system("clear")
    elif a == "冉建新":
        b("冉建新，男，49岁，原利川市都亭办事处党委书记、主任，因涉嫌受贿犯罪，在巴东县人民检察院异地受审过程中死亡，有关方面通报的死亡时间是2011年6月4日16时30分。2012年1月19日，湖北省鹤峰县人民法院依法判处被告人原巴东县人民检察院反贪局教导员任中海有期徒刑三年，法警大队教导员谭发明有期徒刑一年。");
        sleep(3)
        system("clear")
    elif a == "高句丽":
        b("高句（gōu）丽（lí）是公元前一世纪至公元七世纪在今中国东北地区和朝鲜半岛存在的一个政权。其人民主要是濊貊和扶余人，后又吸收一部分靺鞨人、古朝鲜遗民及三韩人。高句丽极盛时疆域，东部濒临日本海；南部控制了汉江流域；西北跨过辽水；北部到辉发河、第二松花江流域。高句丽是一个强大的国家。专业研究高句丽史、民族边疆史的历史学家耿铁华先生的《中国高句丽史》、杨秀祖《高句丽军队与战争研究》都指出高句丽有60万军队。");
        sleep(3)
        system("clear")
    elif a == "Wi-Fi" or a =="wifi":#我是水印李承骏＆缪子航
        b("Wi-Fi（发音： /ˈwaɪfaɪ/，法语发音：/wifi/），在中文里又称作“行动热点”，是Wi-Fi联盟制造商的商标做为产品的品牌认证，是一个创建于IEEE 802.11标准的无线局域网技术。基于两套系统的密切相关，也常有人把Wi-Fi当做IEEE 802.11标准的同义术语。“Wi-Fi”常被写成“WiFi”或“Wifi”，但是它们并没有被Wi-Fi联盟认可。并不是每样匹配IEEE 802.11的产品都申请Wi-Fi联盟的认证，相对地缺少Wi-Fi认证的产品并不一定意味着不兼容Wi-Fi设备。IEEE 802.11的设备已安装在市面上的许多产品，如：个人计算机、游戏机、MP3播放器、智能手机、平板电脑、打印机、笔记本电脑以及其他可以无线上网的周边设备。Wi-Fi联盟成立于1999年，当时的名称叫做Wireless Ethernet Compatibility Alliance（WECA）。在2002年10月，正式改名为Wi-Fi Alliance。");
        sleep(3)
        system("clear")
    elif a == "中文维基百科":
        b("中文维基百科是维基百科协作计划的中文版本，自2002年10月24日正式成立，由非营利组织──维基媒体基金会负责维持，截至2010年6月30日14:47，中文维基百科已拥有314,167条条目，累计编辑次数达13,708,705次。此外还设有其他独立运作的中文方言或版本，包括闽南语维基百科、粤语维基百科、文言文维基百科、吴语维基百科、闽东语维基百科、赣语维基百科及客家语维基百科等。");
        sleep(3)
        system("clear")
    elif a == "西汉长信宫灯":
        b("中国汉代青铜器，1968年于河北省满城县（今河北省保定市满城区西南约1.5公里的山崖上）中山靖王刘胜妻窦绾[wǎn]墓中出土。2010年作为中国2010年上海世界博览会展品展出。宫灯灯体为一通体鎏金、双手执灯跽坐的宫女，神态恬静优雅。灯体通高48厘米，重15.85公斤。长信宫灯设计十分巧妙，宫女一手执灯，另一手袖似在挡风，实为虹管，用以吸收油烟，既防止了空气污染，又有审美价值。此宫灯因曾放置于窦太后（刘胜祖母）的长信宫内而得名，现藏于河北博物院。");
        sleep(3)
        system("clear")
    elif a == "假动作":
        b("《假动作》是由小寒作词，黄韵仁作曲，房祖名演唱的一首歌曲，该单曲发行于2010年4月16日，收录在专辑《乱》中。");
        sleep(3)
        system("clear")
    elif a == "第二次世界大战":
        b("第二次世界大战（英文：World War II，简称二战，亦可称世界反法西斯战争，1939年9月1日—1945年9月2日）是以德意志第三帝国、日本帝国、意大利王国三个法西斯轴心国和匈牙利王国、罗马尼亚王国、保加利亚王国等仆从国为一方，以反法西斯同盟和全世界反法西斯力量为另一方进行的第二次全球规模的战争。 战争范围从欧洲到亚洲，从大西洋到太平洋，先后有61个国家和地区、20亿以上的人口被卷入战争，作战区域面积2200万平方千米。据不完全统计，战争中军民共伤亡9000余万人，5万多亿美元付诸东流，是人类历史上规模最大的世界战争。 第二次世界大战最后以美国、苏联、英国、中国等反法西斯国家和世界人民战胜法西斯侵略者赢得世界和平与进步而告终。 第二次世界大战在客观上推动了科学技术的发展，这次战争带动了航空技术、原子能、重炮等领域的发展与进步。");
        sleep(3)
        system("clear")
    elif a == "容国团":
        b("容国团（1937年8月10日—1968年6月20日），男子乒乓球运动员。1937年8月10日生于香港工人家庭，籍贯中山县南屏镇人（今珠海市香洲区南屏镇）。中国乒乓球乃至中国体育界第一个世界冠军。1959年，第二十五届世界乒乓球锦标赛在联邦德国多特蒙德举行，容国团夺得男单冠军，为中国夺得世界体育比赛中第一个世界冠军。1961年，第二十六届世界乒乓球锦标赛在北京举行，容国团参加的中国队以5∶3击败日本队，首获男团世界冠军。1964年后担任中国乒乓球女队教练，带队获得第28届世界乒乓球锦标赛女子团体冠军。");
        sleep(3)
        system("clear") 
    elif a=="阿基米德":
        b("阿基米德（公元前287年—公元前212年），伟大的古基本原理。给出许多求几何图形重心，包括由一抛物线和其网平行弦线所围成图形的重心的方法。阿基米德证明物体在液体中所受浮力等于它所排开液体的重量，这一结果后被称为阿基米德原理。他还给出正抛物旋转体浮在液体中平衡稳定的判据。阿基米德发明的机械有引水用的水螺旋，能牵动满载大船的杠杆滑轮机械，能说明日食，月食现象的地球-月球-太阳运行模型。但他认为机械发明比纯数学低级，因而没写这方面的著作。阿基米德还采用不断分割法求椭球体、旋转抛物体等的体积，这种方法已具有积分计算的雏形。");
        sleep(3)
        system("clear")
    elif a=="梵高":
        b("文森特·梵高（Vincent van Gogh，1853年3月30日—1890年7月29日），荷兰后印象派画家。代表作有《星月夜》、自画像系列、向日葵系列等。梵高出生于1853年3月30日荷兰乡村津德尔特的一个新教牧师家庭，早年的他做过职员和商行经纪人，还当过矿区的传教士最后他投身于绘画。他早期画风写实，受到荷兰传统绘画及法国写实主义画派的影响。1886年，他来到巴黎，结识印象派和新印象派画家，并接触到日本浮世绘的作品，视野的扩展使其画风巨变，他的画，开始由早期的沉闷、昏暗，而变得简洁、明亮和色彩强烈。1888年，来到法国南部小镇阿尔，已经摆脱印象派及新印象派的影响，走到了与之背道而驰的境地。同年与高更交往，但由于二人性格的冲突和观念的分歧，合作很快便告失败。此后，梵高的疯病（有人记载是“癫痫病”）时常发作，但神志清醒时他仍然坚持作画，1890年7月，他在精神错乱中开枪自杀，年仅37岁。");
        sleep(3)
        system("clear")
    elif a=="鱼玄机":
        b("《鱼玄机》是当代作家吴蔚创作的长篇历史小说。丛书《中国古代大案探奇录》之一。小说对史料加以丰富和重构，选取了鱼玄机人生中的最后一段时光，以悬疑探案的手法，折射出这位奇女子的传奇人生。");
        sleep(3)
        system("clear")
    elif a=="孙立人":
        b("孙立人，字抚民，号仲能，汉族，安徽省舒城县三河（今属安徽合肥肥西县）人，生于安徽省庐江县金牛镇。先后毕业于清华大学、美国弗吉尼亚军事学院。中华民国陆军二级上将军衔，第一次缅战时任38师师长，在孟关杰布山隘间战役毙敌2000余，孟拱河谷战役击毙日军12000余 ，第二次入缅作战时任新一军军长，攻克八莫、南坎、老龙山、南巴卡、新维、腊戍、乔美等地，共击毙日军3万3千余 ，是抗战中军级单位将领中歼灭日军最多的将领，有“丛林之狐”、“东方隆美尔”的美称。 孙立人致力于国军现代化，整编撤退来台之国军，建立完善之兵役制度与预备军官制度。1955年遭蒋介石认定叛变被软禁，随着孙案的爆发，孙立人的一切事迹，遭到国民党政府的历史删除。1988年台监察院认定孙立人无叛乱意图，2014年7月，台湾监察机构承认1955年郭廷亮“假藉长官名义为匪工作”间接为其平反。 ");
        sleep(3)
        system("clear")	    
    elif a=="莫罕达斯·卡拉姆昌德·甘地":
        b("莫罕达斯·卡拉姆昌德·甘地（Mohandas Karamchand Gandhi，1869年10月2日——1948年1月30日），尊称“圣雄甘地”（Mahatma Gandhi），印度民族解放运动的领导人、印度国民大会党领袖。莫罕达斯·卡拉姆昌德·甘地出生在一个印度教家庭，父亲是当地土邦首相。甘地19岁时远赴英国学习法律。1893年，甘地来到英国统治下的南非，领导南非印度人争取权利。他把印度教的仁爱、素食、不杀生的主张，同《圣经》、《古兰经》中的仁爱思想相结合，并吸收了梭伦、托尔斯泰等人的思想精髓，逐渐形成了非暴力不合作理论。1915年，甘地回到印度，很快成为国大党的实际领袖，使“非暴力不合作”成为国大党的指导思想，开始为印度的独立而奔波。“二战”后，印度分裂为印度与巴基斯坦两个国家。面对两国的冲突，对双方都有重要影响的甘地多次以绝食来感化他们，呼吁团结。1948年1月30日，甘地遭到印度教顽固教徒刺杀。 甘地是印度国父，也是提倡非暴力抵抗的现代政治学说——甘地主义的创始人。他的精神思想带领国家迈向独立，脱离英国的殖民统治。他的“非暴力”的哲学思想，影响了全世界的民族主义者和争取能以和平变革的国际运动。");
        sleep(3)
        system("clear")
    elif a=="香蕉":
        b("香蕉（学名：Musa nana Lour.）芭蕉科芭蕉属植物，又指其果实，热带地区广泛种植。香蕉味香、富含营养，植株为大型草本，从根状茎发出，由叶鞘下部形成高3～6公尺(10～20尺)的假杆；叶长圆形至椭圆形，有的长达3～3.5公尺(10～11.5尺)，宽65公分(26寸)，10～20枚簇生茎顶。穗状花序下垂  ，由假杆顶端抽出，花多数，淡黄色；果序弯垂，结果10～20串，约50～150个。植株结果后枯死，由根状茎长出的吸根继续繁殖，每一根株可活多年。原产亚洲东南部，台湾、海南、广东、广西等均有栽培。");
        sleep(3)
        system("clear")
    elif a=="焦虑症":
        b("焦虑症（anxiety），又称为焦虑性神经症，是神经症这一大类疾病中最常见的一种，以焦虑情绪体验为主要特征。可分为慢性焦虑，即广泛性焦虑（generalized anxiety）和急性焦虑，即惊恐发作（panic attack）两种形式。主要表现为：无明确客观对象的紧张担心，坐立不安，还有植物神经功能失调症状，如心悸、手抖、出汗、尿频等，及运动性不安。注意区分正常的焦虑情绪，如焦虑严重程度与客观事实或处境明显不符，或持续时间过长，则可能为病理性的焦虑。");
        sleep(3)
        system("clear")
    elif a=="佩奇"or a == "小猪佩奇":
        b("佩奇（英文名：Peppa Pig）《小猪佩奇》的一号主角，是一只非常可爱的小猪，她和她的妈妈、爸爸以及弟弟乔治生活在一起。她最喜欢跳泥坑，最喜欢吃的是意大利面和巧克力蛋糕，最喜欢扮成小仙女公主，最喜欢喝橙汁，也很喜欢去她的爷爷奶奶，伯父伯母家玩。她还有堂姐和堂弟，堂姐叫克洛伊，堂弟叫亚历山大");
        sleep(3)
        system("clear")
    elif a=="秋季"or a == "秋":
        b("秋季是春夏秋冬四季之一。从气象意义上划分，北温带的秋季在8月23日（处暑）~11月20日（小雪）；南温带的秋季在2月19日（北半球雨水）~5月21日（北半球小满）。秋季最明显的变化在树木，城市开始清扫大量落叶，山区则涌进不少观赏枫红的游客。");
        sleep(3)
        system("clear")
    elif a=="教师节":
        b("教师节，旨在肯定教师为教育事业所做的贡献。在中国近现代史上，多次以不同的日期作为过教师节。直至1985年，第六届全国人大常委会第九次会议通过了国务院关于建立教师节的议案，才真正确定了1985年9月10日为中国第一个教师节。");
        sleep(3)
        system("clear")
    elif a=="香蕉":
        b("香蕉（学名：Musa nana Lour.）芭蕉科芭蕉属植物，又指其果实，热带地区广泛种植。香蕉味香、富含营养，植株为大型草本，从根状茎发出，由叶鞘下部形成高3～6公尺(10～20尺)的假杆；叶长圆形至椭圆形，有的长达3～3.5公尺(10～11.5尺)，宽65公分(26寸)，10～20枚簇生茎顶。穗状花序下垂  ，由假杆顶端抽出，花多数，淡黄色；果序弯垂，结果10～20串，约50～150个。植株结果后枯死，由根状茎长出的吸根继续繁殖，每一根株可活多年。原产亚洲东南部，台湾、海南、广东、广西等均有栽培。");
        sleep(3)
        system("clear")
    elif a=="双皮奶":
        b("双皮奶，是一种粤式甜品。清朝时起源自顺德，用水牛奶做原料。现遍布于广东、澳门、香港等地。");
        sleep(3)
        system("clear")
    elif a=="牦牛肉":
        b("牦牛肉是一道菜品，制作原料主要有牦牛臀尖肉、豆油等。牦牛肉质细嫩，味道鲜美。具有极高的营养价值极高。富含蛋白质和氨基酸，以及胡萝卜素、钙、磷等微量元素，脂肪含量特别低，热量特别高，对增强人体抗病力、细胞活力和器官功能均有显著作用。");
        sleep(3)#我是水印李承骏＆缪子航
        system("clear")
    elif a=="张国荣":
        b("张国荣（1956年9月12日-2003年4月1日），生于香港，中国香港男歌手、演员、音乐人；影视歌多栖发展的代表之一。1977年正式出道。1983年以《风继续吹》成名。1984年演唱的《Monica》是香港歌坛第一支同获十大中文金曲、十大劲歌金曲的舞曲。 1986年、1987年获劲歌金曲金奖；");
        sleep(3)
        system("clear")
    elif a=="豆汁":
        b("豆汁是老北京独具特色的传统小吃，根据文字记载有300年的历史。豆汁是以绿豆为原料，将淀粉滤出制作粉条等食品后的剩余残渣进行发酵产生的，具有养胃、解毒、清火的功效。豆汁儿历史悠久，据说早在辽宋时期就已在北京地区盛行，而豆汁成为宫廷饮料是清朝乾隆年间的事情。");
        sleep(3)
        system("clear")
    elif a=="北京烤鸭":
        b("是具有世界声誉的北京著名菜式，起源于中国南北朝时期，《食珍录》中已记有炙鸭，在当时是宫廷食品。用料为优质肉食鸭北京鸭，果木炭火烤制，色泽红润，肉质肥而不腻，外脆里嫩。北京烤鸭分为两大流派，而北京最著名的烤鸭店也即是两派的代表。它以色泽红艳，肉质细嫩，味道醇厚，肥而不腻的特色，被誉为“天下美味”。");
        sleep(3)
        system("clear")
    elif a=="老舍":
        b("老舍（1899年2月3日—1966年8月24日），原名舒庆春，字舍予，另有笔名絜青、鸿来、非我等。因为老舍生于阴历立春，父母为他取名“庆春”，大概含有庆贺春来、前景美好之意。上学后，自己更名为舒舍予，含有“舍弃自我”，亦即“忘我”的意思。北京满族正红旗人。   中国现代小说家、作家，语言大师、人民艺术家，新中国第一位获得“人民艺术家”称号的作家。代表作有《骆驼祥子》，《四世同堂》，剧本《茶馆》。老舍的一生，总是忘我地工作，他是文艺界当之无愧的“劳动模范”。1966年，由于受到文化大革命运动中恶毒的攻击和迫害，老舍被逼无奈之下含冤自沉于北京太平湖。  2017年9月，中国现代文学长篇小说经典《四世同堂》由东方出版中心出版上市。这是该作自发表以来第一次以完整版形式出版");
        sleep(3)
        system("clear")
    elif a=="故宫":
        b("京故宫是中国明清两代的皇家宫殿，旧称紫禁城，位于北京中轴线的中心，是中国古代宫廷建筑之精华。北京故宫以三大殿为中心，占地面积72万平方米，建筑面积约15万平方米，有大小宫殿七十多座，房屋九千余间。是世界上现存规模最大、保存最为完整的木质结构古建筑之一。北京故宫于明成祖永乐四年（1406年）开始建设，以南京故宫为蓝本营建，到永乐十八年（1420年）建成。它是一座长方形城池，南北长961米，东西宽753米，四面围有高10米的城墙，城外有宽52米的护城河。紫禁城内的建筑分为外朝和内廷两部分。外朝的中心为太和殿、中和殿、保和殿，统称三大殿，是国家举行大典礼的地方。内廷的中心是乾清宫、交泰殿、坤宁宫，统称后三宫，是皇帝和皇后居住的正宫。 北京故宫被誉为世界五大宫之首（法国凡尔赛宫、英国白金汉宫、美国白宫、俄罗斯克里姆林宫），是国家AAAAA级旅游景区， 1961年被列为第一批全国重点文物保护单位； 1987年被列为世界文化遗产。2012年1月至2018年6月，故宫累计接待观众达到1亿人次。2019年起，故宫将试行分时段售票 。2018年9月3日，故宫养心殿正式进入古建筑研究性保护修缮工作的实施阶段。  2019年3月4日，故宫公布了2019年下半年展览计划。");
        sleep(3)
        system("clear")
    elif a=="鹿晗":
        b("鹿晗（LU HAN），1990年4月20日出生于北京市海淀区，中国内地影视男演员、歌手。2008年，赴韩国留学期间在明洞逛街时，被韩国SM娱乐有限公司星探发掘成为旗下练习生。2012年4月以韩国男子组合EXO/EXO-M成员正式出道，组合内担任主唱、领舞、门面担当。2014年8月，个人微博单条评论创吉尼斯世界纪录，成为中文社交媒体上的首位吉尼斯世界纪录获得者。");
        sleep(3)
        system("clear")
    elif a=="王菲":
        b("王菲（Faye Wong），1969年8月8日出生于北京，中国流行乐女歌手、影视演员 、中国国家一级演员。1989年，凭借歌曲《仍是旧句子》在香港歌坛出道   ，同年发行首张个人专辑《王靖雯》 。1992年，因演唱歌曲《容易受伤的女人》而被听众所熟知。1993年，在专辑《十万个为什么？》 中尝试另类音乐的风格   。1994年，发行专辑《天空》，并获得十大劲歌金曲最受欢迎女歌星奖；同年在香港红磡体育馆举办18场“最精彩演唱会”，打破中国香港歌手初次开演唱会的场次纪录   。1996年，成为首位登上美国《时代周刊》封面的华人歌手  。1998年，因在央视春晚上演唱歌曲《相约1998》而在中国内地获得更多的关注；同年发行专辑《唱游》，通过运用颤音、拖音等技巧确立其个人风格 ，并于次年获得新加坡SPVA唱片畅销排行榜年度销量冠军 1999年，凭借歌曲《Eyes on Me》获得第41届日本唱片大奖亚洲音乐奖  ，同年在日本武道馆举行个人演唱会   。2002年获得吉尼斯世界纪录大全颁发的“唱片销量最高的粤语女歌手”证书。2003年主演喜剧电影《天下无双》。2004年，凭借专辑《将爱》获得第15届台湾金曲奖最佳国语女演唱人奖。2005年，在结束“菲比寻常巡回演唱会”后淡出乐坛 。2010年，复出乐坛并在央视春晚上演唱歌曲《传奇》，同年举办巡回演唱会 。2016年，发行歌曲《尘埃》  。2018年，第三次登上央视春晚  。演艺事业外，王菲热心公益慈善。2006年11月，成立嫣然基金会  。2012年5月，成为北京嫣然天使儿童医院的创始人之一");
        sleep(3)
        system("clear")
    elif a=="蔡明":
        b("蔡明，1961年10月21日出生于北京，著名表演艺术家，国家一级演员。1973年，被导演谢铁骊选中在影片《海霞》饰演童年海霞。1980年，参演电影《戴手铐的旅客》。1990年蔡明的第一个小品《普拉尼特的长发》与陈佩斯、朱时茂合演，在北京电视台亮相。1991年中央电视台春节联欢晚会上，蔡明与巩汉林合作表演了小品《陌生人》。  2000年，在电视剧《闲人马大姐》中饰演马大姐，获得《中国大众电视》老百姓最喜爱影视明星等荣誉称号。1991年至2017年，蔡明共计有26次登上央视春晚表演小品；2012年至2014年，蔡明已连续3次登上央视元宵晚会演唱歌曲。   2014年，蔡明担任《出彩中国人》评委，为实现中国梦的中华儿女摇旗呐喊。2018年2月，出演2018年央视春晚小品《学车》。");
        sleep(3)
        system("clear")
    elif a=="天安门":
        b("天安门，坐落在中华人民共和国首都北京市的中心、故宫的南端，与天安门广场以及人民英雄纪念碑、毛主席纪念堂、人民大会堂、中国国家博物馆隔长安街相望，占地面积4800平方米，以杰出的建筑艺术和特殊的政治地位为世人所瞩目。天安门是明清两代北京皇城的正门，始建于明朝永乐十五年（1417年），最初名“承天门”，寓“承天启运、受命于天”之意。设计者为明代御用建筑匠师蒯祥。清朝顺治八年（1651年）更名为天安门。由城台和城楼两部分组成，有汉白玉石的须弥座，总高34.7米。天安门城楼长66米、宽37米。城台下有券门五阙，中间的券门最大，位于北京皇城中轴线上，过去只有皇帝才可以由此出入。正中门洞上方悬挂着毛泽东画像，两边分别是“中华人民共和国万岁”和“世界人民大团结万岁”的大幅标语。 民国十四年（1925年）十月十日，故宫博物院成立，天安门开始对民众开放。1949年10月1日，在这里举行了中华人民共和国开国大典，由此被设计入国徽，并成为中华人民共和国的象征。1961年，中华人民共和国国务院公布为第一批全国重点文物保护单位之一。");
        sleep(3)
        system("clear")
    elif a=="北京大学":
        b("北京大学（Peking University），简称“北大”，由中华人民共和国教育部直属，位列“211工程”、“985工程”、“世界一流大学和一流学科”，入选“基础学科拔尖学生培养试验计划”、“高等学校创新能力提升计划”、“高等学校学科创新引智计划”，为九校联盟、松联盟、中国大学校长联谊会、京港大学联盟、亚洲大学联盟、东亚研究型大学协会、国际研究型大学联盟、环太平洋大学联盟、东亚四大学论坛、国际公立大学论坛、中俄综合性大学联盟成员。北京大学创立于1898年维新变法之际，初名京师大学堂，是中国近现代第一所国立综合性大学，创办之初也是国家最高教育行政机关 1912年改为国立北京大学。1937年南迁至长沙，与国立清华大学和私立南开大学组成国立长沙临时大学，1938年迁至昆明，更名为国立西南联合大学。1946年复员返回北平。1952年经全国高校院系调整，成为以文理基础学科为主的综合性大学，并自北京城内沙滩等地迁至现址。2000年与原北京医科大学合并，组建为新的北京大学。北京大学是新文化运动的中心和五四运动的策源地，最早在中国传播马克思主义和科学、民主思想，是创建中国共产党的重要基地之一。长期以来，北京大学始终与中国和中国人民共命运，与时代和社会同前进，是培养和造就高素质创造性人才的摇篮，恰如蔡元培先生所言：“大学者，囊括大典，网罗众家之学府也……此思想自由之通则，而大学之所以为大也。”");
        sleep(3)
        system("clear")
    elif a=="煎饼馃子":
        b("煎饼馃子是天津著名的小吃。天津人把其作为早点。由绿豆面薄饼，鸡蛋，还有馃子（油条）或者薄脆的“馃篦儿”组成，配以面酱，葱末，腐乳，辣椒酱（可选）作为佐料。2018年3月，天津市餐饮行业协会成立煎饼果子分会。");
        sleep(3)
        system("clear")
    elif a=="狗不理包子":
        b("狗不理包子（Go Believe/Goubuli steamed bun）是一道由面粉、猪肉等材料制作而成的小吃，始创于公元1858年（清朝咸丰年间）.至今有100多年历史的它为“天津三绝”之首，是中华老字号之一。狗不理包子的面、馅选料精细，制作工艺严格，外形美观，特别是包子褶花匀称，每个包子都不少于15个褶 刚出笼的包子，鲜而不腻，清香适口。 狗不理包子以鲜肉包为主，兼有三鲜包、海鲜包、酱肉包、素包子等6大类、98个品种。2011年11月，国务院公布了第三批国家级非物质文化遗产名录，“狗不理包子传统手工制作技艺”项目被列入其中。");
        sleep(3)
        system("clear")
    elif a=="腊汁肉夹馍":
        b("腊汁肉夹馍是陕西省的地方特色小吃之一。传统的陕西腊汁肉夹馍的制作方法包括卤汁腊肉的制作（选料与刀工、腌渍风干、卤肉）和白吉馍的制作。主要选用五花猪肉、面粉、高汤等原料加入各种香料和调味料加工而成。腊汁肉夹馍在2012年入选纪录片《舌尖上的中国》第二集《主食的故事》系列美食之一，口感肉香、馍脆、瓤松软。");
        sleep(3)
        system("clear")
    elif a=="羊肉泡馍":
        b("羊肉泡馍，亦称羊肉泡，古称“羊羹”，关中汉族风味美馔，源自陕西省渭南市固市镇。它烹制精细，料重味醇，肉烂汤浓，肥而不腻，营养丰富，香气四溢，诱人食欲，食后回味无穷。北宋著名诗人苏轼留有“陇馔有熊腊，秦烹唯羊羹”的诗句。因它暖胃耐饥，素为陕西人民所喜爱，外宾来陕也争先品尝，以饱口福。牛羊肉泡馍已成为陕西名吃的“总代表”。");
        sleep(3)
        system("clear")
    elif a=="biangbiang面":
        b("Biángbiáng面（汉语拼音：Biángbiáng miàn，biang字是一个合字，有多种写法，均无法输入电脑，常被代替写为BiángBiáng面、biángbiang面或彪彪面）是陕西关中特色传统风味面食，是传统的陕西裤带面。因为制作过程中有biang、biang的声音而得名。特指关中麦子磨成的面粉，通常手工拉成长宽厚的面条。由上等面粉精制而成，用酱油、醋、味精、花椒等佐料调入面汤，捞入面条，淋上烧热的植物油即成。");
        sleep(3)
        system("clear")
    elif a=="油泼面":
        b("油泼面是陕西传统的特色面食之一，起源于明代，并以咸阳油泼面最为著名，有鲜香味、酸辣味、香辣味。油泼面是一种很普通的面食制作方法，将手工制作的面条在开水中煮熟后捞在碗里，将葱花碎、花椒粉、盐等配料和厚厚一层的辣椒面一起平铺在面上，用烧的滚烫的菜油浇在调料上，顿时热油沸腾，将花椒面、辣椒面烫熟而满碗红光，随后调入适量酱油、香醋即可。也可另外加入腊汁肉、西红柿鸡蛋等搭配食用。");
        sleep(3)
        system("clear")
    elif a=="油泼辣子":
        b("油泼辣子是陕西著名的特色美食之一，也叫油辣子，它是将秦椒碾制的辣椒粉与花生芝麻等加香味的调料拌匀，然后用熟油泼入，再用农家醋一激，香味扑鼻，油泼辣子就做好了！陕西关中八大怪 ，油泼辣子一道菜，醮馍拌菜调干面，嘴巴一抹嫽得太。在陕西油泼辣子很受人们喜爱，岐山擀面皮，凤翔豆花泡馍以及西安最受欢迎的羊肉泡都离不开油泼辣子。");
        sleep(3)
        system("clear")	
	#分割——————#我是水印李承骏＆缪子航
    elif a=="胡辣汤":
        b("胡辣汤，也称糊辣汤，中原知名小吃，起源于河南省周口市西华县逍遥镇和漯河市舞阳县北舞渡镇。尤以逍遥镇胡辣汤出名。胡辣汤的主要制作材料有胡辣汤料、胡椒、辣椒、熟羊（牛）肉、羊骨高汤、面筋、面粉、粉条、黄花菜、花生、木耳等。是中国北方早餐中常见的传统汤类名吃。")
        sleep(2)
        system("clear")
    elif a=="大雁塔":
        b("大雁塔位于唐长安城晋昌坊（今陕西省西安市南）的大慈恩寺内，又名“慈恩寺塔”。唐永徽三年（652年），玄奘为保存由天竺经丝绸之路带回长安的经卷佛像主持修建了大雁塔，最初五层，后加盖至九层，再后层数和高度又有数次变更，最后固定为今天所看到的七层塔身，通高64.517米，底层边长25.5米。大雁塔作为现存最早、规模最大的唐代四方楼阁式砖塔，是佛塔这种古印度佛寺的建筑形式随佛教传入中原地区，并融入华夏文化的典型物证，是凝聚了中国古代劳动人民智慧结晶的标志性建筑。1961年3月4日，国务院公布大雁塔为第一批全国重点文物保护单位 。2014年6月22日，在卡塔尔多哈召开的联合国教科文组织第38届世界遗产委员会会议上，大雁塔作为中国、哈萨克斯坦和吉尔吉斯斯坦三国联合申遗的“丝绸之路：长安-天山廊道的路网”中的一处遗址点成功列入《世界遗产名录》。")
        sleep(2)
        system("clear")
    elif a=="西安城墙":
	    b("西安城墙又称西安明城墙，是中国现存规模最大、保存最完整的古代城垣  ，是第一批全国重点文物保护单位、国家AAAAA级旅游景区 。广义的西安城墙包括西安唐城墙和西安明城墙，但一般特指狭义上的西安明城墙。 西安明城墙位于陕西省西安市中心区，墙高12米，顶宽12—14米，底宽15—18米，轮廓呈封闭的长方形，周长13.74千米。城墙内人们习惯称为古城区，面积11.32平方千米，著名的西安钟鼓楼就位于古城区中心。 西安城墙主城门有四座：长乐门（东门），永宁门（南门），安定门（西门），安远门（北门），这四座城门也是古城墙的原有城门。从民国开始为方便出入古城区，先后新辟了多座城门，至今西安城墙已有城门18座。1961年03月04日，西安城墙被国务院公布为第一批全国重点文物保护单位。2018中国西北旅游营销大会暨旅游装备展上，西安城墙入围“神奇西北100景”榜单。")
	    sleep(2)
	    system("clear")
    elif a=="兵马俑":
	    b("兵马俑，即秦始皇兵马俑，亦简称秦兵马俑或秦俑，第一批全国重点文物保护单位，第一批中国世界遗产，位于今陕西省西安市临潼区秦始皇陵以东1.5千米处的兵马俑坑内。兵马俑是古代墓葬雕塑的一个类别。古代实行人殉，奴隶是奴隶主生前的附属品，奴隶主死后奴隶要作为殉葬品为奴隶主陪葬。兵马俑即制成兵马（战车、战马、士兵）形状的殉葬品。 1961年3月4日，秦始皇陵被国务院公布为第一批全国重点文物保护单位。1974年3月，兵马俑被发现。1987年，秦始皇陵及兵马俑坑被联合国教科文组织批准列入《世界遗产名录》，并被誉为“世界第八大奇迹” ，先后有200多位外国元首和政府首脑参观访问，成为中国古代辉煌文明的一张金字名片，被誉为世界十大古墓稀世珍宝之一。");
	    sleep(2)
	    system("clear")
    elif a=="华山":
	    b("华山（Mount Hua）古称“西岳”，雅称“太华山”，为中国著名的五岳之一，中华文明的发祥地，“中华”和“华夏”之“华”，就源于华山。位于陕西省渭南市华阴市，在省会西安以东120千米处。南接秦岭，北瞰黄渭，自古以来就有“奇险天下第一山”的说法。华山是第一批国家重点风景名胜区，国家AAAAA级旅游景区，全国重点文物保护单位，国家地质公园。华山是中华民族的圣山。中华之“华”，源于华山，由此，华山有了“华夏之根”之称 。这一成果首先被孙中山所引用，创立“中华民国”。据清代国学大师章太炎和历代专家学者考证：华夏民族最初形成并居住于“华山之周”，名其国土曰华，其后人迹所至，遍及九州，华之名始广。 华山是道教主流全真派圣地，为“第四洞天”，也是中国民间广泛崇奉的神祇，即西岳华山君神。共有72个半悬空洞，道观20余座，其中玉泉院、都龙庙、东道院、镇岳宫被列为全国重点道教宫观，有陈抟、郝大通、贺元希等著名的道教高人。1982年，华山被国务院颁布为首批国家级风景名胜区；1991年，华山被国家旅游局评为四十佳旅游胜地之一；1999年，华山被中央文明委、建设部、国家旅游局命名为全国文明风景旅游区示范点；2004年，华山被评为中华十大名山； 2011年，华山被国家旅游局评为国家AAAAA级旅游景区；2017年6月29日，华山荣膺“2017中国最受欢迎旅游景区”殊荣，华山是神州九大观日处之一，观日处位于华山东峰（亦称朝阳峰），朝阳台为最佳地点。“中国黄河50景”之一。")
	    sleep(2)
	    system("clear")
    elif a=="壶口瀑布":
	    b("壶口瀑布是国家级风景名胜区，国家AAAA级旅游景区。西临陕西省延安市宜川县壶口乡，东濒山西省临汾市吉县壶口镇，为两省共有旅游景区。南距陕西西安350千米；北距山西太原387千米。壶口瀑布是中国第二大瀑布，世界上最大的黄色瀑布。黄河奔流至此，两岸石壁峭立，河口收束狭如壶口，故名壶口瀑布。瀑布上游黄河水面宽300米，在不到500米长距离内，被压缩到20－30米的宽度。1000立方米/秒的河水，从20多米高的陡崖上倾注而泻，形成”千里黄河一壶收”的气概。2013年12月，“宜川县黄河壶口水利风景区”被中华人民共和国水利部水利风景区建设与管理领导小组评为“第十三批国家水利风景区”之一。国家黄河壶口水利风景区荣誉的授予，成为壶口景区继国家地质公园和地质遗迹保护区、国家重点风景名胜区、国家4A级景区之后第四张国家级名片，为延安市唯一国家水利风景名胜区。2018中国黄河旅游大会上被评为“中国黄河50景”。 2018年9月29日，山西黄河壶口文化旅游发展有限公司发布紧急通知，通知称“接黄委会通知，国庆节期间，山西黄河壶口瀑布景区将保持比较高的水位，不具备开放条件。为确保安全，国庆节期间景区暂时关闭。")
	    sleep(2)
	    system("clear")
    elif a=="丝绸之路":
	    b("丝绸之路，简称丝路，一般指陆上丝绸之路，广义上讲又分为陆上丝绸之路和海上丝绸之路。陆上丝绸之路起源于西汉（前202年—8年）汉武帝派张骞出使西域开辟的以首都长安（今西安）为起点，经甘肃、新疆，到中亚、西亚，并连接地中海各国的陆上通道。它的最初作用是运输中国古代出产的丝绸。1877年，德国地质地理学家李希霍芬在其著作《中国》一书中，把“从公元前114年至公元127年间，中国与中亚、中国与印度间以丝绸贸易为媒介的这条西域交通道路”命名为“丝绸之路”，这一名词很快被学术界和大众所接受，并正式运用。“海上丝绸之路”是古代中国与外国交通贸易和文化交往的海上通道，该路主要以南海为中心，所以又称南海丝绸之路。海上丝绸之路形成于秦汉时期，发展于三国至隋朝时期，繁荣于唐宋时期，转变于明清时期，是已知的最为古老的海上航线。2014年6月22日，中、哈、吉三国联合申报的陆上丝绸之路的东段“丝绸之路：长安-天山廊道的路网”成功申报为世界文化遗产，成为首例跨国合作而成功申遗的项目。 2013年9月，中国国家主席习近平提出建设“新丝绸之路经济带”战略构想。2015年3月28日，国家发展改革委、外交部、商务部联合发布了《推动共建丝绸之路经济带和21世纪海上丝绸之路的愿景与行动》。")
	    sleep(2)
	    system("clear")
    elif a=="锅盔":
	    b("锅盔(英文：guokui)，又叫锅魁、干馍，是陕西省关中地区以及甘肃省武威地区城乡居民喜食的地方传统风味面食小吃。饼大直径二尺外，又圆又厚像锅盖。锅盔源于外婆给外孙贺弥月赠送礼品，后发展成为风味方便食品。料取麦面精粉，压秆和面，浅锅慢火烘烤。省外人编成的顺口溜“陕西十大怪”中，有一怪为“烙馍像锅盖”，指的就是锅盔。关中较为著名的有乾州锅盔、泾阳锅盔.武功县锅盔、长武县锅盔、岐山县锅盔，扶风县锅盔，凤翔县锅盔，西和锅盔。")
	    sleep(2)
	    system("clear")
    elif a=="臊子面":
	    b("臊（sào）子面是中国陕西省特色传统面食、著名西府小吃，以宝鸡的岐山臊子面最为正宗。在陕西关中平原及甘肃陇东等地方流行。臊子面历史悠久，其中含有配菜比如豆腐，鸡蛋等，做法简单。臊子就是肉丁的意思。对于陕西人来说，臊子面的配色尤为重要，黄色的鸡蛋皮、黑色的木耳、红色的胡萝卜、绿色的蒜苗、白色的豆腐等材料，既好看又好吃。")
	    sleep(2)
	    system("clear")
    elif a=="西安钟楼":
	    b("西安钟楼位于西安市中心，明城墙内东西南北四条大街的交汇处，是中国现存钟楼中形制最大、保存最完整的一座。建于明太祖洪武十七年（1384年），初建于今广济街口，与鼓楼相对，明神宗万历十年（1582年）整体迁移于今址。钟楼建在方型基座之上，为砖木结构，重楼三层檐，四角攒顶的形式，总高36米，占地面积1377平方米。1956年8月6日，陕西省人民委员会公布钟楼为省级文物保护单位。1996年11月20日，西安钟楼被国务院公布为全国重点文物保护单位。")
	    sleep(2)
	    system("clear")
    elif a=="擀面皮":
	    b("擀面皮是陕西关中地区特有的传统名小吃，尤以西府宝鸡地区为最佳，宝鸡岐山擀面皮2011年被认定为中华名小吃。擀面皮是从唐代冷淘面演变而来。具有筋斗、柔软、凉香、酸辣可口的特点，是关中西府小吃代表之一，也是陕西最具代表的小吃之一。岐山人的擀面皮做法很非凡，别处的米面皮和酿皮是把面调成糊状，放在特制的铁笼上蒸。而歧山擀面皮则是先擀成面，然后再蒸，蒸熟后再切成比凉皮稍宽的条状，吃法和米面皮基本一样，不同于米面皮的是，擀面皮口感较硬，韧度高，有筋性。宝鸡一带的人都喜欢吃，近几年来在西安也很流行。")
	    sleep(2)
	    system("clear")
    elif a=="西安凉皮":
	    b("西安凉皮是一种特色小吃面食。西安市面上的凉皮大概分三种：岐山擀面皮、汉中热面皮和秦镇米面凉皮。其中以岐山擀面皮最受欢迎。因为擀面皮是从唐代冷淘面演变而来，其面皮选料精良，工艺严谨，调味讲究，以“白、薄、光、软、筋、香”而闻名，凉爽可口，具有筋斗、柔软、凉香、酸辣可口、四季皆宜之特点。在古代，擀面皮乃是给宫里的御供食品，故西府人又称擀面皮为“御京粉”。")
	    sleep(2)
	    system("clear")
    elif a=="拉条子":
	    b("拉条子就是新疆拌面的俗称。制作时不用擀、压的方法而直接用手拉制成，加入了各种蔬菜和牛羊肉，是包括新疆以及西北各省各族群众都喜欢的一种大众面食，驰名中外，深受各国人民喜爱。")
	    sleep(2)
	    system("clear")
    elif a=="长安大学":
	    b("长安大学（Chang’an University）座落于古都西安，直属中华人民共和国教育部，是教育部和交通运输部、国土资源部、住房和城乡建设部、陕西省人民政府共建的国家“211工程”重点建设大学，国家“985工程优势学科创新平台”建设高校，国家世界一流学科建设高校。入选国家“111计划”、教育部“卓越工程师教育培养计划”、“国家建设高水平大学公派研究生项目”、”国家级大学生创新创业训练计划“、”国家级新工科研究与实践项目“。是高水平行业特色大学优质资源共享联盟、中俄交通大学联盟成员高校，是中国最早承担援外教育和和首批招收港、澳、台学生的高校之一，是中国政府奖学金来华留学生接收院校、国家大学生文化素质教育基地、中国人民武装警察部队后备警官选拔培训基地、首批高等学校科技成果转化和技术转移基地，拥有世界唯一的高校汽车综合试验场。2000年由始建于二十世纪50年代初的原西安公路交通大学、西安工程学院、西北建筑工程学院合并组建而成。据2019年2月学校官网显示，学校有校本部和渭水2个校区、太白山和梁山2个教学实习基地，校园面积3745亩。下设21个教学院（系）、77个本科专业；8个博士后科研流动站，9个一级学科博士点，34个一级学科硕士点，10个硕士专业学位授权类别，16个工程硕士授权领域；专任教师2027人，其中，中国工程院院士3人，长江学者6人；全日制学生33000余人，其中博士研究生、硕士研究生、外国留学生9000余人。") 
	    sleep(2)
	    system("clear")
    elif a=="凉皮":
	    b("凉皮，起源于陕西关中地区的汉族传统美食，是擀面皮、面皮、米皮、酿皮的统称。流行于中国北方地区。是不可多得的天然绿色无公害食品。因原料、制作方法、地域不同，有热米（面）皮、擀面皮、烙面皮、酿皮等。口味有麻辣，酸甜，香辣等各种口味。 凉皮历史悠久，据说源于秦始皇时期，距今已有两千多年历史。")
	    sleep(2)
	    system("clear")
    elif a == "电脑":
        b("计算机（computer）俗称电脑，是现代一种用于高速计算的电子计算机器，可以进行数值计算，又可以进行逻辑计算，还具有存储记忆功能。是能够按照程序运行，自动、高速处理海量数据的现代化智能电子设备。由硬件系统和软件系统所组成，没有安装任何软件的计算机称为裸机。可分为超级计算机、工业控制计算机、网络计算机、个人计算机、嵌入式计算机五类，较先进的计算机有生物计算机、光子计算机、量子计算机等。计算机发明者约翰·冯·诺依曼。计算机是20世纪最先进的科学技术发明之一，对人类的生产活动和社会活动产生了极其重要的影响，并以强大的生命力飞速发展。它的应用领域从最初的军事科研应用扩展到社会的各个领域，已形成了规模巨大的计算机产业，带动了全球范围的技术进步，由此引发了深刻的社会变革，计算机已遍及一般学校、企事业单位，进入寻常百姓家，成为信息社会中必不可少的工具。计算机的应用在中国越来越普遍，改革开放以后，中国计算机用户的数量不断攀升，应用水平不断提高，特别是互联网、通信、多媒体等领域的应用取得了不错的成绩。1996年至2009 年，计算机用户数量从原来的630万增长至6710 万台，联网计算机台数由原来的2.9万台上升至5940万台。互联网用户已经达到3.16 亿，无线互联网有6.7 亿移动用户，其中手机上网用户达1.17 亿，为全球第一位。")
        sleep(3)
        system("clear")
    elif a == "钱包":
        b("钱包分为传统的实体物品装钱的包包和虚拟的电子钱包。")
        sleep(3)
        system("clear")
    elif a=="黄河":
	    b("黄河，中国北部大河，全长约5464公里，流域面积约752443平方公里。世界长河之一，中国第二长河。黄河北源发源于青海省青藏高原的巴颜喀拉山脉支脉查哈西拉山南麓的扎曲，南源发源于巴颜喀拉山支脉各姿各雅山北麓的卡日曲，西源发源于星宿海西的约古宗列曲。呈“几”字形，自西向东分别流经青海、四川、甘肃、宁夏、内蒙古、陕西、山西、河南及山东9个省（自治区），最后流入渤海。黄河中上游以山地为主，中下游以平原、丘陵为主。由于河流中段流经中国黄土高原地区，因此夹带了大量的泥沙，所以它也被称为世界上含沙量最多的河流。但是在中国历史上，黄河下游的改道给人类文明带来了巨大的影响。黄河是中华文明最主要的发源地，中国人称其为“母亲河”。每年都会生产十六亿吨泥沙，其中有十二亿吨流入大海，剩下四亿吨长年留在黄河下游，形成冲积平原，有利于种植。")
	    sleep(2)
	    system("clear")
    elif a=="油泼面":
	    b("油泼面是陕西传统的特色面食之一，起源于明代，并以咸阳油泼面最为著名，有鲜香味、酸辣味、香辣味。油泼面是一种很普通的面食制作方法，将手工制作的面条在开水中煮熟后捞在碗里，将葱花碎、花椒粉、盐等配料和厚厚一层的辣椒面一起平铺在面上，用烧的滚烫的菜油浇在调料上，顿时热油沸腾，将花椒面、辣椒面烫熟而满碗红光，随后调入适量酱油、香醋即可。也可另外加入腊汁肉、西红柿鸡蛋等搭配食用。");
	    sleep(2)
	    system("clear")#我是水印李承骏＆缪子航
    elif a=="冰峰":
        b("冰峰是一款汽水的名字，“冰峰汽水”饮料诞生于1953年。冰峰汽水的生产商为西安市食品厂，冰峰是该厂的其中一个生产车间，厂里人称为“汽水车间”。“冰峰”在西安可谓无人不知、无人不晓，在西安已经有了66年历史。在世界级饮料品牌的强势夹攻下，冰峰顽强地生存下来，而且越战越猛。“冰峰”是一种甜甜的桔子味汽水，玻璃瓶包装，每瓶200ml，冰峰饮料一直备受西安市民的喜爱，多年来除了玻璃瓶的朴素包装没有变过外，橘子的口味也一点没变。2012年，易拉罐版的冰峰饮料已于4月30日面市，包装从200ml玻璃瓶变为330ml易拉罐。")
        sleep(2)
        system("clear")
    elif a=="柳巷面":
	    b("柳巷面是陕西西安著名面类小吃。。柳巷面原先是从一条叫做“柳巷”的小巷起家的，后来因为城市改造不得不一次又一次地搬迁，现在更退到案板街一条特隐蔽的小巷内。但喜欢柳巷面的食客们总能将它从城市角落里挖出来，义无反顾地加入店内拥挤而壮观的吃面队伍中。")
	    sleep(2)
	    system("clear")
    elif a=="西安咸阳国际机场":
	    b("西安咸阳国际机场（Xi'an Xianyang International Airport，IATA：XIY，ICAO：ZLXY），位于中国陕西省西安市西北方向的咸阳市渭城区，距西安市区25公里，为4F级民用国际机场，是中国八大区域枢纽机场之一、国际定期航班机场、世界前百位主要机场。2014年6月成为西北第一个、中国第八个实行72小时过境免签政策的航空口岸。 西安咸阳国际机场于1991年9月1日正式建成通航；2003年9月16日完成二期工程建设，西安咸阳国际机场T2航站楼启用；2012年5月3日完成二期扩建工程，西安咸阳国际机场T3航站楼开始使用 ；在“十三五”期间，西安咸阳国际机场将启动三期扩建工程。根据2017年9月信息显示，西安咸阳国际机场拥有三座航站楼，分别为T1航站楼、T2（国内）航站楼和T3（国内及国际）航站楼，共35万平方米；共有两条跑道，跑道长度分别为3000米、3800米；停机机位127个、登机桥44个、货运区2.5万平方米；可保障高峰小时旅客吞吐量1万人次、年旅客吞吐量5000万人次、货邮吞吐量40万吨的运行需要； 咸阳机场与国内外62家航空公司建立了航空业务往来，通航城市达171个，开通国内外航线313条。2016年，西安咸阳国际机场旅客吞吐量3699.45万人次，同比增长12.2%；货邮吞吐量23.37万吨，同比增长10.5%；起降架次29.1万架次，同比增长9.0%；分别位居中国第8、第14、第7位。2019年5月12日凌晨，陕西首条第五航权航线首尔-西安-河内于成功首航。")
	    sleep(2)
	    system("clear")
    elif a=="秦镇米皮":
	    b("秦镇米皮，用大米磨浆蒸成。陕西省著名的传统小吃。相传，秦始皇在位时，有一年陕西关中一带大旱，沣河缺水，稻谷枯萎，农民只好在田里挖井浇地，好不容易打下的粮食尽是稗秕。碾出的大米质量太差，百姓无法向朝廷纳供大米，有个叫李十二的用大米碾成米粉，蒸出米皮，献给秦始皇，秦始皇吃后大喜，命秦镇每年的贡品只献米皮，这样就形成了久负盛名的美食。")
	    sleep(2)
	    system("clear")
    elif a=="油泼驴蹄面":
	    b("“驴蹄子”是陕西西安周边郊县的一种汉族风味面食， 为什么叫“驴蹄子”呢，据说是他形似驴蹄子，吃上的口感筋道，有“驴”的一身倔劲儿。这个“驴蹄子”面是农村人干活回家晚了，来不及擀面的一种“偷懒的”方法，只需不到半个小时 就能吃上美味的面条，方法非常简单，一学就会。")
	    sleep(2)
	    system("clear")
    elif a=="浆水鱼鱼":
        b("是一道著名的陕西传统小吃。浆水鱼鱼曰鱼，其实并不似鱼，酷如蝌蚪。陕西话叫“蛤蟆骨斗”，即小蝌蚪。浆水鱼鱼一般有2种：玉米面和一般淀粉，可热吃也可凉吃，味道十分鲜美。夏季特别适宜，可缓解夏季的烦躁酸辣爽口是夏季提升食欲的佳品。")
        sleep(2)
        system("clear")
    elif a=="荞面饸饹":
        b("荞面饸饹是一道以荞面、羊肉、土豆、香菜等为主要食材制作的美食。是陕西省著名的传统面食小吃。被誉为北方面食三绝之一，与兰州拉面、山西刀削面齐名。")
        sleep(2)
        system("clear")
    elif a=="西安事变":
        b("西安事变，又称“双十二事变”。1936年12月12日张学良和杨虎城为了达到劝谏蒋介石改变“攘外必先安内”的既定国策，停止内战，一致抗日的目的，在西安发动“兵谏”。1936年12月25日，在中共中央和周恩来主导下，以蒋介石接受“停止内战，联共抗日”的主张而和平解决。西安事变的和平解决为抗日民族统一战线的建立准备了必要的前提，成为由国内战争走向抗日民族战争的转折点。")
        sleep(2)
        system("clear")
    elif a=="杨幂":
        b("杨幂，1986年9月12日出生于北京市，中国内地影视女演员、流行乐歌手、影视制片人。2005年，杨幂进入北京电影学院表演系本科班就读。2006年，杨幂因出演金庸武侠剧《神雕侠侣》而崭露头角。2008年，她凭借古装剧《王昭君》获得了第24届中国电视金鹰奖观众喜爱的电视剧女演员奖提名。2009年，杨幂在“80后新生代娱乐大明星”评选活动中与其她三位女演员共同被评为“四小花旦”。")
        sleep(2)
        system("clear")
    elif a=="北京电影学院":
        b("京电影学院（Beijing Film Academy），是北京市人民政府、国家新闻出版广电总局和中华人民共和国教育部重点支持建设的艺术高校，中国政府奖学金来华留学生接收院校，国际电影电视高等院校联合会（CILECT）理事学校和亚太地区电影年会执行主席，首家主持国家“863”项目的艺术院校，教育部本科教学工作水平评估优秀学校，北京市留学生教学管理先进单位，2018中国科幻大会优秀组织单位，是国家动画教育研究基地、北京影视艺术研究基地和中国儿童电影研究中心的挂牌单位，是亚洲电影学术交流的中心，被誉为“中国电影人才的摇篮”。北京电影学院的前身是1950年创建的中央电影局表演艺术研究所。该所1951年更名为中央文化部电影局电影学校，1953年更名为北京电影学校，1956年改制为北京电影学院。据2019年2月学校官网信息显示，北京电影学院占地主校区达105亩；怀柔校区（在建）占地面积667亩，总投资约28亿元，首期工程预计将于2019年投入使用。全日制在校学历生近3000余人，成人教育本专科生、留学生、在职研究生和研究生课程班、进修及培训生3000人左右。有教职工527人，其中专任教师287人。下辖19个教学实施单位，涵盖了电影创作的每一个行当，囊括了电影创作的全部环节，是唯一能独立进行故事片创作的院校。开办19个本科专业，具有3个一级学科博士学位授权点、3个一级学科硕士学位授权点、2个硕士专业学位授权类别。")
        sleep(2)
        system("clear")
    elif a=="老北京涮羊肉":
        b("老北京涮羊肉，正宗老北京火锅的风味，传承老北京涮羊肉的特点，采用铜锅炭火，羊肉讲究肉质细且无膻味，鲜嫩无比，其他食材新鲜。经济实惠，味道独特，细致周到的服务，为每一位顾客奉献出纯正的传统火锅。")
        sleep(2)
        system("clear")
    elif a=="天安门":
        b("天安门，坐落在中华人民共和国首都北京市的中心、故宫的南端，与天安门广场以及人民英雄纪念碑、毛主席纪念堂、人民大会堂、中国国家博物馆隔长安街相望，占地面积4800平方米，以杰出的建筑艺术和特殊的政治地位为世人所瞩目。天安门是明清两代北京皇城的正门，始建于明朝永乐十五年（1417年），最初名“承天门”，寓“承天启运、受命于天”之意。设计者为明代御用建筑匠师蒯祥。清朝顺治八年（1651年）更名为天安门。由城台和城楼两部分组成，有汉白玉石的须弥座，总高34.7米。天安门城楼长66米、宽37米。城台下有券门五阙，中间的券门最大，位于北京皇城中轴线上，过去只有皇帝才可以由此出入。正中门洞上方悬挂着毛泽东画像，两边分别是“中华人民共和国万岁”和“世界人民大团结万岁”的大幅标语。民国十四年（1925年）十月十日，故宫博物院成立，天安门开始对民众开放。1949年10月1日，在这里举行了中华人民共和国开国大典，由此被设计入国徽，并成为中华人民共和国的象征。1961年，中华人民共和国国务院公布为第一批全国重点文物保护单位之一。")
        sleep(2)
        system("clear")
    elif a=="老北京炸酱面":
        b("老北京炸酱面，一道传统的中式面食，由菜码、炸酱拌面条而成，流行于北京 、河北，天津等地。")
        sleep(2)
        system("clear")
    elif a=="长城":
        b("八达岭长城，位于北京市延庆区军都山关沟古道北口。是中国古代伟大的防御工程万里长城的重要组成部分，是明长城的一个隘口。八达岭长城为居庸关的重要前哨，古称“居庸之险不在关而在八达岭”。明长城的八达岭段被称作“玉关天堑”，为明代居庸关八景之一。八达岭长城是明长城向游人开放最早的地段，八达岭景区以八达岭长城为主，兴建了八达岭饭店和由江泽民主席亲笔题名的中国长城博物馆等功能齐全的现代化旅游服务设施。八达岭景区是全国文明风景旅游区示范点，以其宏伟的景观、完善的设施和深厚的文化历史内涵而著称于世，是举世闻名的旅游胜地。2016年7月29日开始，八达岭长城向现役军人、残疾军人免收门票。2019年6月1日起，八达岭长城景区开始实施全网络实名制预约售票，并试行单日游客总量控制，每日最大流量为6.5万人次。提前7天预约购票，扫码购票只需1分钟，持身份证入园更快捷。2019年7月，八达岭特区办事处正式接管了原由八达岭旅游总公司管理的八达岭长城水关段和古长城段，水关长城和古长城将与八达岭长城一起由八达岭特区办事处统一管理。水关长城为八达岭长城的东段，古长城为八达岭长城的西大门，同属于八达岭长城军事防御体系，极大丰富历史原貌、水门制敌、考古遗址、自然生态等文化价值。")
        sleep(2)
        system("clear")
    elif a=="豌豆黄":
        b("豌豆黄，也称为豌豆黄儿，是北京传统小吃，也是北京春季的一种应时佳品。制作时通常将豌豆磨碎、去皮、洗净、煮烂、糖炒、凝结、切块而成。成品后，外观呈浅黄色，味道香甜，清凉爽口。清宫的豌豆黄，用上等白豌豆为原料做成，因慈禧喜食而出名；民间的糙豌豆黄儿是典型的春令食品，常见于春季庙会上。")
        sleep(2)
        system("clear")
    elif a=="驴打滚":
        b("驴打滚，是东北地区、老北京和天津卫传统小吃之一，成品黄、白、红三色分明，煞是好看。因其最后制作工序中撒上的黄豆面，犹如老北京郊外野驴撒欢打滚时扬起的阵阵黄土，因此而得名“驴打滚”。“驴打滚”的原料有大黄米面、黄豆面、澄沙、白糖、香油、桂花、青红丝和瓜仁。它的制作分为制坯、和馅、成型三道工序。做好的“驴打滚”外层粘满豆面，呈金黄色，豆香馅甜，入口绵软，别具风味，豆馅入口即化，香甜入心，黄豆面入嘴后可以不嚼，细细品，是老少皆宜的传统风味小吃。")
        sleep(2)
        system("clear")
    elif a=="胡同":
        b("胡同，也叫“里弄（lòng）”“巷弄”“巷”，是指城镇或乡村里主要街道之间的、比较小的街道，一直通向居民区的内部。它是沟通当地交通不可或缺的一部分。根据道路通达情况，胡同分为死胡同和活胡同。前者只有一个开口，末端深入居民区，并且在其内部中断；而后者则沟通两条或者更多的主干街道。胡同，是北京，苏州的一大特色。但苏州称为“巷弄”。")
        sleep(2)
        system("clear")
    elif a=="四合院":
        b("四合院，又称四合房，是中国的一种传统合院式建筑，其格局为一个院子四面建有房屋，从四面将庭院合围在中间，故名四合院。四合院就是三合院前面又加门房的屋舍来封闭。若呈“口”字形的称为一进院落；“日”字形的称为二进院落；“目”字形的称为三进院落。一般而言，大宅院中，第一进为门屋，第二进是厅堂，第三进或后进为私室或闺房，是妇女或眷属的活动空间，一般人不得随意进入，难怪古人有诗云：“庭院深深深几许”。庭院越深，越不得窥其堂奥。四合院至少有3000多年的历史，在中国各地有多种类型，其中以北京四合院为典型。四合院通常为大家庭所居住，提供了对外界比较隐秘的庭院空间，其建筑和格局体现了中国传统的尊卑等级思想以及阴阳五行学说。在现代，随着家庭结构和社会观念的变迁，传统四合院的宜居性受到了挑战。而在城市规划过程中，传统四合院也面临着保护和发展的矛盾，一些四合院被列为文物保护单位，同时也有一些被拆除。")
        sleep(2)
        system("clear")#我是水印李承骏＆缪子航
    elif a=="王府井":
        b("王府井大街（Wangfujing Street）位于北京市东城区，街道全长1818米，从南至北共分为4段，东长安街至东单三条段，长度为280米；东单三条至金鱼胡同段，长度为548米；金鱼胡同至灯市口大街段，长度为344米；灯市口大街至五四大街段，长度为646米。其中，东单三条至金鱼胡同段是北京知名的商业步行街“王府井步行街” 王府井大街是一条具有数百年悠久历史的商业街，在北京享有“金街”美誉")
        sleep(2)
        system("clear")
    elif a=="芸豆卷":
        b("芸豆卷是北京地区特色传统名点，主要用芸豆豆沙制作而成。其色泽雪白，质地柔软细腻，馅料香甜爽口，是慈禧的御前御点。")#;//shuiyin,缪子航
        sleep(2)
        system("clear")
    elif a=="天坛公园":
        b("天坛，在北京市南部，东城区永定门内大街东侧。占地约273万平方米。天坛始建于明永乐十八年（1420年），清乾隆、光绪时曾重修改建。为明、清两代帝王祭祀皇天、祈五谷丰登之场所。天坛是圜丘、祈谷两坛的总称，有坛墙两重，形成内外坛，坛墙南方北圆，象征天圆地方。主要建筑在内坛，圜丘坛在南、祈谷坛在北，二坛同在一条南北轴线上，中间有墙相隔。圜丘坛内主要建筑有圜丘坛、皇穹宇等等，祈谷坛内主要建筑有祈年殿、皇乾殿、祈年门等。2018年7月12日消息，天坛公园将再增加2.24公顷开放面积。 2018年9月，下调公园每日最大承载量，5.8万人调至5万人。 ")
        sleep(2)
        system("clear")
    elif a=="爆肚":
        b("爆肚是天津和北京风味小吃中著名的传统小吃，多为回族同胞经营。爆肚早在清乾隆年代就有记载，北京的清真餐馆和摊贩就经营爆肚。北京天桥有“爆肚石”，门框胡同有“爆肚杨”，还有“爆肚冯”、“爆肚满”等最为出名。有羊爆肚和牛爆肚，牛爆肚分牛百叶和牛肚仁，羊爆肚分9种，羊散丹、羊肚领、阳面肚板、阴面肚板、蘑菇、蘑菇尖儿、食信儿、葫芦、大草牙。爆肚王一般只做5种大众易于接受的品种：牛百叶、牛肚仁、羊散丹、羊肚领、羊肚板（阳面肚板）。爆肚是把鲜牛肚（指牛百叶和肚领）或鲜羊肚洗净整理后，切成条块状，用沸水爆熟，蘸油、芝麻酱、醋、辣椒油、酱豆腐汤、香菜末、葱花等拌制的调料吃，质地鲜嫩，口味香脆。梅兰芳、马连良、小蘑菇、小白玉霜、李万春等名流无不喜食。爆肚又脆又鲜，不油不腻，据说还可治胃病。吃爆肚的人如会喝酒，总要喝二两，喝完酒，吃两个刚出炉的烧饼，确实是一大快事。所以老北京都喜欢吃爆肚，特别是农历立秋之后，北京人讲究“吃秋”，就有“要吃秋，有爆肚”之说。")
        sleep(2)
        system("clear")
    elif a=="爱新觉罗·弘历":
        b("清高宗爱新觉罗·弘历（1711年9月25日—1799年2月7日），清朝第六位皇帝，定都北京之后的第四位皇帝。年号“乾隆”，寓意“天道昌隆”。在位六十年，禅位后又继续训政，实际行使最高权力长达六十三年零四个月，是中国历史上实际执掌国家最高权力时间最长的皇帝，也是最长寿的皇帝。乾隆帝是中国封建社会一位赫赫有名的皇帝。乾隆帝在位期间清朝达到了康乾盛世以来的最高峰，他在康熙、雍正两朝文治武功的基础上，进一步完成了多民族国家的统一，社会经济文化有了进一步发展。乾隆重视社会的稳定，关心百姓，五次普免天下钱粮，三免八省漕粮，减轻了农民的负担，起到了保护农业生产的作用，使得清朝国库日渐充实。乾隆时期武功繁盛，在平定边疆地区叛乱方面做出了巨大成绩，并且完善了对西藏的统治，正式将新疆纳入中国版图，清朝的版图由此达到了最大化，近代中国的版图也由此正式奠定。乾隆帝在位期间，实行“因俗而治”的民族政策。汉学得到了很大的发展，开博学鸿词科，修《四库全书》；同时民间艺术有很大发展，如京剧就开始形成于乾隆年间。但是后期吏治有所败坏，多地爆发起义。  严格抵制英国、俄国的侵略性行为，但闭关锁国政策拉大了和西方的差距，中国正处于近代的前夜。乾隆六十年（1795年），乾隆帝禅位于第十五子颙琰。嘉庆四年正月初三（1799年2月7日）卒于养心殿，享年89岁。 庙号高宗，谥号法天隆运至诚先觉体元立极敷文奋武钦明孝慈神圣纯皇帝，葬于清东陵之裕陵。")
        sleep(2)
        system("clear")
    elif a=="北京交通大学":
        b("北京交通大学（Beijing Jiaotong University）是中华人民共和国教育部直属的全国重点大学，由教育部、交通运输部、北京市人民政府、中国国家铁路集团有限公司共建的高校，位列“211工程”、“985工程优势学科创新平台”、“世界一流学科建设高校”，入选“高等学校创新能力提升计划”、“高等学校学科创新引智计划”、“卓越工程师教育培养计划”、“国家建设高水平大学公派研究生项目“、“新工科研究与实践项目”、”中国政府奖学金来华留学生接收院校”，是北京高科大学联盟、中俄交通大学联盟成员高校。北京交通大学作为交通大学的三个源头之一，历史渊源可追溯到1896年，前身是清政府创办的北京铁路管理传习所，是中国第一所专门培养管理人才的高等学校，是中国近代铁路管理、电信教育的发祥地；1921年参与合并组建交通大学；1923年更名为北京交通大学；1970年恢复使用“北方交通大学”校名；2003年恢复使用“北京交通大学”校名。截至2017年8月，学校建有东西两个校区和威海校区，总面积1032443.37平方米，共拥有教学、科研仪器设备资产12.8亿元；学校设有14个学院，研究生院以及远程与继续教育学院；学校设有59个本科专业，15个博士后科研流动站，21个一级学科博士点，33个一级学科硕士点；全日制在校生25569人，教职工2992人，其中专任教师1878人；学校形成了以信息、管理等学科为优势，以交通科学与技术为特色，工、管、经、理、文、法、哲等多学科协调发展的完备的学科培养体系。")
        sleep(2)
        system("clear")
    elif a=="北海公园":
        b("北海公园(Beihai Park)，位于北京市中心区，城内景山西侧，在故宫的西北面，与中海、南海合称三海。属于中国古代皇家园林。全园以北海为中心，面积约71公顷，水面占583市亩，陆地占480市亩。这里原是辽、金、元建离宫，明、清辟为帝王御苑，是中国现存最古老、最完整、最具综合性和代表性的皇家园林之一，1925年开放为公园。为全国重点文物保护单位，是国家AAAA级旅游景区。2019年5月6日，首届北京牡丹文化节在延庆开幕，北海公园的牡丹芍药种植面积达1500余平方米。")
        sleep(2)
        system("clear")
    elif a=="南锣鼓巷":
        b("南锣鼓巷是一条胡同，位于北京中轴线东侧的交道口地区，北起鼓楼东大街，南至平安大街，宽8米，全长787米，于元大都同期建成。是北京最古老的街区之一，已有740多年的历史。也位列规划中的25片旧城保护区之中。因其地势中间高、南北低，如一驼背人，故名罗锅巷。到了清朝，乾隆十五年（1750年）绘制的《京城全图》改称南锣鼓巷。它是北京最古老的街区之一，是我国唯一完整保存着元代胡同院落肌理、规模最大、品级最高、资源最丰富的棋盘式传统民居区，也是最赋有老北京风情的街巷。周边胡同里各种形制的府邸、宅院多姿多彩，厚重深邃。南锣鼓巷及周边区域曾是元大都的市中心，明清时期则更是一处大富大贵之地，这里的街街巷巷挤满了达官显贵，王府豪庭数不胜数，直到清王朝覆灭后，南锣鼓巷的繁华也跟着慢慢落幕。现已完全改造成为步行街，车辆不可通行。2016年4月25日零时起，南锣鼓巷暂停接待旅游团队。同时，由于不堪景区客流量超载，南锣鼓巷主动取消了3A景区称号。2016年12月20日，南锣鼓巷历史文化街区风貌保护导则正式发布并执行。")
        sleep(2)
        system("clear")
    elif a=="三里屯":
        b("三里屯位于北京市朝阳区中西部。因距内城三里而得名。现在因三里屯酒吧街而闻名。三里屯酒吧街是北京夜生活最“繁华”的娱乐街之一。")
        sleep(2)
        system("clear")
    elif a=="京酱肉丝":
        b("京酱肉丝，是一道知名度很高的菜肴，它是北京菜中的经典代表菜之一。制作时选用猪瘦肉为主料，辅以甜面酱、葱、姜及其它调料，用北方特有烹调技法“六爆”之一的“酱爆”烹制而成。成菜后，咸甜适中，酱香浓郁，风味独特。")
        sleep(2)
        system("clear")
    elif a=="香山公园":
        b("香山公园，位于北京市海淀区买卖街40号，北京市区西北郊，占地188公顷，是一座具有山林特色的皇家园林。景区内主峰香炉峰俗称“鬼见愁”，海拔557米。早在元、明、清时，皇家就在香山营建离宫别院，每逢夏秋时节皇帝都要到此狩猎纳凉。咸丰十年（1860年）和光绪二十六年（1900年）先后两次被英法联军、八国联军焚毁，1956年开辟为人民公园。香山公园有香山寺、洪光寺等著名旅游景点。香山公园于1993年被评为首都文明单位，2001年被国家旅游局评为AAAA景区，2002年被评为首批北京市精品公园。")
        sleep(2)
        system("clear")
    elif a=="北京欢乐谷":
        b("北京欢乐谷是国家AAAA级旅游景区、新北京十六景、北京文化创意产业基地，由华侨城集团创办，是集国际化、现代化的主题公园。欢乐谷位于北京市朝阳区东四环四方桥东南角，占地56万平方米。其中，公园一期占地约54万平方米，于2006年7月29日正式开放。公园二期、三期分别占地5万平方米和40多万平方米。公园分别由峡湾森林、亚特兰蒂斯、失落玛雅、爱琴港、香格里拉、甜品王国和欢乐时光七个主题区组成。北京欢乐谷设置了50余项主题景观、10余项主题表演、30多项主题游乐设施、20余项主题游戏及商业辅助设施，每天提供近80场的表演，可以满足不同人群的需要。获得过“中国文化创意产业高成长企业百强”“首都旅游紫禁杯先进集体”“首都文明旅游景区”等荣誉。2019年6月28日，北京欢乐谷五期·香格里拉区正式对外开放，“雅鲁藏布江大漂流”亮相欢乐谷。")
        sleep(2)
        system("clear")
    elif a=="欢乐谷":
        b("作为中国主题公园的开拓者和领军企业，欢乐谷集团始终以“创造、传递、分享欢乐”为使命，以“繁华都市开心地”为定位，在不同的城市，奉献同样的欢乐，让每一位游客都能与所爱尽享欢乐时光！\n")
        sleep(2)
        system("clear")
    elif a == "母亲节":
	    b("母亲节（Mother's Day），是一个感谢母亲的节日。母亲们在这一天通常会收到礼物，康乃馨被视为献给母亲的花，而中国的母亲花是萱草花，又叫忘忧草。")    
	    b("快去祝你们的妈妈节日快乐吧！")
	    sleep(3)
	    system("clear")
    elif a == "跑男"or a =="奔跑吧"or a == "奔跑吧，兄弟":
        b("""《奔跑吧》第4季是一档由浙江卫视推出的真人秀节目，是节目《奔跑吧兄弟》的第8季。节目的常驻嘉宾有李晨、baby、郑恺、黄旭熙、宋雨琦，沙溢、蔡徐坤、郭麒麟。""")
        sleep(3)
        system("clear")
    elif a == "《极限挑战》"or a == "极限挑战":
        b("""《极限挑战》是上海东方卫视推出的大型励志体验真人秀节目，
《极限挑战》包括：《极限挑战第一季》《极限挑战第二季》《极限挑战第三季》《极限挑战第四季》《极限挑战第五季》《极限挑战第六季》。
《极限挑战》第一至四季六位固定成员为黄渤、孙红雷、黄磊、罗志祥、王迅、张艺兴；第五季正式加入成员为雷佳音、迪丽热巴、岳云鹏。 [1]  第六季正式加入成员为贾乃亮、邓伦、郭京飞。 [2]  2015年6月14日，节目在东方卫视首播。
《极限挑战第六季》于2020年5月10日起每周日晚21:00在东方卫视播出。""")
    elif a == "度娘":
        b("""度娘是百度的萌化形象，指的是百度搜索，有事请问度娘，代指用百度搜索引擎搜索。表达了众多网友对百度的一种很形象的印象，同时也很好地推广了百度公司品牌形象。""")
        sleep(3)
        system("clear")
    elif a == "官方邮箱"or a == "邮箱":
        b("""免费邮箱是为任何人免费提供的电子邮件传输服务。\n如：QQ邮箱、网易邮箱等……\n星光的官方邮箱：xingguanggzs@163.com""")
        b("如果没有QQ，请使用邮箱。欢迎大家来写信给我们提提意见。")
        sleep(3)
        system("clear")
    elif a == "郭德纲":
        b("""郭德纲，男，1973年1月18日出生于天津市，相声演员，电影、电视剧演员，电视脱口秀主持人。
1979年投身艺坛，先拜评书前辈高庆海学习评书，后跟随相声名家常宝丰学相声，又师从相声大师侯耀文。其间又学习了京剧、评剧、河北梆子等剧种，辗转梨园多年。
1995年，创办北京德云社。 [1]  2005年起，郭德纲及其德云社异军突起，使公众重新关注相声这一艺术门类，实现了相声的二次复兴。 [2]  2006年于解放军歌剧院举办德云社相声专场，同年于天津人民体育馆举行德云社省亲相声专场，创下连续25次返场纪录。 [3-4]  2008年于北京人民大会堂举办相声专场，成为第一个在人民大会堂举办个人专场演出的相声演员。 [5-6]  2009年，参演电影《建国大业》。 [7] 
2010年主持《今夜有戏》。 [8]  2011年荣登美国《纽约时报》。 [9-11]  2012年出演电影《车在囧途》，同年获“亚洲最杰出艺人奖”与第七届华鼎奖中国最佳曲艺男演员奖 [12-13]  2013年首次登上中国中央电视台春节联欢晚会。主持江苏卫视郭的秀。 [14-15]  2014年出演电影大话天仙；同年参演悬疑电影秘术。 [16]  担任《我为喜剧狂》导师并留任第二季。 [17-18]  2015年郭德纲自导自演电影《我要幸福》。 [19]  同年主持纲到你身边。 [20]  2016年举行“德云社成立二十周年”开幕式庆典，并展开全球相声巡演。 [21]  2016-2020年五度担任东方卫视《欢乐喜剧人》喜剧观察员。 [22-24] 
2017年12月29日，郭德纲首档脱口秀网络综艺节目《一郭汇》每周五晚8点在西瓜视频与今日头条平台上独家播放。 [25] 
2018年2月16日，郭德纲执导的喜剧电影《祖宗十九代》公映并斩获1亿票房。""")
        sleep(3)
        system("clear")
    elif a == "吴京":
        b("吴京，1974年4月3日出生于北京，毕业于北京体育大学。中国内地影视男演员、电影导演，中国电影家协会副主席。 [1] 1989年进入北京市武术队。1994年获得全国武术比赛精英赛枪术、对练冠军。1995年出演个人首部电影《功夫小子闯情关》，从而进入演艺圈。1998年因在古装剧《太极宗师》中饰演杨昱乾一角而被观众熟知。1999年主演武侠剧《小李飞刀》 [2]  。2003年赴香港发展电影事业。2005年参演动作片《杀破狼》并首次尝试反派角色。2007年，凭借动作警匪片《男儿本色》获得第44届台湾电影金马奖最佳男配角提名 [3]  。2008年开始转型担任导演，并于同年执导导演处女作《狼牙》。2012年在军旅剧《我是特种兵之利刃出鞘》中首度饰演军人 [4]  。2015年主演犯罪悬疑片《杀破狼2》；同年，自编自导自演军事战争片《战狼》，并凭借该片获得第33届大众电影百花奖最佳导演奖提名、第22届北京大学生电影节最佳处女作奖、第20届华鼎奖最佳新锐导演奖 [5]  。2017年自导自演动作片《战狼Ⅱ》，该片创下国产电影历史最高票房记录及全球单一市场单片最高票房记录 [6-7]  ，而其个人则凭借该片先后获得第34届大众电影百花奖最佳男主角奖 [8]  、第17届中国电影华表奖优秀男演员奖 [9]  。2019年，担任科幻电影《流浪地球》的出品人，并特别出演“刘培强”一角 [10-11]  。2020年02月，演唱文艺界抗击疫情主题MV《坚信爱会赢》。 [12]")
        sleep(3)     
        system("clear") 
    elif a == "成龙":
        b("成龙（Jackie Chan），1954年4月7日出生于香港，祖籍安徽芜湖，中国男演员、导演、国家一级演员、制作人、编剧、歌手 [1]  。1971年以武师身份进入电影圈 [2]  。1978年以电影《蛇形刁手》、《醉拳》确立功夫喜剧的动作风格 [3]  。1980年自导自演的动作片《师弟出马》打破香港地区票房纪录 [4]  。1986年自导自演的动作片《警察故事》获得第5届香港电影金像奖最佳影片奖 [5]  。1989年获得大不列颠帝国勋章 [3]  。1992年凭借警匪片《警察故事3超级警察》获第29届台湾电影金马奖最佳男主角奖。1993年凭借警匪片《重案组》蝉联台湾电影金马奖最佳男主角 [6]  。1995年凭借动作片《红番区》打入美国好莱坞，该片打破北美外语片票房纪录 [7-8]  。1998年主演的动作片《尖峰时刻》奠定其在好莱坞的地位 [9]  。2001年主演的动作片《尖峰时刻2》创下华人演员主演好莱坞电影的票房纪录 [10]  。2005年凭借警匪片《新警察故事》获第25届中国电影金鸡奖最佳男主角奖 [11]  ；同年获上海国际电影节华语电影海外贡献奖 [12]  。2012年被美国《纽约时报》评为“史上20位最伟大的动作影星”第一位 [13]  ；同年被吉尼斯世界纪录大全评为“表演特技最多的演员” [14]  。2016年获第89届奥斯卡终身成就奖 [15]  。截至2020年，其主演50余部电影全球累计票房超过250亿元，并7次获得香港地区年度票房冠军，17次获得华语片全球票房冠军 [16]  。演艺事业外，成龙热心公益事业。1988年被评为世界十大杰出青年 [3]  。2003年当选感动中国十大人物 [17]  。2004年担任联合国儿童基金会亲善大使 [18]  。2006年入选《福布斯》全球十大慈善之星 [19]  。")
        sleep(3)     
        system("clear")
    elif a == "安慕希":
        b("伊利安慕希 [1]  引入希腊酸奶，旨在为人们带来更多营养与浓醇享受。而相比其它高端常温酸奶，伊利“安慕希”也具有明显的特色。来源于希腊的“Ambrosial”，更添加了希腊雅典农业大学最新研制的菌种，具有浓郁的口感和更多的蛋白质，比普通酸奶高出蛋白质35%，最长保质期六个月。")
        sleep(3)     
        system("clear")
    elif a == "蒙牛":
        b("蒙牛乳业（集团）股份有限公司 [1]  （简称蒙牛乳业或蒙牛），成立于1999年8月，总部设在内蒙古呼和浩特市和林格尔县盛乐经济园区，是国家农业产业化重点龙头企业、乳制品行业龙头企业。 [2-4]  蒙牛是中国领先的乳制品供应商，专注于研发生产适合国人健康的乳制品，全球乳业10强。蒙牛乳业成立以来，已形成了拥有液态奶、冰淇淋、奶粉奶酪等多品的产品矩阵系列，拥有特仑苏、纯甄、优益C、未来星、冠益乳、酸酸乳等产品。截至2017年12月，蒙牛根据市场潜力及产品策略布局产能，在全国建立了38个生产基地，新西兰海外1个基地，年产能合922万吨。2017年，蒙牛实现收入601.56亿元。高端UHT奶、低温酸奶份额保持领先。 [5] 2009年7月，中国最大的粮油食品企业中粮集团入股蒙牛，成为蒙牛第一大股东。中粮的加入，推动了蒙牛“食品安全更趋国际化，战略资源配置更趋全球化，原料到产品更趋一体化”进程。 [6]  2017年7月12日，全球最大的专注于农业与食品相关产业的商业机构之一荷兰合作银行发布了2017年“全球乳业20强”榜单，蒙牛乳业连续9年再度入榜，跃居榜单前10强，排名上升一位。2018年3月27日，蒙牛发布了2017年业绩报，总收入为人民币601.556亿元，比2016年的537.793亿元增长11.9%；净利润20.478亿元。 [7]  2019年8月28日，蒙牛乳业在港发布2019年中期业绩公告。期内，蒙牛实现销售收入398.572亿元，同比增长15.6%，实现净利润20.769亿元，同比增长33%，其中液态奶收入同比增长14.4%，增幅远超行业水平。 [8]")
        sleep(3)     
        system("clear")
    elif a == "岳云鹏":
        b("岳云鹏，本名岳龙刚，1985年4月15日出生于河南濮阳，中国内地相声、影视男演员 [1]  。2004年，投身相声界，拜郭德纲为师，主攻相声、太平歌词、竹板书。2005年，首次登台演出。2012年，主演卢卫国执导的喜剧电影《就是闹着玩的》。2013年在北京举办相声专场。2014年中央电视台春节联欢晚会参演小品《扰民了你》获得春晚节目三等奖。2015年中央电视台春节联欢晚会与孙越表演相声《我忍不了》。 [2]  同年主演喜剧电影《煎饼侠》和电视剧《先生，你哪位》，其改编的《五环之歌》也成为了《煎饼侠》的推广曲。2015年12月加盟央视一套户外真人秀《了不起的挑战》和浙江卫视真人秀《西游奇遇记》。 [3-5]  2016年1月加盟东方卫视明星喜剧竞赛真人秀《欢乐喜剧人第二季》并获得总冠军； [6-7]  4月主演电影《大闹天竺》； [8]  5月主演电影《从你的全世界路过》； [9]  7月主演电影《疯岳撬佳人》 [10]  8月主演电影《欢乐喜剧人》； [11]  9月加盟浙江卫视喜剧竞演综艺节目《喜剧总动员》 [12]  、主演电影《断片之险途夺宝》； [13]  12月加盟江苏卫视户外明星挑战类真人秀《我们的挑战》。 [14]  2017年2月加盟浙江卫视美食传情感恩真人秀《熟悉的味道第二季》； [15-16]  4月主演电影《妖铃铃》，饰演徐天宇； [17]  8月主演电影《祖宗十九代》，饰演贝小贝； [18]  12月主演电影《鼠胆英雄》，饰演闫大海。 [19]  2018年4月加盟江苏卫视音乐唱作真人秀《无限歌谣季》； [20]  6月加盟《SNL》中国版《周六夜现场》 [21]  。2019年8月，福布斯发布中国100名人榜，岳云鹏位列93位。 [22]")
        sleep(3)     
        system("clear")
    elif a == "金庸":
        b("金庸（1924年3月10日—2018年10月30日），本名查良镛，生于浙江省海宁市，1948年移居香港。当代武侠小说作家、新闻学家、企业家、政治评论家、社会活动家，被誉为“香港四大才子”之一，与古龙、梁羽生、温瑞安并称为中国武侠小说四大宗师。 [1-5] 1944年，金庸考入重庆中央政治大学外交系。1946年秋，进入上海《大公报》任国际电讯翻译。1948年，毕业于上海东吴大学法学院，并被调往《大公报》香港分社 [6]  。1952年调入《新晚报》编辑副刊，并写出《绝代佳人》《兰花花》等电影剧本。1959年，金庸等人于香港创办《明报》 [7]  。1985年起，历任香港特别行政区基本法起草委员会委员、政治体制小组负责人之一，基本法咨询委员会执行委员会委员，以及香港特别行政区筹备委员会委员。1994年，受聘北京大学名誉教授 [8]  。2000年，获得大紫荆勋章。2007年，出任香港中文大学文学院荣誉教授 [6]  。2009年9月，被聘为中国作协第七届全国委员会名誉副主席 [9-10]  ；同年荣获2008影响世界华人终身成就奖 [11]  。2010年，获得剑桥大学哲学博士学位 [2]  。2018年10月30日，金庸在香港逝世，享年94岁。 [12]  入围感动中国2018候选人物。 [13]")
        sleep(3)     
        system("clear")
    elif a == "李小龙":
        b("李小龙（1940年11月27日—1973年7月20日），原名李振藩，师承叶问，1940年出生于美国加州旧金山，祖籍中国广东省佛山市顺德区均安镇，世界武道变革先驱者、武术技击家、武术哲学家、MMA之父、武术宗师、功夫片的开创者和截拳道创始人、华人武打电影演员，中国功夫首位全球推广者、好莱坞首位华人主角。他在香港的四部半电影3次打破多项记录，其中《猛龙过江》打破了亚洲电影票房记录，与好莱坞合作的《龙争虎斗》全球总票房达2.3亿美元。 [1] 1962年李小龙开办“振藩国术馆”，1967年自创截拳道，1973年7月20日，李小龙在香港逝世，年仅33岁。1979年美国洛杉矶市政府将补拍版《死亡游戏》的开映日6月8日定为“李小龙日”（7月8日为错误翻译）。1993年美国发行李小龙逝世20周年纪念钞票，好莱坞大道铺上李小龙纪念星徽；同年，获香港电影金像奖大会颁发“终身成就奖”。1998年11月，获中国武术协会颁发“武术电影巨星奖”。")
        sleep(3)     
        system("clear")
    elif a == "叶问":
        b("叶问（Yip Man，1893年10月1日—1972年12月1日），原名叶继问 [1]  ，曾用名叶溢，祖籍广东省南海县桑园，毕业于香港圣士提反学院。师承陈华顺、梁璧，为咏春拳体系的开宗立派人。叶问幼年天资聪颖，然体弱多病，佛山咏春拳宗师梁赞的弟子陈华顺租用叶问家宗祠设馆授徒，叶问便有幸拜陈华顺为师，学习咏春拳术。陈华顺中风病逝后，叶问随师兄吴仲素苦练三年。翌年，叶问奉其父命来港就读于圣士提反学校，在此期间，认识梁赞先生之子梁璧，并随梁璧修练咏春拳术。1946年，叶问出任佛山警察局刑侦队队长、督察长、代理局长，1949年出任广州市卫戍司令部南区巡逻队上校队长 [2]  。1949年，57岁的叶问离开佛山赴香港定居。此后二十多年里，他先后在港九饭店职工总工会、九龙汝州街、李郑屋村、通菜街等地设馆授徒。叶问在社会上和武术界很有威望，跟其习武者遍及社会各阶层，其中不乏外国留学生。1971年，叶问弟子成立了“咏春体育会”，集教授、研究、交流咏春拳术为一体，并以此为中心，将咏春传播至世界。叶问的传奇人生也被后人拍成电影。叶氏门下高徒辈出，特别是凭着非凡的中国功夫扬威世界的李小龙 [3]  。1972年12月1日，叶问在香港病逝，享年79岁。")
        sleep(3)     
        system("clear")
    elif a == "马化腾":
        b("""马化腾，汉族，1971年10月29日生于广东省东方县八所港（今属海南省东方市），广东省汕头市潮南区人 [1-2]  。1993年获深圳大学理学学士学位。腾讯公司主要创办人之一。现任腾讯公司董事会主席兼首席执行官；全国青联副主席；全国人大代表。 [3] 1984年随父母从海南迁至深圳，1993年毕业于深圳大学计算机系。同年进入深圳润迅通讯发展有限公司开始寻呼系统的研究开发工作。1995年创建惠多网深圳站，名为ponysoft。1998年，马化腾和同学张志东注册成立"深圳市腾讯计算机系统有限公司"，随后陈一丹、许晨晔、曾李青相继加入。2017年8月7日，腾讯股价盘中再创历史新高价320.6港元，马化腾身家361亿美元成为中国首富。 [4]  2018年4月，获《时代周刊》2018年全球最具影响力人物荣誉。 [5]  2018年10月25日，福布斯发布了2018福布斯中国400富豪榜，马化腾凭借328亿美元的身家蝉联榜单第二名。2018年12月18日，党中央、国务院授予马化腾同志改革先锋称号，颁授改革先锋奖章 [6]  。2019年3月，马化腾以388亿美元财富排名2019年福布斯全球亿万富豪榜第20位。 [7]  2019年9月5日，突破奖基金会及其赞助人——马化腾等人共同宣布2020年突破奖及新视野奖的获得者。 [8]  2019福布斯中国慈善榜排名第4位。 [9]  2019年10月19日，入选2019福布斯年度商业人物之跨国经营商业领袖名单。 [10]  2019年11月7日，以2,545.50亿元财富值位列2019福布斯中国400富豪榜第2名。 [11-12]""")
        sleep(3)     
        system("clear")
    elif a == "马云":
        b("马云，男，汉族，中共党员 [1]  ，1964年9月10日生于浙江省杭州市，祖籍浙江省嵊州市谷来镇， 阿里巴巴集团主要创始人，现担任日本软银董事、大自然保护协会中国理事会主席兼全球董事会成员、华谊兄弟董事、生命科学突破奖基金会董事、联合国数字合作高级别小组联合主席。 [2-3] 1988年毕业于杭州师范学院外语系，同年担任杭州电子工业学院英文及国际贸易教师，1995年创办中国第一家互联网商业信息发布网站“中国黄页”，1998年出任中国国际电子商务中心国富通信息技术发展有限公司总经理，1999年创办阿里巴巴，并担任阿里集团CEO、董事局主席。2013年5月10日，辞任阿里巴巴集团CEO，继续担任阿里集团董事局主席。 [4]  6月30日，马云当选全球互联网治理联盟理事会联合主席。 [5]  2019年9月10日，马云卸任阿里巴巴董事局主席，继续担任阿里巴巴集团董事会成员。 [6-7] 2017年12月15日，荣获“影响中国”2017年度教育人物 [8]  。2018年9月10日，马云发出公开信宣布将于2019年9月10日卸任集团董事局主席，由CEO张勇接任。 2018年12月18日，党中央、国务院授予马云同志改革先锋称号，颁授改革先锋奖章。 [9]  2019年3月，马云以373亿美元财富排名2019年福布斯全球亿万富豪榜第21位。 [10]  2019年5月10日，马云等17位全球杰出人士被联合国秘书长古特雷斯任命为新一届可持续发展目标倡导者。 [11]  2019福布斯中国慈善榜排名第3位 [12]  。2019年10月获得福布斯终身成就奖 [13]  。2019年10月19日，入选2019福布斯年度商业人物之跨国经营商业领袖名单 [14]  。")
        sleep(3)     
        system("clear")
    elif a == "刺激战场"or a == "和平精英":
        b("《和平精英》是腾讯光子工作室群研发的反恐军事竞赛体验手游， [1]  该作于2019年5月8日正式公测。 [2-3] 《和平精英》采用虚幻4引擎研发，致力于从画面、地图、射击手感等多个层面，为玩家全方位打造出极具真实感的军事竞赛体验。 [2]")
        sleep(3)     
        system("clear")
    elif a == "王者荣耀":
        b("""《王者荣耀》是由腾讯游戏天美工作室群开发并运行的一款运营在Android、IOS、NS平台上的MOBA类手机游戏，于2015年11月26日在Android、IOS平台上正式公测，游戏前期使用名称有《英雄战迹》、《王者联盟》。《Arena Of Valor》，即《王者荣耀》的欧美版本于2018年在任天堂Switch平台发售。 [1] 
王者荣耀中的玩法以竞技对战为主，玩家之间进行1V1、3V3、5V5等多种方式的PVP对战，还可以参加游戏的冒险模式，进行PVE的闯关模式，在满足条件后可以参加游戏排位赛等。
2016年11月，《王者荣耀》荣登2016中国泛娱乐指数盛典“中国IP价值榜-游戏榜top10”。 [2]  2017年7月2日，腾讯方面发出游戏“限时令”：7月4日起《王者荣耀》12周岁以下(含12周岁)未成年人每天限玩1小时，并计划上线晚上9时以后禁止登陆功能；12周岁以上未成年人每天限玩2小时。超出时间的玩家，将被游戏强制下线。
2018年10月25日，腾讯再次升级“《王者荣耀》健康系统”，以北京地区为起点，正式启动《王者荣耀》全部用户的强制公安实名校验，未通过校验的游戏账号将禁止登录。同时，为杜绝未成年人“玩小号”的问题，一个未成年人实名信息仅允许用于微信和QQ平台各一个游戏账号的校验。 [3]  11月29日，王者荣耀升级人脸识别验证 [4]  。2020年5月15日起，游戏限制未成年用户玩游戏的时间，并对未成年用户设置消费限制 [5]  。
2018年11月24日，王者荣耀在2018中国科幻大会上获得最佳科幻游戏奖。 [6]""")
        sleep(3)     
        system("clear")
    elif a == "第五人格":
        b("《第五人格》是由网易开发的非对称性对抗竞技类（Asymmetrical Battle Arena）游戏， [1]  游戏于2018年4月2日开启公测。 [2-3] 玩家将扮演侦探奥尔菲斯，在收到一封神秘的委托信后，进入恶名昭著的庄园调查一件失踪案。在进行证据调查过程中，玩家扮演的奥尔菲斯将采用演绎法，对案情进行回顾。在案情回顾时，玩家可以选择扮演监管者或求生者，展开激烈的对抗。而在调查的过程，无限接近事实时，却发现越来越不可思议的真相。 [4] 荒诞哥特画风，悬疑烧脑剧情，刺激的1V4“猫鼠追逃游戏”的对抗玩法，都将给玩家带来全新的游戏体验。")
        sleep(3)     
        system("clear")
    elif a == "火影忍者":
        b("电视动画《火影忍者》改编自日本漫画家岸本齐史的同名漫画，2002年10月3日在东京电视台系列全6局、岐阜放送首播，共220话；第二季《火影忍者疾风传》于2007年2月15日－2017年3月23日在东京电视台播出，共500话；累计全720话。故事成功地将原本隐藏在黑暗中，用世界上最强大的毅力和最艰辛的努力去做最密不可宣和隐讳残酷的事情的忍者，描绘成了太阳下最值得骄傲最光明无限的职业。系列续作《BORUTO -火影新世代- 》2017年4月播出。 [1] ")
        sleep(3)     
        system("clear")
    elif a == "航海王"or a == "海贼王":
        b("《航海王》是日本漫画家尾田荣一郎作画的少年漫画作品，于1997年7月22日在集英社《周刊少年Jump》开始连载。改编的电视动画《航海王》于1999年10月20日起在富士电视台首播。2012年5月11日，《航海王》获得第41回日本漫画家协会赏 [1]  。本作被吉尼斯世界纪录官方认证为“世界上发行量最高的单一作者创作的系列漫画” [2]  。2017年7月21日，日本纪念日协会通过认证，将每年的7月22日设立为“ONE PIECE纪念日” [3]")
        sleep(3)     
        system("clear")
    elif a == "钟南山":
        b("钟南山，男，汉族，福建厦门人，1936年10月出生于南京，中共党员，中国工程院院士，著名呼吸病学专家，中国抗击非典型肺炎的领军人物，曾任广州医学院院长、党委书记，广州市呼吸疾病研究所所长、广州呼吸疾病国家重点实验室主任、中华医学会会长。 [1-3] 钟南山出生于医学世家；1958年8月，在第一届全运会的比赛测验中，钟南山以54秒2的成绩，打破了当时54秒6的400米栏全国纪录。 [4]  1960年毕业于北京医学院（今北京大学医学部）；2007年获英国爱丁堡大学荣誉博士；2007年10月任呼吸疾病国家重点实验室主任；2014年获香港中文大学荣誉理学博士 [5]  。钟南山长期从事呼吸内科的医疗、教学、科研工作。重点开展哮喘，慢阻肺疾病，呼吸衰竭和呼吸系统常见疾病的规范化诊疗、疑难病、少见病和呼吸危重症监护与救治等方面的研究。 [6] 现任国家呼吸系统疾病临床医学研究中心主任 [7]  、国家卫健委高级别专家组组长、 [8]  国家健康科普专家。 [9]")
        sleep(3)     
        system("clear")
    elif a == "SARS"or a =="非典":
        b("SARS事件是指严重急性呼吸综合征（英语：SARS）于2002年在中国广东发生，并扩散至东南亚乃至全球，直至2003年中期疫情才被逐渐消灭的一次全球性传染病疫潮。在此期间发生了一系列事件：引起社会恐慌，包括医务人员在内的多名患者死亡，世界各国对该病的处理，疾病的命名，病原微生物的发现及命名，联合国、世界卫生组织及媒体的关注等等。截止2003年8月16日，中国内地累计报告非典型肺炎临床诊断病例5327例，治愈出院4959例，死亡349例(另有19例死于其它疾病，未列入非典病例死亡人数中)。 [1] 中国香港：1755例，死亡300人；中国台湾：665例，死亡180人；加拿大：251例，死亡41人；新加坡：238例，死亡33人；越南：63例，死亡5人。")
        sleep(3)     
        system("clear")
    elif a == "埃博拉":
        b("埃博拉（Ebola virus）又译作伊波拉病毒。是一种十分罕见的病毒，1976年在苏丹南部和刚果（金）（旧称扎伊尔）的埃博拉河地区发现它的存在后，引起医学界的广泛关注和重视，“埃博拉”由此而得名。是一个用来称呼一群属于纤维病毒科埃博拉病毒属下数种病毒的通用术语。埃博拉病毒是一种能引起人类和其他灵长类动物产生埃博拉出血热的烈性传染病病毒，其引起的埃博拉出血热（EBHF）是当今世界上最致命的病毒性出血热，感染者症状与同为纤维病毒科的马尔堡病毒极为相似，包括恶心、呕吐、腹泻、肤色改变、全身酸痛、体内出血、体外出血、发烧等。死亡率在50%至90%不等， [1]  致死原因主要为中风、心肌梗塞、低血容量休克或多发性器官衰竭。 [2] 埃博拉病毒，生物安全等级为4级（艾滋病为3级，SARS为3级，级数越大防护越严格）。病毒潜伏期可达2至21天，但通常只有5天至10天。 [3-4] 世界卫生组织2016年12月23日宣布，由加拿大公共卫生局研发的疫苗可实现高效防护埃博拉病毒。 [5]")
        sleep(3)
        system("clear")
    elif a == "抖音":
        b("""抖音短视频，是一款音乐创意短视频社交软件，由今日头条孵化，该软件于2016年9月上线，是一个专注年轻人音乐短视频社区平台。用户可以通过这款软件选择歌曲，拍摄音乐短视频，形成自己的作品，会根据用户的爱好，来更新用户喜爱的视频。
2019年12月，抖音入选2019中国品牌强国盛典榜样100品牌。 
截至2019年12月31日，抖音封禁涉嫌刷量作弊的违规抖音账号203万，封禁100万粉丝以上抖音账号293个，封禁10万粉丝以上抖音账号4638个，封禁涉嫌黑产带货抖音账号17089个。  
2020年1月8日，火山小视频和抖音正式宣布品牌整合升级，火山小视频更名为抖音火山版，并启用全新图标。""")
        sleep(3)
        system("clear")
    elif a == "文言文":
        b("""古代汉语是与现代汉语相对而言的，它指的是“五四“运动以前汉民族所使用的语言。
现今文言文是中国古代的一种书面语言组成的文章，主要包括以先秦时期的口语为基础而形成的书面语言。春秋战国时期，用于记载文字的物品还未被发明，记载文字用的是竹简、丝绸等物。随着历史变迁，口语的演变，文言文和口语的差别逐渐扩大，“文言文”成了读书人的专用。
文言文是相对现今新文化运动之后白话文来讲的，古代并无文言文这一说法。其特征是注重典故、骈骊对仗、音律工整，包含策、诗、词、曲、八股、骈文等多种文体。经过历代文人修饰越显浮华，唐代起大文学家韩愈等发起“古文运动”，主张回归通俗古文。现代书籍中的文言文，为了便于阅读理解，一般都会对其标注标点符号。""")
        sleep(3)
        system("clear")
    elif a == "哔哩哔哩"or a == "bilibili" or a == "B站":
        b("""哔哩哔哩（Nasdaq:BILI [1]  ；英文名称：bilibili，简称B站）现为中国年轻世代高度聚集的文化社区和视频平台 [2]  ，该网站于2009年6月26日创建，被粉丝们亲切的称为“B站”。2018年3月28日，哔哩哔哩在美国纳斯达克上市 [3]  。
B站早期是一个ACG（动画、漫画、游戏 [4]  ）内容创作与分享的视频网站 [5]  。经过十年多的发展，围绕用户、创作者和内容，构建了一个源源不断产生优质内容的生态系统 [2]  ，B站已经涵盖7000多个兴趣圈层的多元文化社区 [6]  ，曾获得QuestMobile研究院评选的“Z世代偏爱APP”和“Z世代偏爱泛娱乐APP”两项榜单第一名 [7]  并入选“BrandZ”报告2019最具价值中国品牌100强 [8]  。
2019年4月22日，针对“后台源码泄露”一事，B站做出回应：经内部紧急核查，确认该部分代码属于较老的历史版本 [9]  ；5月29日，哔哩哔哩发布通知称，因弹幕系统技术升级，5月29日起至6月6日网站暂时关闭弹幕功能 [10]  。
截至2019年第三季度，B站月均活跃用户达1.28亿，移动端月活用户达1.14亿 [11]  ；18至35岁用户占比达78%。 [2] 
2020年1月9日，胡润研究院发布《2019胡润中国500强民营企业》，哔哩哔哩位列第180位。
2020年3月18日B站2019年Q4及全年财报：全年营收67.8亿元，同比增长64% [12]  。""")
        sleep(3)
        system("clear")
    elif a == "迷人的郭老师"or a == "郭老师"or a== "郭蓓蓓":
        b("""抖音网红“迷人的郭老师”，本名郭蓓蓓 [1]  ，出生于1994年，她的身上标签很多，比如:宠粉狂魔、不做作、自作曲女王以及自创郭语等等。郭老师之所以能够走红，靠的绝绝对对是自己独特的人格魅力。大家看到直播的郭老师，经常是大大咧咧，头发枯黄干燥油光满面，且说话搞笑的大可爱。 [2]""")
        sleep(3)
        system("clear")
    elif a == "辽宁朝阳冬泳怪鸽"or a == "奥利给大叔"or a == "巨魔战将"or a == "冬泳怪鸽":
        b("“又称巨魔战将，因长相神似游戏《dota 2》中的巨魔（一位敏捷性英雄）而得此名，来自辽宁朝阳县，喜欢冬泳。41的脚穿45的鞋，而且不穿袜子。口头禅：1：坚持，才是胜利！加油，奥利给！2：大枣小米水饭，再清炒两个鸡蛋。”")
        sleep(3)
        system("clear")
    elif a == "快手":
        b("快手是北京快手科技有限公司旗下的产品。快手 [1-2]  的前身，叫“GIF快手”，诞生于2011年3月，最初是一款用来制作、分享GIF图片的手机应用。2012年11月，快手从纯粹的工具应用转型为短视频社区，用于用户记录和分享生产、生活的平台。后来随着智能手机的普及和移动流量成本的下降，快手在2015年以后迎来市场。 [3]")
        sleep(3)
        system("clear")
    elif a == "唐"or a == "唐朝"or a == "大唐":
        b("""唐朝（618年—907年），是继隋朝之后的大一统中原王朝，共历二十一帝，享国二百八十九年。 [1-2] 
隋末天下群雄并起，617年唐国公李渊于晋阳起兵，次年称帝建立唐朝，定都长安。唐太宗继位后开创贞观之治，为盛唐奠定基础。唐高宗承贞观遗风开创“永徽之治”，并于657年建东都洛阳 [3-7]  。690年，武则天改国号为周， [8]  705年神龙革命后，恢复唐国号。 [9-10]  唐玄宗即位后缔造全盛的开元盛世， [2]  [11]  天宝末全国人口达八千万左右。 [12-15]  安史之乱后藩镇割据、宦官专权导致国力渐衰；中后期经唐宪宗元和中兴、唐武宗会昌中兴、唐宣宗大中之治国势复振。878年爆发黄巢起义破坏了唐朝统治根基，907年朱温篡唐，唐朝覆亡。
唐朝时万国来朝达到鼎盛，向其朝贡之国多达三百余。 [16]  疆域空前辽阔，极盛时东起日本海、南据安南、西抵咸海、北逾贝加尔湖，是中国自秦以来第一个未修据胡长城的大一统王朝。 [17-21]  唐朝攻灭东突厥、薛延陀后，唐太宗被四夷各族尊为天可汗 [22-25]  。又借羁縻制度征调突厥、回鹘、铁勒、契丹、靺鞨、室韦等民族攻伐敌国，并让日本、南诏、新罗、渤海国等藩属国学习自身的文化与制度。 [26] 
唐朝接纳各国交流学习，经济、社会、文化、艺术呈现出多元化、开放性等特点 [27-28]  ，诗、书、画、乐等方面涌现出大量名家，如诗仙李白、诗圣杜甫、诗魔白居易，书法家颜真卿，画圣吴道子，音乐家李龟年等。 [29] 
唐朝是当时世界上最强盛的国家之一，声誉远播，与亚欧国家均有往来。 [30]  唐以后海外多称中国人为“唐人”。""")
        sleep(3)
        system("clear")
    elif a == "朝代歌":
        print("""简单版
夏商周，春秋战。
秦朝以后是两汉，
三国两晋南北朝。
隋唐五代宋辽夏，
金元明清二十朝。
人教版
三皇五帝始，
尧舜禹相传。
夏商与西周，
东周分两段。
春秋和战国，
一统秦两汉。
三分魏蜀吴，
两晋前后延。
南北朝并立，
隋唐五代传。
宋元明清后，
皇朝至此完。""")
        input("看完按任意键继续：")
        system("clear")
    elif a == "老八"or a == "岛市老八":
        b("岛市老八，辽宁葫芦岛人，生于1989年5月21日[1]，原名不详，抖音UP主，现抖音号为“心酸老八（不忘初心)”。亦为前快手UP主，与2015年开始在该平台活动，后因上传《撤 硕 战 争 三 部 曲》三部恰奥利给视频等视频而被快手封杀，在停播数周后于抖音复出。其视频内容多为奇特料理制作及品尝，“不管是腥还是臭，到他嘴里都是肉”。由于年轻时没有努力和吃苦，现在不得不付出更大的代价得以继续生活也曾发布过一些不为社会生活所接受的作品。代表作有《撤硕战争三部曲》(又名《三顾茅庐》)、《老八秘制小汉堡》系列、《美食密码》系列等。2019年末，随着“奥利给”一词的大火，老八及其作品获得了广泛关注，成为了B站鬼畜区的重要素材。")
        sleep(3)
        system("clear")
    elif a == "金恺文":
        b("金恺文，男，11岁，生于2009年8月5日，卒于……尚未卒，IQ120，EQ105，霍格沃茨工作室程序管理员，代表作——HOGWARS电脑：https://code.xueersi.com/home/project/detail?lang=code&pid=4177436&version=python&form=python&langType=python，PythonL3（目前，暑假上L4），编程Python2级")
        sleep(3)
        system("clear")
    #提倡文明用语。
    elif a == "傻逼"or a == "脑残"or a == "智障"or a == "脑死"or a == "sb"or a == "SB"or a == "TMD"or a == "丑逼"or a == "小辣鸡"or a == "王八蛋"or a == "狗屎"or a == "混蛋"or a == "你妈炸了"or a == "我是你爸爸"or a == "死逼"or a == "我是你妈妈"or a == "二逼"or a == "你没有爸爸"or a == "吃屎"or a == "你妈了个逼"or a == "大傻逼":
        b("哎哎哎，别骂人，做文明少年。")
        sleep(1)
        system("clear")
    #两会
    elif a == "两会"or a == "2020年全国两会"or a == "全国两会":
        print("观看直播网址：http://www.iqiyi.com/kszt/2020qglhpc.html?vfm=m_144_bdal")
        b("\033[101m2020年全国两会即中华人民共和国第十三届全国人民代表大会第三次会议和中国人民政治协商会议第十三届全国委员会第三次会议。十三届全国人大三次会议于2020年5月22日在北京召开，全国政协十三届三次会议于2020年5月21日在北京召开。\033[0m")
        sleep(3)
        system("clear")
    elif a == "时间"or a == "现在时间"or a == "本地时间":
        clock = strftime("%H:%M:%S",localtime())
        print("现在是",clock)
        b("两秒后自动开始进入时间模式。")
        sleep(2)
        system("clear")
        while True:
            clock = strftime("%H:%M:%S",localtime())
            print(clock)
            sleep(1)
            system("clear")
    #抗击肺炎专区：
    elif a == "抗击肺炎":
        b("1.国内疫情 2.国外疫情")
        s = input("输入序号：")
        if s == "1":
            print("""现有确诊 无症状  现有疑似 现有重症    
116      404     6        5           
昨日-4   昨日+0 昨日+0   昨日+0     

累计确诊 境外输入 累计治愈 累计死亡
84546    1732     79785    4645
昨日+2   昨日+1   昨日+6   昨日+0""")
            input("按任意键继续")
            system("clear")
        elif s == "2": 
            print("""现有确诊   累计确诊  累计治愈    累计死亡
2930540    5697062    2414336    352186
昨日+27888 昨日+92641 昨日+60294 昨日+4459""")
            input("按任意键继续")
            system("clear")
        else:
            b("输入序号看不见吗？")
            sleep(2)
            system("clear")
    #哀悼专区：
    elif a == "何鸿燊"or a == "赌王"or a == "赌王逝世" or a == "何鸿燊逝世":
        system("clear")
        print("\033[4;30;47m  |🆒  酷喵一下，你就知道 ×\033[0;30;107m🆒  酷喵一下，调用词库 ×\033[4;30;47m  +                                          ➖   ⬜  ❌  \033[000m")
        print("\033[47m ←   →    ↩       🏚      🔒  https://www.PENGUO.kumiao.com/kumiaociku/diaoyong.2020     ★         · · ·  \033[0m") 
        print("\033[4m\033[47m   💯 百度    📚 学而思网校    🏦 PEN果公司   💽 酷喵浏览器    🌐 App Store   ⭐ 星光工作室     🎮  游戏中心   \033[000m\n")
        print("\033[37m何鸿燊逝世时间：2020.5.26 逝者安息，一路走好。")
        b("何鸿燊（1921年11月25日-2020年5月26日），生于香港，祖籍广东，港澳企业家，有“澳门赌王”之称，是何东爵士弟何福的孙儿之一，何世光儿子，在家中排行第九。何鸿燊拥有犹太、荷兰、英国、中国多个民族血统，按照何东家族的传统祖籍跟随母系的广东宝安。1961年，澳葡政府规定博彩业须通过专营制度实施，何鸿燊看准时机，重返澳门，与霍英东等人合作，一举拿下赌场独家专营权，迈出“赌王”之路的第一步。20世纪90年代初，又在澳门建立“皇宫赌场”等多个赌场。除香港和澳门外，何鸿燊亦在多个国家投资，包括越南、朝鲜、菲律宾、葡萄牙等。除博彩业之外，何鸿燊的产业还涉及房地产、建筑、船务、投资等多个领域。至2011年，其旗下的企业包括：澳门博彩控股有限公司、香港新濠国际集团、香港信德集团有限公司、澳门国际机场专营公司、王牌国际、澳门诚兴银行等。2008年1月，福布斯杂志公布他是香港第十九位富豪；2009年2月，福布斯杂志指出其身家因金融海啸暴跌近9成。至2011年，其控制的资产达5000亿港元，个人财富有700亿港元在2011年福布斯香港40名富豪榜中，以31亿美元（约合204亿元人民币）的身家排在第十三位。2018年6月12日，何鸿燊退任公司主席、执行董事及董事会执行委员会委员职务，全面退出董事会。 [1-2] 2020年5月26日，何鸿燊逝世，享年98岁。 [3] ")
        sleep(3)     
        system("clear")
    #逝者安息，一路走好。
    else:
        print("\033[91m对不起，酷喵搜索没有这个词，我们将会更新，你也可以联系作者缪子航＆李承骏，\n\033[96m缪子航微信：m2057161261/QQ：2057161261\n李承骏QQ：1210537623" )
        sleep(1)
        PEN("猜你喜欢：----- / apple / 哈哈 / 华为 / 欢乐谷")
        sleep(2)
        system("clear")#我是水印李承骏
#改编者：李承骏。
print("\033[8m")#我是水印李承骏，py版版权星光工作室，C++版版权PEN果公司。
#专属水印，内测版
#版本：1.0100
